[
  {
    "seasonNumber": 30,
    "episodeNumberInSeason": 1,
    "title": "Bart's Not Dead",
    "originalReleaseDate": "2018-09-30",
    "synopsis": "Bart refuses a dare to interrupt Lisa's saxophone performance at school, which makes Marge proud. Later, he takes part in a dare, which ends with him in a hospital. To avoid disappointing Marge, Bart makes a claim that he saw Heaven. Christian producers to make a movie about his experience with help from Homer and Ned, but he starts to feel guilty. Bart confesses to Marge that he lied, but the movie is successful. At a press conference, the lie is revealed, and Homer and Ned pledge to give the profits to charity. Lisa comforts Bart on the roof at home. They fall off and land on a pile of leaves, which they call a miracle. Guest stars: Dave Attell as Luke, Emily Deschanel as herself playing Marge, Gal Gadot as herself playing Lisa, Jonathan Groff as Actor playing Bart and Pete Holmes as Matthew"
  },
  {
    "seasonNumber": 30,
    "episodeNumberInSeason": 2,
    "title": "Heartbreak Hotel",
    "originalReleaseDate": "2018-10-07",
    "synopsis": "Marge and Homer are selected to compete on her favorite reality competition show. They lose the first challenge and are eliminated, but cannot go home until filming is completed. Waiting in the hotel, Marge is angered when she discovers that Homer caused them to lose. Later, Marge flirts with Nick, a man from another eliminated couple. It is announced that the eliminated contestants can return to the competition for the final round if they partner with someone else. Marge chooses to reenter with Nick, but she causes them to lose. Returning home, Marge apologizes to Homer, and he forgives her because people are pitying him instead of her for once. Guest stars: Joe Clabby as Curtis, Rhys Darby as Tag Tuckerbag, Renee Ridgeley as Honey and George Segal as Nick"
  },
  {
    "seasonNumber": 30,
    "episodeNumberInSeason": 3,
    "title": "My Way or the Highway to Heaven",
    "originalReleaseDate": "2018-10-14",
    "synopsis": "In Sunday School, Ned tells the story of when he was a trampoline salesman. He learns that each bounce builds static electricity until electrocution occurs. When he learns that a young Homer is trying to set a record number of bounces, Ned stops him and is electrocuted. He has a vision of heaven and vows to be a Christian. Marge tells the story of her grandmother who worked in a café in Nazi-occupied France. While serving Nazis, she hides the American soldiers in the cellar. When they are discovered, she kills the Nazis to help the soldiers escape. Lisa tells the story of a female version of the Buddha. A princess who is dissatisfied despite having everything, she explores the world looking for a better way until she finds enlightenment. Guest stars: H. Jon Benjamin as Bob Belcher, Jon Lovitz as himself, Dan Mintz as Tina Belcher, Eugene Mirman as Gene Belcher, Tracy Morgan as himself, John Roberts as Linda Belcher and Kristen Schaal as Louise Belcher"
  },
  {
    "seasonNumber": 30,
    "episodeNumberInSeason": 4,
    "title": "Treehouse of Horror XXIX",
    "originalReleaseDate": "2018-10-21",
    "synopsis": "In the twenty-ninth annual Simpsons Halloween special: * \"Intrusion of the Pod-y Switchers\": The townsfolk buy a new version of a smart phone created by a plant alien. Distracted, they do not notice when the alien's planet sends spores that replace everyone with plant versions of themselves. The originals wake up on the alien planet where they continue to use smart phones. * \"Multiplisa-ty\": Lisa, suffering from dissociative identity disorder, begins killing Bart's friends. To prevent himself from being killed, Bart says he loves her, and she returns to normal. * \"Geriatric Park\": Mr. Burns opens a retirement home that helps the elderly feel better by mixing their DNA with dinosaur DNA. However, when Homer raises the temperature in Grampa's room, they turn into dinosaurs. Burns is killed, and the Simpson family escapes from the elderly."
  },
  {
    "seasonNumber": 30,
    "episodeNumberInSeason": 5,
    "title": "Baby You Can't Drive My Car",
    "originalReleaseDate": "2018-11-04",
    "synopsis": "When Homer accidentally crashes his car into Mr. Burns' window, he is fired and gets a job at a self-driving car company. When Marge visits and uses the company's fringe benefits to help the engineers have fun, he and Marge are assigned to help with worker morale. The power plant workers leave to work at the company, so Burns and Smithers go undercover there. Homer and Marge discover that the cars are spying on people to sell their data. They team up with Burns and Smithers to sabotage the cars, and the company goes bankrupt. Guest star: Tracy Morgan as Tow Truck Driver"
  },
  {
    "seasonNumber": 30,
    "episodeNumberInSeason": 6,
    "title": "From Russia Without Love",
    "originalReleaseDate": "2018-11-11",
    "synopsis": "Following a failed prank phone call, Bart, Nelson and Milhouse get Moe a mail-order Russian bride named Anastasia on the dark web. Moe allows her to stay, but he refuses to fall in love with her. Anastasia takes a job in another town. When Homer discovers what Bart did, he tells Moe, who confesses his feelings to Anastasia with Homer's encouragement. Bart translates the mail-order bride contract, which says that Anastasia will get all of Moe's property upon marriage. When Anastasia is exposed, she reveals that she is an American scammer, so Moe forces her to leave. Guest stars: Jon Lovitz as Hacky/Snitchy the Weasel and Ksenia Solo as Anastasia Alekova"
  },
  {
    "seasonNumber": 30,
    "episodeNumberInSeason": 7,
    "title": "Werking Mom",
    "originalReleaseDate": "2018-11-18",
    "synopsis": "Marge is trying to sell plastic containers for money, and Julio agrees to host a party for it. Because she is nervous, Julio gives her a makeover. Marge is successful, but Julio says it is because his gay friends thought she was a drag queen. She continues the ruse until Homer finds out and reveals her true self. Marge is angered, so Homer decides to appear in drag at a club to impress Marge. Meanwhile, Lisa feels good after returning a hidden box that belonged to Jasper when he was a child. She chooses to anonymously bring joy to other sad Springfield residents. When they realize it was Lisa, she becomes ashamed. They bring her to the school's roof to have lunch to thank her. Guest stars: Raja Gemini as himself, RuPaul as Queen Chante and Scott Thompson as Grady"
  },
  {
    "seasonNumber": 30,
    "episodeNumberInSeason": 8,
    "title": "Krusty the Clown",
    "originalReleaseDate": "2018-11-25",
    "synopsis": "Lisa is demoted to television show recapper at the school newspaper, so she gives the job to Homer. He does well, but a bad review of Krusty's show causes Krusty to attack him. To protect Krusty from the police, Bart sends him to a circus to be with other clowns. He enjoys it until it runs out of money. To help the circus, he tells the clowns turn him in to the police for the reward money. Meanwhile, Homer quits being a recapper because he spent so much time watching television that it was ruining his marriage. However, a television executive wants him to continue. He reveals that most shows do not exist, but recappers are needed for the fake shows so people continue to subscribe to their television services. Homer recaps the encounter and exposes him. Later, Krusty is acquitted for attacking Homer because the jury dislikes him. Guest stars: Billy Eichner as Billy and Peter Serafinowicz as Corporate CEO"
  },
  {
    "seasonNumber": 30,
    "episodeNumberInSeason": 9,
    "title": "Daddicus Finch",
    "originalReleaseDate": "2018-12-02",
    "synopsis": "When Lisa is cut from the school play, Homer takes her shopping to cheer her up. When he complains about the fashion for young girls, Lisa starts to view him as her hero, and they spend more time together. Jealous, the school therapist tells Bart to behave badly for attention. He causes chaos at a party, and a mob tries to attack Bart. Homer is able to calm them down. Later, Lisa and Bart fight when he insults Homer. Marge thinks Lisa's new attitude about Homer is hurting the family. Homer tells Lisa not to revere him, and she agrees. He is saddened, but Maggie comforts him. Guest stars: Jon Lovitz as Llewellyn Sinclair and Rabbi and J. K. Simmons as Dr. Jessup Note: This episode was dedicated to Ricky Jay."
  },
  {
    "seasonNumber": 30,
    "episodeNumberInSeason": 10,
    "title": "'Tis the 30th Season",
    "originalReleaseDate": "2018-12-09",
    "synopsis": "Marge fails to buy a smart television the family wants the day after Thanksgiving. She becomes stressed as Christmas approaches, so the family surprises her with a vacation to Florida. However, they booked an extremely small motel room, but Homer tells Bart and Lisa to pretend to be happy. The children complain to the manager, who ignores them, so Bart pranks her. Admitting the vacation is not enjoyable, they drive home but run out of fuel outside Springfield. They walk into town and find Moe hosting a dinner for the poor. They join him and appreciate each other. Later, the manager refunds their money and gives extra so that they never return. They use the money to buy a smart television. Guest star: Jane Lynch as Jeanie"
  },
  {
    "seasonNumber": 30,
    "episodeNumberInSeason": 11,
    "title": "Mad About the Toy",
    "originalReleaseDate": "2019-01-06",
    "synopsis": "After Bart finds plastic soldier toys in the basement, Grampa has a panic attack. Lisa notices that the toy soldiers look like Grampa. He remembers that he was a model for the toys in the 1940s and was supposed to be paid a royalty. When the story becomes national news, he is invited to the toy company in New York. He remembers that the male photographer tried to kiss him, and he ran away before collect his money. The company then fired the photographer for being gay. He realizes that he may have ruined the photographer's life. Lisa tracks him down in Texas, so the Simpsons visit his gallery. They find him with paintings of Grampa in uniform. He thanks Grampa for making him realize that he should always be the way he truly is. Guest stars: Bryan Batt as Philip Hefflin, Bill de Blasio as himself and Lawrence O'Donnell as himself"
  },
  {
    "seasonNumber": 30,
    "episodeNumberInSeason": 12,
    "title": "The Girl on the Bus",
    "originalReleaseDate": "2019-01-13",
    "synopsis": "While on the school bus, Lisa sees a girl playing a clarinet on a porch. She exits the bus and finds the girl who is named Sam. Her parents invite Lisa to dinner. Embarrassed by her family, Lisa lies that her parents have sophisticated jobs. She maintains the lie until Marge realizes what was happening. She tells Lisa to invite Sam's family to dinner, and Marge and Homer try to help Lisa maintain her lie. However, she is exposed and feels ashamed. Sam's father admits that he lied about his country of origin. To avoid the awkwardness, Bart invites everyone to a party in his renovated bedroom, which was done while everybody was focused on Lisa. Guest stars: Terry Gross as herself and Patti LuPone as Cheryl Monroe"
  },
  {
    "seasonNumber": 30,
    "episodeNumberInSeason": 13,
    "title": "I'm Dancing as Fat as I Can",
    "originalReleaseDate": "2019-02-10",
    "synopsis": "Marge needs to visit a relative out of town, so she makes Homer promise not to watch a new season of a streaming television show. He tries to avoid temptation, but he gives in, and Marge catches him watching the end of the season as she returns home. Looking for forgiveness, Homer knows that Marge also likes watching dance shows, so he takes dance lessons. He invites Marge to a ballroom where they dance, and she forgives him. Meanwhile, Bart enters an essay contest to win a shopping cart full of Krusty toy store merchandise. He is named a finalist along with Milhouse and Ralph. They must race through the store, and the first one to cross the finish line will keep their toys. Near the finish line, Bart and Milhouse crash, and Ralph takes their carts and wins. Guest star: Ted Sarandos as himself"
  },
  {
    "seasonNumber": 30,
    "episodeNumberInSeason": 14,
    "title": "The Clown Stays in the Picture",
    "originalReleaseDate": "2019-02-17",
    "synopsis": "A young Krusty is making his directorial debut. He is adopting a science fiction novel as a feature film in Mexico and hires the townsfolk, including young Homer and Marge, as the film crew. Marge becomes assistant director, and he gives Homer dangerous jobs to keep him from distracting Marge. Homer is sent to find a lizard in a sandstorm and gets lost. He is captured by a gang, but Krusty refuses to pay the ransom. Marge decides to trade the film for Homer. With the film a failure, Krusty is forced to become a television clown. Guest star: Marc Maron as himself"
  },
  {
    "seasonNumber": 30,
    "episodeNumberInSeason": 15,
    "title": "101 Mitigations",
    "originalReleaseDate": "2019-03-03",
    "synopsis": "After eating in a restaurant, a parking valet accidentally gives Homer a classic car belonging to Comic Book Guy. After driving and returning it, he is accused of stealing the car and damaging the comic book in the car. He is arrested and found guilty. The Simpson family films a mitigation video to garner sympathy with the judge before sentencing. However, Comic Book Guy also gives a convincing speech. When Homer tries to reason with him, he notices that Homer has a rare keychain that Grampa gave him. To make Homer feel how he feels, he destroys the keychain and agrees to drop the charges. Guest star: Guillermo del Toro as himself"
  },
  {
    "seasonNumber": 30,
    "episodeNumberInSeason": 16,
    "title": "I Want You (She's So Heavy)",
    "originalReleaseDate": "2019-03-10",
    "synopsis": "Homer and Marge sneak into a wedding expo and enjoy being together. Still feeling romantic at home, he carries her up the stairs, but he falls, resulting in a hernia for Homer and an ankle injury for Marge. Homer's pain medication gives him hallucinations and makes him lazier while Marge's physical therapist helps her recover and later teaches her kite-surfing. Worried for their marriage, Lisa gets Homer to drive them to the beach. Seeing Marge kite-surfing, Homer decides to join her, but the wind blows them away, resulting in new injuries. Meanwhile, the therapist is arrested and is revealed to be a spy trying to learn about the power plant from Homer. Guest star: Wallace Shawn as Wallace the Hernia"
  },
  {
    "seasonNumber": 30,
    "episodeNumberInSeason": 17,
    "title": "E My Sports",
    "originalReleaseDate": "2019-03-17",
    "synopsis": "After Homer gets him a new gaming computer, Bart begins to excel at eSports. When Bart's team has a chance to win $500,000 in a gaming tournament in Seoul, Homer decides to coach his son's team. They advance to the final round in Seoul. Lisa, disappointed that they are going to South Korea without her, convinces Marge to make it a family trip. Once there, the family visits a Buddhist temple where Homer learns to let go of material gain. In this state, he sabotages the tournament, which causes the team to lose. On the way home, Bart is attacked by his teammates due to Homer's actions. Guest stars: Ken Jeong as Korean Monks, Natasha Lyonne as Sophie and David Turley as Conflict of Enemies Commentator"
  },
  {
    "seasonNumber": 30,
    "episodeNumberInSeason": 18,
    "title": "Bart vs. Itchy & Scratchy",
    "originalReleaseDate": "2019-03-24",
    "synopsis": "Bart decides to protest with his friends after Krusty announces the debut of an all-female reboot of The Itchy & Scratchy Show. However, Bart gets caught watching and liking the show. To avoid being attacked at school by the boys, he hides in the girls' bathroom where he meets sixth-grade girls who carry out pranks. Meanwhile, Milhouse becomes leader of a boys' rights group. The boys force Krusty to end the female reboot. Lisa learns that Bart is performing pranks with the girls. They decide to destroy the Itchy & Scratchy tapes against Bart's wishes. At the studio, as they prepare to drop the tapes into a tub of nail polish remover, Bart distracts them while Lisa knocks away the tub. The chemicals from the spilled tub causes the boys in the studio audience to cry, and they blame Milhouse. Bart leaves the girls, but Lisa decides to join the girls. Guest stars: Awkwafina as Carmen, Nicole Byer as Erica and Chelsea Peretti as Piper"
  },
  {
    "seasonNumber": 30,
    "episodeNumberInSeason": 19,
    "title": "Girl's in the Band",
    "originalReleaseDate": "2019-03-31",
    "synopsis": "When the director of the Capitol City Philharmonic visits, Dewey Largo tries to impress him as a conductor, but he selects Lisa for his youth orchestra instead. Lisa has a difficult time under his harsh training. Meanwhile, Homer works extra shifts at the plant to pay for Lisa's training. Lisa wins the competition for first chair, but notices the toll it takes on her family. She is offered a spot in the next-level class that is more expensive and farther away, but she purposely fails the audition so that her family does not have to endure more hardship. Guest stars: Dave Matthews as Lloyd the Bartender and J. K. Simmons as Victor Kleskow"
  },
  {
    "seasonNumber": 30,
    "episodeNumberInSeason": 20,
    "title": "I'm Just a Girl Who Can't Say D'oh",
    "originalReleaseDate": "2019-04-07",
    "synopsis": "Marge decides to direct a musical written by Lisa about Jebediah Springfield. Krusty plans to air the musical live on television. Sideshow Mel is selected for the main role. However, just days before the play is set to air, Mel leaves for a role in another play. She selects Professor Frink to replace him. During the play, it begins to rain, threatening to ruin the production. Lisa quickly rewrites the script, and the production is successful. Later, at an awards ceremony, Sideshow Mel wins for Outstanding Lead Performance, while Marge's play wins nothing despite ten nominations. However, Marge is selected as Best Newcomer. Meanwhile, Homer and Maggie join a popular baby class run by a beautiful instructor. However, it ends when one of the fathers marries her. Guest stars: Okilly Dokilly as themselves, Josh Groban as Professor Frink's singing voice, John Lithgow as himself and Jon Lovitz as Llewellyn Sinclair"
  },
  {
    "seasonNumber": 30,
    "episodeNumberInSeason": 21,
    "title": "D'oh Canada",
    "originalReleaseDate": "2019-04-28",
    "synopsis": "The family takes a trip to Niagara Falls to redeem some hotel rewards they earned. Lisa falls down Niagara Falls while fighting with Bart and ends up on the Canadian side. While in the hospital, she complains about America and is declared a refugee. She enjoys living in Canada while Marge sneaks into Canada to retrieve her. At the American consulate, they are denied re-entry into the United States, which delights Lisa. However, after Lisa has a vision about the good things about America, they sneak back into America by crossing a frozen river. Guest stars: Awkwafina as Dr. Chang, Judy Blume as herself and Lucas Meyer as Justin Trudeau"
  },
  {
    "seasonNumber": 30,
    "episodeNumberInSeason": 22,
    "title": "Woo-Hoo Dunnit?",
    "originalReleaseDate": "2019-05-05",
    "synopsis": "When Lisa's college fund, hidden in a can under the kitchen sink, gets stolen, the family tries to find out who stole it. Homer is suspected of using it to pay for his bar tab, but it is proven that he did not use the money. Bart is caught taking money from it but proves that he was always able to refund what was borrowed. Lisa is accused of buying a new saxophone, but it is proven that she did not buy one. Homer deduces that Marge used the money to start a drink coaster business. However, after Marge talks about all of Homer's past schemes, he lies to the children and says rats ate it after Grampa left the can open. Guest stars: Ken Burns as himself playing Homer, Will Forte as King Toot, Jackie Mason as Rabbi Krustofsky and Liev Schreiber as \"Dateline Springfield\" Narrator"
  },
  {
    "seasonNumber": 30,
    "episodeNumberInSeason": 23,
    "title": "Crystal Blue-Haired Persuasion",
    "originalReleaseDate": "2019-05-12",
    "synopsis": "Mr. Burns cuts health care benefits for his employees, so Marge buys healing crystals for Bart for his attention deficit hyperactivity disorder. When Bart gets good grades, Marge takes over the crystal shop to sell crystals to others. Lisa is suspicious of the crystals while Marge gains a rival crystal business owner. Lisa finds that Bart hid notes in the classroom that can only be seen with a crystal. She forces Bart to admit what he did to Marge, who is confronted with angry customers with crystals that did nothing. She closes her shop and lets her rival win. Guest stars: Illeana Douglas as the New Age Clerk, Werner Herzog as Walter Hotenhoffer and Jenny Slate as Piper Paisley"
  }
]
