[
  {
    "seasonNumber": 19,
    "episodeNumberInSeason": 1,
    "title": "He Loves to Fly and He D'ohs",
    "originalReleaseDate": "2007-09-23",
    "synopsis": "Taking place two months after the events of The Simpsons Movie. After Homer saves Mr. Burns from drowning, Mr. Burns rewards him with a dinner and a flight on his corporate jet, making Homer disappointed that he will never be rich or successful enough to enjoy the high life. Marge hires a life coach to help Homer, and he gets an interview for a job that requires use of a private jet. She thinks he is hired, but Homer spends his days sitting at Krusty Burger to avoid disappointing Marge until Bart catches him. Homer rents a private plane where he will tell Marge the truth, but the pilot loses consciousness. Homer safely lands the plane but finds private jets to be dangerous and returns to the power plant. Guest Stars: Stephen Colbert and Lionel Richie."
  },
  {
    "seasonNumber": 19,
    "episodeNumberInSeason": 2,
    "title": "The Homer of Seville",
    "originalReleaseDate": "2007-09-30",
    "synopsis": "A freak accident turns Homer into an opera singer, which can only be achieved if he lies down. He becomes the toast of Springfield's cultural elite and the target of a crazed, motorcycle-riding female fan named Julia who blackmails him into becoming his manager and tries to seduce him. He fires Julia who vows revenge. At his next performance, Julia tries to kill shoot a poison dart at him, but Marge saves him, and Julia is injured. Homer then announces his retirement from singing. Guest Stars: Maya Rudolph and Plácido Domingo."
  },
  {
    "seasonNumber": 19,
    "episodeNumberInSeason": 3,
    "title": "Midnight Towboy",
    "originalReleaseDate": "2007-10-07",
    "synopsis": "Marge puts Maggie in a special school to help babies become independent, but when the lessons work too well, Marge finds herself tearfully bonding with a sack of potatoes. Meanwhile, Homer befriends a tow-truck driver named Louie, who shows Homer what it is like to tow vehicles for a living. He decides to be a tow truck drive too, but Louie warns him not to work in his part of town. When the townsfolk become angry at Homer for towing their cars, they trick Homer into towing a car in Louie's neighborhood. Louie kidnaps Homer in retaliation. Maggie rides Santa's Little Helper to rescue Homer, and they return home where she reconciles with Marge. Guest Star: Matt Dillon."
  },
  {
    "seasonNumber": 19,
    "episodeNumberInSeason": 4,
    "title": "I Don't Wanna Know Why the Caged Bird Sings",
    "originalReleaseDate": "2007-10-14",
    "synopsis": "At the bank, Marge is talking with a man named Dwight who tries to rob the bank. He makes a deal with Marge where he will surrender if she promises to visit him in prison. She tries to go but is unable to arrive during visiting hours. Angry, Dwight breaks out and kidnaps her. They go to an amusement park to go on the rides. Chief Wiggum tries to save them but gets stuck, so Dwight sacrifices himself to save him. He returns to prison where Marge visits him. Guest Stars: Steve Buscemi, Ted Nugent and Julia Louis-Dreyfus."
  },
  {
    "seasonNumber": 19,
    "episodeNumberInSeason": 5,
    "title": "Treehouse of Horror XVIII",
    "originalReleaseDate": "2007-11-04",
    "synopsis": "The nineteenth season's annual trio of Halloween stories, all of which are movie parodies: \"E.T., Go Home\" – In this send-up of E.T. the Extra-Terrestrial, Bart finds Kodos (who is hiding from the government) and helps her obtain devices to contact her home planet, but Kodos' intentions are proven to be murderous. \"Mr. & Mrs. Simpson\" – In this send-up of Mr. & Mrs. Smith, Homer lives a double life as a government assassin, but discovers that Marge is one too and must eliminate her after she botched his attempt at assassinating Kent Brockman. \"Heck House\" – In this send-up of Seven Footprints to Satan, Ned Flanders turns the church into a Heck House and asks God for devilish powers so he can teach the children the consequences of committing the seven deadly sins. Guest Star: Maurice LaMarche."
  },
  {
    "seasonNumber": 19,
    "episodeNumberInSeason": 6,
    "title": "Little Orphan Millie",
    "originalReleaseDate": "2007-11-11",
    "synopsis": "Milhouse's parents remarry and go on a honeymoon cruise, but they are presumed dead. Milhouse adopts an aloof attitude after hearing the news, making him popular and Bart unpopular. Bart has Milhouse's uncle visit to make him happy but unpopular, but the adventurous uncle makes him more popular. The boys and the uncle fly in a hot air balloon and discover an island where Milhouse's parents have survived. Meanwhile, Marge hides her eyes from Homer after Homer admits that he does not know what Marge's eye color is. He remembers a song he used to sing to Marge and tries to remember the lyrics that contain the color. Marge overhears and reveals that her eye color is hazel."
  },
  {
    "seasonNumber": 19,
    "episodeNumberInSeason": 7,
    "title": "Husbands and Knives",
    "originalReleaseDate": "2007-11-18",
    "synopsis": "The Comic Book Guy's Android Dungeon faces competition with \"Coolsville Comics 'n Toys,\" a new comic book store owned by a nicer, more personable store owner named Milo. After losing business, he sells the store to Marge, who creates a gym for the average woman. A self-conscious Homer resorts to plastic surgery after being told that Marge's success will lead to her divorcing Homer and getting a younger, handsomer trophy husband. However, his new appearance horrifies the town, and Marge, disgusted with him, kills him. However, Homer wakes up and realizes that his surgery was cancelled after the surgeon was denied permission from Marge and was dreaming of his new appearance. Guest Stars: Alan Moore, Art Spiegelman, Dan Clowes, Jack Black and Maurice LaMarche."
  },
  {
    "seasonNumber": 19,
    "episodeNumberInSeason": 8,
    "title": "Funeral for a Fiend",
    "originalReleaseDate": "2007-11-25",
    "synopsis": "A night at a rib restaurant turns into yet another plot for Sideshow Bob to kill the Simpson family, but the whole scheme turns into a family affair when Bart kills his mortal enemy by throwing away his nitroglycerine, which Sideshow Bob needs for his heart. Unbeknownst to Bart, Sideshow Bob actually faked his death and is plotting with the rest of the Terwilligers to kill Bart. At the funeral Bart is invited to be with Bob as he is cremated, but Bob traps him in the coffin. Lisa deduces the plan, and Bart is rescued. The Terwilligers are sent to prison. Guest Stars: Kelsey Grammer, David Hyde Pierce, John Mahoney and Keith Olbermann."
  },
  {
    "seasonNumber": 19,
    "episodeNumberInSeason": 9,
    "title": "Eternal Moonshine of the Simpson Mind",
    "originalReleaseDate": "2007-12-16",
    "synopsis": "Homer wakes up in the snow with no memory of what he did the night before and finds Marge and the kids missing. He then goes on a journey inside his memories to remember what had happened. He learns that Moe gave him a drink to wipe his memory but remembers Marge with a black eye and Duffman with Marge. He concludes that Marge is having an affair with Duffman, and he injured Marge when he found out. He tries to commit suicide by jumping off a bridge. During the fall, he remembers that Marge was planning a surprise party for him with Duffman, and he accidentally injured her eye while opening a bottle. He lands on a ship where his party is taking place. He had Moe erase his memory so he would be surprised, and he arranged to ensure he survived the events that would follow."
  },
  {
    "seasonNumber": 19,
    "episodeNumberInSeason": 10,
    "title": "E Pluribus Wiggum",
    "originalReleaseDate": "2008-01-06",
    "synopsis": "Thanks to Homer's latest blunder blowing up every fast-food restaurant in the city, Springfield moves up election day and becomes the first city in the nation to hold primary elections. However, all the media attention and similar-sounding politicians wear on the townspeople's nerves, so they elect Ralph Wiggum to be the 2008 presidential candidate as a joke until Ralph reveals that he wants to be President, so he can bring peace in these divided times. Guest Stars: Jon Stewart and Dan Rather."
  },
  {
    "seasonNumber": 19,
    "episodeNumberInSeason": 11,
    "title": "That '90s Show",
    "originalReleaseDate": "2008-01-27",
    "synopsis": "After Marge's diploma fell from a box, a family secret is unraveled: Ten years have passed by between Bart's birth and the meeting of their parents. After high school, Marge wanted to go to college and so Homer helped make her dream come true and paid for it by working for his father. But in class, Marge started to fall for her professor, which ultimately led Homer on the path of musician's fame and depression. When the professor is not interested in getting married, Marge breaks up with him and returns to Homer when she hears his song about her. Guest Stars: Kurt Loder and \"Weird Al\" Yankovic."
  },
  {
    "seasonNumber": 19,
    "episodeNumberInSeason": 12,
    "title": "Love, Springfieldian Style",
    "originalReleaseDate": "2008-02-17",
    "synopsis": "On Valentine's Day, Homer and Marge get stuck in a Tunnel of Love ride after Bart turns the water into Jell-O. To pass the time, the family tells stories of famous couples: Bonnie and Clyde (Homer and Marge cut a path of crime through 1930s Springfield by robbing banks), Lady and the Tramp (Homer and Marge again; this time, as the eponymous dogs from the Disney movie), and Sid Vicious and Nancy Spungen (Nelson and Lisa are punk rockers in love and addicted to chocolate)."
  },
  {
    "seasonNumber": 19,
    "episodeNumberInSeason": 13,
    "title": "The Debarted",
    "originalReleaseDate": "2008-03-02",
    "synopsis": "When new student Donny volunteers to take the blame for Bart's prank of Principal Skinner, Bart promises to remember his sacrifice. However, Skinner is using Donny to spy on Bart. When his pranks begin to fail, he suspects a rat and blames Milhouse. When he learns that it is Donny, Skinner catches Bart before he can punish Donny. However, Donny saves Bart, and they part ways. Meanwhile, Homer grows attached to his rental car, which he gets to drive for a week while his old car gets repaired. Later, when he sees his old car being sold, he abandons the rental and takes back the old one. Guest Stars: Topher Grace and Terry Gross."
  },
  {
    "seasonNumber": 19,
    "episodeNumberInSeason": 14,
    "title": "Dial 'N' for Nerder",
    "originalReleaseDate": "2008-03-09",
    "synopsis": "Bart and Lisa's prank on Martin Prince goes too far and they worry that they may be implicated in his death by the police and Nelson, who becomes an amateur sleuth. Feeling guilty, they complete a project Martin was working on, but Lisa confesses her actions upon hearing Martin's lute when it is completed. However, Martin emerges and explains how he survived. Meanwhile, Marge calls upon the producer of a reality show that specializes in tracking down cheating couples when she begins to suspect that Homer may be cheating on his diet. However, when she sees that the show is only interested in breaking apart Homer and her, she ends the filming."
  },
  {
    "seasonNumber": 19,
    "episodeNumberInSeason": 15,
    "title": "Smoke on the Daughter",
    "originalReleaseDate": "2008-03-30",
    "synopsis": "Lisa is accepted into a ballet school run by jazz dancer Chazz Busby, and discovers that her dancing improves whenever she is around cigarette smoke. Meanwhile, Homer shows Bart his secret beef jerky project, which has been taken over by raccoons. When he tries to kill them, he sees the raccoons are a family like his own and lets them live. Later, Homer stops Lisa from smoking a cigarette and wants her to stop dancing. However, he sees how her dancing makes Marge happy, so he allows her to dance without inhaling smoke. When she is caught, Homer has a raccoon steal the cigarettes during a recital, leading the dancers to perform poorly and Lisa to quit."
  },
  {
    "seasonNumber": 19,
    "episodeNumberInSeason": 16,
    "title": "Papa Don't Leech",
    "originalReleaseDate": "2008-04-13",
    "synopsis": "When Mayor Quimby launches a campaign to shake down anyone who has not paid taxes in years, Lurleen Lumpkin, the country singer who tried to seduce Homer from the season three episode \"Colonel Homer\", hides out at the Simpson house, which does not sit well with Marge, who still cannot forgive her for almost stealing her husband. When she learns Lurleen's father abandoned her, she reunites them, but he leaves again. When her father gives one of Lurleen's songs to the Dixie Chicks, she exposes him, and they punish him. Lurleen leaves to be the band's opening act. Guest Stars: Beverly D'Angelo and The Dixie Chicks."
  },
  {
    "seasonNumber": 19,
    "episodeNumberInSeason": 17,
    "title": "Apocalypse Cow",
    "originalReleaseDate": "2008-04-27",
    "synopsis": "Bart joins the 4-H Club and befriends a cow named Lou, but when Lou is set to be sent to slaughter, Bart gives Lou to a country girl named Mary, whom he now must marry after finding out that giving a cow to a country girl is considered a marriage proposal in hillbilly tradition. Lisa tells Bart to go along until they can save Lou. Marge stops the wedding after switching Lou with Homer in a cow costume, and Lou is sent to India where cows are sacred. Guest Star: Zooey Deschanel."
  },
  {
    "seasonNumber": 19,
    "episodeNumberInSeason": 18,
    "title": "Any Given Sundance",
    "originalReleaseDate": "2008-05-04",
    "synopsis": "Lisa begins filming her family after Principal Skinner says that cinema must have drama. Lisa's short film is accepted for the Sundance Film Festival, so the family goes to Utah for its premiere. It becomes a rave with everyone except for the Simpson family. The public hates the family because of their portrayal, and Lisa thinks she may have subconsciously humiliated them on purpose. She sees another film about Nelson and his mother and sees that other families have worse problems. She apologizes to her family, and they reconcile. Guest Star: Jim Jarmusch and John C. Reilly."
  },
  {
    "seasonNumber": 19,
    "episodeNumberInSeason": 19,
    "title": "Mona Leaves-a",
    "originalReleaseDate": "2008-05-11",
    "synopsis": "Mona Simpson, Homer's '60s radical mother, returns, vowing that her days of protesting are over, but Homer will not accept. Things get worse when Mona dies and her last wishes are to have her ashes spread over the mountains. When Homer fulfills her wish, the ashes go into the mountain, which disrupts a nuclear missile launch. Homer is captured, and the ashes are returned to him. The family helps Homer escape, and he accidentally destroys the missile in the process. Guest Stars: Glenn Close, Lance Armstrong. Note: The end of the episode was dedicated to Elsie Castellaneta and Dora K. Warren, the mothers of both Dan Castellaneta and Harry Shearer."
  },
  {
    "seasonNumber": 19,
    "episodeNumberInSeason": 20,
    "title": "All About Lisa",
    "originalReleaseDate": "2008-05-18",
    "synopsis": "Sideshow Mel narrates the story of how Lisa rose to stardom as Krusty the Clown's latest replacement. Lisa is hired as Krusty's intern, and Mel shows Lisa how to advance. When Lisa starts performing better that Krusty, she takes over the show. She wins the award for Entertainer of the Year but sees the poor fate of previous winners, so she returns her show to Krusty. Meanwhile, Bart and Homer start coin-collecting and go after a rare 1917 coin known as \"The Kissing Lincolns\" penny. When Mr. Burns buys it at auction, Homer tricks him into giving it to him. Guest Star: Drew Carey."
  }
]
