[
  {
    "seasonNumber": 17,
    "episodeNumberInSeason": 1,
    "title": "The Bonfire of the Manatees",
    "originalReleaseDate": "2005-09-11",
    "synopsis": "Because of a gambling debt, Homer allows Fat Tony to shoot an explicit movie in the Simpson home while the family is away. When Marge learns what happened, she angrily leaves and meets Caleb Thorn, an attractive marine biologist, and they go to save manatees while the family looks for her. Marge expects Homer to change, so he helps save a group of manatees from jet skiers. Marge is impressed and reconciles with Homer. Guest star: Alec Baldwin as Caleb Thorn"
  },
  {
    "seasonNumber": 17,
    "episodeNumberInSeason": 2,
    "title": "The Girl Who Slept Too Little",
    "originalReleaseDate": "2005-09-18",
    "synopsis": "When a graveyard is relocated to the lot next to the Simpsons, Lisa has nightmares that prevent her from sleeping. Her parents go to a therapist who says that Lisa needed to care for herself as a baby while they handled Bart and needs to change her mindset to that of a child. Meanwhile, Lisa goes into the graveyard at night to overcome her fear and is locked inside. She hits her head on a tombstone and has a nightmare where she learns it is acceptable to be scared. In the morning, Marge and Homer find her and take her home."
  },
  {
    "seasonNumber": 17,
    "episodeNumberInSeason": 3,
    "title": "Milhouse of Sand and Fog",
    "originalReleaseDate": "2005-09-25",
    "synopsis": "When Maggie gets chicken pox, Homer tries to capitalize on it by throwing a pox party and inviting parents to infect their children. At the party, Milhouse's parents get back together, but Milhouse feels neglected, and Bart helps break them up again by placing Marge's bra in Kirk's bedroom. Luann informs Homer, who confronts Marge and gets kicked out of the house. To get his parents together, Bart plans to throw a dummy of himself off a cliff, so his parents can rescue him. However, Milhouse pushes the real Bart over the cliff, and Homer jumps in after him. Marge rescues them when Homer trusts her to save them."
  },
  {
    "seasonNumber": 17,
    "episodeNumberInSeason": 4,
    "title": "Treehouse of Horror XVI",
    "originalReleaseDate": "2005-11-06",
    "synopsis": "B.I. Bartificial Intelligence – Bart falls into a coma after trying to jump into the swimming pool at Patty and Selma's apartment complex. With Bart incapacitated, the Simpsons buy a robot son, who proves to be a better son than Bart ever was, leaving the real Bart to befriend a group of traveling robots. Survival of the Fattest – Mr. Burns hunts down Homer and a small collection of male ancillary characters as part of a new reality show called \"The World Series of Manslaughter.\" I've Grown a Costume on Your Face – After she loses a Halloween costume contest, a witch turns the townspeople into their Halloween costumes, and Lisa (who is now Albert Einstein) finds out that Maggie (who is dressed as a witch) is the key to revert the spell. Guest stars: Terry Bradshaw and Dennis Rodman"
  },
  {
    "seasonNumber": 17,
    "episodeNumberInSeason": 5,
    "title": "Marge's Son Poisoning",
    "originalReleaseDate": "2005-11-13",
    "synopsis": "Realizing that Marge is lonely, Bart decides to spend extra time with her, causing his classmates to call him a mama's boy. He revels against Marge, leaving her lonely. Feeling guilty, he enters a karaoke contest with her, but after seeing Agnes and Principal Skinner perform, she lets him go to live his own life. Meanwhile, Homer begins exercising and becomes an arm wrestler, with Moe as his coach. He wins an arm wrestling competition but misses Marge, so he goes to sing karaoke with her."
  },
  {
    "seasonNumber": 17,
    "episodeNumberInSeason": 6,
    "title": "See Homer Run",
    "originalReleaseDate": "2005-11-20",
    "synopsis": "Homer's reaction to Lisa's Father's Day book causes her to develop a disappointment disorder. To get her respect back, Homer dresses up as a mascot known as the Safety Salamander. When a multi-vehicle collision occurs and Homer rescues them as the salamander, a recall of Mayor Quimby is held, and Homer runs in the election. When Marge washes the salamander costume and ruins it, Homer loses his popularity, and Quimby retains his office."
  },
  {
    "seasonNumber": 17,
    "episodeNumberInSeason": 7,
    "title": "The Last of the Red Hat Mamas",
    "originalReleaseDate": "2005-11-27",
    "synopsis": "Looking for new friends, Marge joins a group of women, whom she gets along with. However, she is conflicted when they plan a heist on Mr. Burns' mansion when he withheld a promised donation. She goes along with them while Homer follows her. When he triggers an alarm, the women escape with one Faberge egg to replace Burns' donation. Meanwhile, Lisa learns Italian from Milhouse and bonds with him until she sees him giving another girl similar lessons and chases him away. Guest Star: Lily Tomlin"
  },
  {
    "seasonNumber": 17,
    "episodeNumberInSeason": 8,
    "title": "The Italian Bob",
    "originalReleaseDate": "2005-12-11",
    "synopsis": "Homer brings the whole family along when he is sent to Italy to pick up a new sports car for Mr. Burns. It gets damaged while they drive it, and they look for help in a town whose mayor is Sideshow Bob. Now having a wife and child, he agrees to help the Simpsons if they do not reveal his past. When Lisa gets drunk and exposes Bob, he and his family chase them to Rome, where Krusty is performing. On stage, Bob is tricked into performing while Krusty helps send the Simpsons back to America. Guest Stars: Maria Grazia Cucinotta and Kelsey Grammer"
  },
  {
    "seasonNumber": 17,
    "episodeNumberInSeason": 9,
    "title": "Simpsons Christmas Stories",
    "originalReleaseDate": "2005-12-18",
    "synopsis": "Three stories about Christmas are told. First, the Simpsons re-enact the Nativity with Homer, Marge, and Bart as the Holy Family with Mr. Burns as King Herod tries to attack them. Next, a World War II tale stars Grampa and Mr. Burns, stranded on an island and shooting down an airplane that is actually Santa's sleigh. Burns tries to escape with the sleigh, but Grampa stops him. Santa promises to return to rescue them but does not return. Finally, a musical features \"The Nutcracker Suite\" as Moe attempt suicide but fails while Homer looks for a gift for Marge."
  },
  {
    "seasonNumber": 17,
    "episodeNumberInSeason": 10,
    "title": "Homer's Paternity Coot",
    "originalReleaseDate": "2006-01-08",
    "synopsis": "Marge's rage against the new toll road system leads to the discovery of a frozen mailman and his 40-year-old mail. A letter addressed to Abe Simpson shows that Homer may not be his son, and Homer sets out to find his real father. He discovers Mason Fairbanks, a treasure hunter. They take a paternity test, and Mason is Homer's father. When Mason and Homer search for underwater treasure, and Homer has a near-death experience where he sees Grampa, he awakens and learns Grampa switched the test labels because he seemed happier with Mason. Guest Stars: Michael York, William H. Macy and Joe Frazier"
  },
  {
    "seasonNumber": 17,
    "episodeNumberInSeason": 11,
    "title": "We're on the Road to D'ohwhere",
    "originalReleaseDate": "2006-01-29",
    "synopsis": "After Bart steals a key from Principal Skinner's office and gets himself into hot water, Marge and Homer send him to a behavior modification camp. Because he is on the No-Fly List, Homer drives him here. On the way, Bart tries to escape, but Homer recovers him. After dropping him off, Homer feels guilty and retrieves him, and they go to Las Vegas and get into trouble. Meanwhile, Lisa and Marge have a yard sale, and Marge makes money selling old prescription drugs until she is arrested. Lisa is left to fend for herself and Maggie."
  },
  {
    "seasonNumber": 17,
    "episodeNumberInSeason": 12,
    "title": "My Fair Laddy",
    "originalReleaseDate": "2006-02-26",
    "synopsis": "When Bart accidentally destroys Willie's shack with a game of solid-ice dodgeball, Marge takes in the homeless janitor in a parody of My Fair Lady. Lisa turns Willie into a gentleman after wagering with Bart that she can do it for the science fair. Lisa wins the science fair and the bet, but Willie misses his old life and returns to his rebuilt shack. Meanwhile, Homer loses his last pair of blue pants, so he creates an advertisement to increase demand and get more pants."
  },
  {
    "seasonNumber": 17,
    "episodeNumberInSeason": 13,
    "title": "The Seemingly Never-Ending Story",
    "originalReleaseDate": "2006-03-12",
    "synopsis": "While exploring with his family, Homer causes a cave to crumble and finds himself stuck upside-down on the ceiling. To pass the time, Lisa tells him a story, with many layers of nested storytelling involved. Moe stole gold coins from Snake to run away with Edna, but she leaves him. Mr. Burns learns of this and steals the coins to give them to the Rich Texan in exchange for his possessions, which Burns lost in a bet earlier. The Rich Texan hid them in the cave, and everyone is there to retrieve them until Marge throws them into a chasm. Emmy Award winning episode."
  },
  {
    "seasonNumber": 17,
    "episodeNumberInSeason": 14,
    "title": "Bart Has Two Mommies",
    "originalReleaseDate": "2006-03-19",
    "synopsis": "Marge babysits Rod and Todd Flanders while Ned is away and teaches them to have more fun. Meanwhile, a monkey at the zoo adopts Bart while under Homer's care. When Ned returns and disapproves of Marge's influence, the children protest. Lisa learns that the monkey misses its real son. Marge tries to rescue Bart, but the monkey escapes. Rod, with Ned's encouragement, takes Mr. Teeny, the monkey's son, to it, and it releases Bart. In Heaven, Maude looks down in pride of Rod. Guest Stars: Susan Sarandon, Antonio Fargas, Dave Thomas and Randy Johnson"
  },
  {
    "seasonNumber": 17,
    "episodeNumberInSeason": 15,
    "title": "Homer Simpson, This Is Your Wife",
    "originalReleaseDate": "2006-03-26",
    "synopsis": "Homer's obsession with Lenny's new plasma TV prompts Marge to enter the family in a sweepstakes, and they win a trip to the Fox Studio Lot. Against Marge's wishes, Homer signs them up for a Trading Spouses/Wife Swap-style reality show and is forced to take in a controlling wife, Verity, while Marge moves in with a beaten-down husband, Charles, and his perfect son. He falls in love with Marge and reveals his marriage troubles, but Marge rejects him. Meanwhile, the Simpsons clash with Verity. Charles takes Marge home to confront Verity, but she has already moved on with Patty. Guest Star: Ricky Gervais"
  },
  {
    "seasonNumber": 17,
    "episodeNumberInSeason": 16,
    "title": "Million Dollar Abie",
    "originalReleaseDate": "2006-04-02",
    "synopsis": "Grampa is shunned by the town after foiling Homer's plans to make Springfield home to a professional football franchise. He tries to commit suicide, but the town has banned assisted suicide. However, he gains a new purpose in life as a matador. He is successful, and the people cheer for him, but Lisa protests him harming animals. He releases the bulls, but they cause havoc on the town while Lisa is proud of what Grampa did. Guest stars: Rob Reiner and Michael Carrington"
  },
  {
    "seasonNumber": 17,
    "episodeNumberInSeason": 17,
    "title": "Kiss Kiss, Bang Bangalore",
    "originalReleaseDate": "2006-04-09",
    "synopsis": "Homer learns the nuclear power plant is being shut down and outsourced to India, where the new workers worship him as a god. Worried for Homer, the family goes to India with Mr. Burns and learn that they worship him because he introduced American benefits, so Burns returns the plant to America where the workers are ignorant. Meanwhile, Patty and Selma kidnap Richard Dean Anderson but soon grow annoyed by his antics when he wants to keep escaping using MacGyver-style tactics, and they send him away. Guest Star: Richard Dean Anderson"
  },
  {
    "seasonNumber": 17,
    "episodeNumberInSeason": 18,
    "title": "The Wettest Stories Ever Told",
    "originalReleaseDate": "2006-04-23",
    "synopsis": "When the Simpsons' plans for a nice family outing at the Frying Dutchman turn into a dining disaster, the family (and show writers) try to salvage the night by telling three tales of disasters at sea: in \"Mayflower Madman,\" Pilgrims Moe and Homer fight for the hand of Goody Marge while sailing to Plymouth Rock; in \"The Whine-Bar Sea,\" Bart leads a mutiny against Captain Principal Skinner; and in \"Watership D'ohn,\" The Simpsons (and a collection of ancillary characters) re-enact The Poseidon Adventure."
  },
  {
    "seasonNumber": 17,
    "episodeNumberInSeason": 19,
    "title": "Girls Just Want to Have Sums",
    "originalReleaseDate": "2006-04-30",
    "synopsis": "Principal Skinner is replaced by a women's education expert after making a sexist statement about women's math skills during a musical, which was written by a former female Springfield Elementary school student who was a math whiz, who segregates the school by gender. At first, Lisa loves the arrangement, but when she discovers that the girls' classes are more about self-esteem boosting than actual learning, Lisa disguises herself as a boy and attends the boys' classes. When she is recognized for her math performance and reveals herself, Bart says she only performed well because she learned to think like a boy. She makes a speech saying she is proud of her feminism and intelligence. Guest Star: Frances McDormand as Melanie Upfoot"
  },
  {
    "seasonNumber": 17,
    "episodeNumberInSeason": 20,
    "title": "Regarding Margie",
    "originalReleaseDate": "2006-05-07",
    "synopsis": "Marge goes nuts trying to clean the kitchen in time for a best house contest, but when she inhales the fumes of one too many cleaning solvents, she passes out and bangs her head on a stool. When Marge comes to at the hospital, she is stricken with amnesia, which does not last when she immediately remembers everyone in the family through their quirks—except for Homer. With Marge's memory of Homer erased, Patty and Selma help their sister find a new man. Guest Stars: Sal Bando and Gene Tenace"
  },
  {
    "seasonNumber": 17,
    "episodeNumberInSeason": 21,
    "title": "The Monkey Suit",
    "originalReleaseDate": "2006-05-14",
    "synopsis": "Reverend Lovejoy is appointed to spread the word of creationism in Springfield after Flanders complains about a new museum display about evolution, leading creationism to be taught in schools, and Lisa to fight back with secret classes about Charles Darwin and his theories of evolution. However, she is quickly arrested and a trial against her is initiated. Worried Lisa will lose, Marge gives Homer a beer at the trial that he has trouble opening. As Ned testifies, he is distracted by Homer and calls him a monkey. He concedes victory to Lisa. Guest Stars: Melanie Griffith and Larry Hagman"
  },
  {
    "seasonNumber": 17,
    "episodeNumberInSeason": 22,
    "title": "Marge and Homer Turn a Couple Play",
    "originalReleaseDate": "2006-05-21",
    "synopsis": "A first baseman for the Springfield Isotopes, Buck Mitchell, calls upon Homer and Marge to help him with his marriage to a pop singer named Tabitha Vixx, who upstages him with a racy musical number during one of his games. Their advice helps, and his on-field performance improves. When Buck punches Homer when he thinks Homer is having an affair with Tabitha, his performance drops again. Homer tricks Buck with a message of love from Tabitha from a blimp, but he is discovered. As Buck threatens Homer, Tabitha says she wants to stay together, and he agrees. Guest Stars: Mandy Moore and Stacy Keach"
  }
]
