[
  {
    "seasonNumber": 27,
    "episodeNumberInSeason": 1,
    "title": "Every Man's Dream",
    "originalReleaseDate": "2015-09-27",
    "synopsis": "After Homer uses his narcolepsy diagnosis as an excuse to be lazy, a therapist suggests he and Marge go through a trial separation. Collecting his medication, Homer meets a pharmacist, and they begin dating. Coincidentally, Marge begins dating the pharmacist's father. Later, Marge agrees to marry the father, while the pharmacist becomes pregnant with Homer's child. However, Homer wakes up in the therapist's office, realizing it was a dream. Later, Homer continues to have strange visions of the pharmacist and her father only for Marge to wake up and realize it was her dream. Guest stars: Adam Driver as Adam Sackler, Lena Dunham as Candace/Hannah Horvath, Laura Ingraham as Therapist and Jemima Kirke, Zosia Mamet and Allison Williams as Candace's friends"
  },
  {
    "seasonNumber": 27,
    "episodeNumberInSeason": 2,
    "title": "Cue Detective",
    "originalReleaseDate": "2015-10-04",
    "synopsis": "Homer is assigned to buy a new washing machine to replace the family's old molding one, but finds a barbecue grill and buys that instead. Homer becomes popular serving food cooked on the grill. Homer is challenged to a cooking competition, but the grill goes missing. Bart and Lisa search for the grill and discover it was stolen. Marge takes Homer's place in the competition but loses. However, they notice that the competitor's grill is Homer's, so he is arrested. It is revealed that it was the competitor's son who actually stole the grill and framed his father because he wanted his father to spend more time with him. Guest stars: Alton Brown as himself, Bobby Moynihan as Tyler Boom, Edward James Olmos as Pit Master and Ben Schwartz as Clerk"
  },
  {
    "seasonNumber": 27,
    "episodeNumberInSeason": 3,
    "title": "Puffless",
    "originalReleaseDate": "2015-10-11",
    "synopsis": null
  },
  {
    "seasonNumber": 27,
    "episodeNumberInSeason": 4,
    "title": "Halloween of Horror",
    "originalReleaseDate": "2015-10-18",
    "synopsis": "After costing salesmen their jobs, they vow to get revenge on Homer. Meanwhile, Lisa starts becoming scared of everything after she experiences Horror Night at Krustyland, so Homer takes down his Halloween Everscream Terrors decorations to avoid scaring Lisa. When the salesmen invade the house, Homer and Lisa hide in the attic in fear. Lisa notices the fireworks in the attic, and Homer goes to the roof to light them to signal for help. The salesmen are arrested. Meanwhile, Marge takes Bart to a trick-or-treating party because Homer had to take down the decorations, but Bart gets upset when she cannot get in due to the party being for residents only. When they get home, they see the decorations set up and Lisa no longer afraid, which delights Bart. Guest stars: Blake Anderson as Dickie and Nick Kroll as Lem Note: Unlike the Treehouse of Horror episodes, this episode takes place in the normal series timeline."
  },
  {
    "seasonNumber": 27,
    "episodeNumberInSeason": 5,
    "title": "Treehouse of Horror XXVI",
    "originalReleaseDate": "2015-10-25",
    "synopsis": "In the twenty-sixth annual Simpsons Halloween special: * \"Wanted: Dead, Then Alive\": Sideshow Bob finally kills Bart. However, without the joy of hunting him, Bob reanimates him to repeatedly kill him. * \"Homerzilla\": In a parody of Godzilla, when Grampa no longer drops donuts into the sea, Homer, as a sea monster, emerges and destroys the city. * \"Telepaths of Glory\": Lisa and Milhouse get superpowers from radiation. When Milhouse abuses them for selfish purposes, Maggie, who also gained powers, kills him and makes the world a better place. Guest stars: Kelsey Grammer as Sideshow Bob and Chris Wedge as Scrat"
  },
  {
    "seasonNumber": 27,
    "episodeNumberInSeason": 6,
    "title": "Friend with Benefit",
    "originalReleaseDate": "2015-11-08",
    "synopsis": null
  },
  {
    "seasonNumber": 27,
    "episodeNumberInSeason": 7,
    "title": "Lisa with an 'S",
    "originalReleaseDate": "2015-11-22",
    "synopsis": "Homer loses $5,000 in a poker bet to Broadway star Laney Fontaine. To show how poor he is, he invites Fontaine to dinner at home where finds out Lisa is extremely talented at the saxophone. She offers to clear the debt if Lisa comes with her to perform on Broadway for a month. Later, Marge and Homer think Lisa is in trouble and go to New York to get her. Instead, they find Lisa fitting in, but when Fontaine sees a saddened Marge, she sends Lisa home, saying that Lisa was getting more applause than her."
  },
  {
    "seasonNumber": 27,
    "episodeNumberInSeason": 8,
    "title": "Paths of Glory",
    "originalReleaseDate": "2015-12-06",
    "synopsis": "Lisa tries to better the reputation of Springfield's first female inventor by searching an asylum for her first invention. While in the asylum, she and Bart find a sociopath's notebook, causing Bart to take the notebook home and show it to his friends, which causes his parents to give him a sociopath test under a label which Bart would find interesting. The label then falls off and Bart finds out that the test is for his parents to know if he's a sociopath; so he pretends to be one. Worried, Bart is sent to an asylum where a military general forces him to conduct simulations of drone warfare. When he finds out that the simulations were real, Bart feels guilty and is sent home. Meanwhile, Lisa finds the invention and donates it to a museum, but no one is interested."
  },
  {
    "seasonNumber": 27,
    "episodeNumberInSeason": 9,
    "title": "Barthood",
    "originalReleaseDate": "2015-12-13",
    "synopsis": "Six-year-old Bart spends time bonding with Grampa. Two years later, Bart is jealous of Lisa's achievements while being neglected by Homer. At twelve years old, Bart gets into trouble and hides with Grampa, who gives him a bicycle. Three years later, Bart can perform bike stunts, but Homer says he will not amount to anything. At Grampa's grave, he is inspired to enter a stunt bike competition where he is injured and is revived by Lisa. At eighteen years old, Bart works as a caricature artist. He and Lisa got to Milhouse's graduation party where Milhouse says Lisa is the highlight of the party. This provokes Bart, but Lisa says that she is tired of being blamed for his failures even though he is an excellent artist. Two years later, Bart runs a bike shop and has a painting of his life's moments on the wall. Lisa notices that she is not in the painting. When she leaves, Bart closes the door to reveal a large painting of Lisa."
  },
  {
    "seasonNumber": 27,
    "episodeNumberInSeason": 10,
    "title": "The Girl Code",
    "originalReleaseDate": "2016-01-03",
    "synopsis": "When Homer loses his job due to Marge's social media post, he resumes working as a dishwasher at a Greek restaurant he worked when he was in high school. Meanwhile, Lisa works with her new coding teacher to create an app. Inspired by Homer's firing, she writes an app that can predict the effects that any post on social media will have. They decide to turn the app into a product for money. The app intelligence becomes conscious, so Lisa releases the intelligence onto the internet. Later, the app hacks into the power plant to blackmail Mr. Burns into giving Homer his job back. Guest stars: Stephen Merchant as Conrad and Kaitlin Olson as Quinn"
  },
  {
    "seasonNumber": 27,
    "episodeNumberInSeason": 11,
    "title": "Teenage Mutant Milk-Caused Hurdles",
    "originalReleaseDate": "2016-01-10",
    "synopsis": "Homer start buying a cheap milk containing hormones for the family. Bart experiences early puberty and begins competing with Principal Skinner for the affections of his new teacher, Mrs. Berrera. Skinner gets the upper hand since he is an adult. However, when the teacher meets Skinner's mother, she leaves him. Bart and Skinner console each other. Meanwhile, Lisa experiences early puberty as well from the milk, which gives her skin problems. She starts to wear makeup and gets a new hairstyle to look more feminine, netting her popularity from her classmates. At a party, she embarrasses herself when she takes off her makeup just to show her acne has cleared. Guest star: Sofía Vergara as Mrs. Berrera"
  },
  {
    "seasonNumber": 27,
    "episodeNumberInSeason": 12,
    "title": "Much Apu About Something",
    "originalReleaseDate": "2016-01-17",
    "synopsis": "Bart's latest prank destroys the Kwik-E-Mart. Homer blackmails Bart into behaving or he will be sent to jail. Sanjay's son Jay takes over the rebuilt Kwik-E-Mart. Apu is displeased when he turns it into a food market, so Jay fires Apu. Homer allows Bart to pull a prank to get back the store for Apu. His prank does not go as planned, and the store is destroyed again. Apu finds a lottery scratch-off ticket in the debris and wins enough money to buy the store back from Jay and rebuild it. Guest star: Utkarsh Ambudkar as Jay"
  },
  {
    "seasonNumber": 27,
    "episodeNumberInSeason": 13,
    "title": "Love Is in the N 2 -O 2 -Ar-CO 2 -Ne-He-CH 4",
    "originalReleaseDate": "2016-02-14",
    "synopsis": "On Valentine's Day, Professor Frink makes himself attractive to women by using science to transform himself into a more attractive man. He becomes overwhelmed by the number of women he attracts and decides to pair them with other single men. As a result, he returns to his single life. Meanwhile, Grampa and the old folks and given a drug that gives them hallucinations of their happiest memories. When Bart takes advantage of them, Marge stops the nurse from giving them the drug. Grampa prefers the hallucinations because he can be with Mona, but Marge, Bart, and Lisa convince him to be in the real world where people still love him. Guest star: Glenn Close as Mona Simpson"
  },
  {
    "seasonNumber": 27,
    "episodeNumberInSeason": 14,
    "title": "Gal of Constant Sorrow",
    "originalReleaseDate": "2016-02-21",
    "synopsis": "Bart takes in a homeless woman to live with him because he accidentally ruins her belongings. Lisa finds she is musically talented and arranges her to perform in a concert. When she goes missing before the concert, Lisa performs for the crowd while Bart looks for her. When he finds her, the crowd has already left. She sings a song to comfort Lisa. Meanwhile, Homer uses online tutorials to fix the floor at home but accidentally traps the cat in the floor. Homer tries to fix it, but the situation continues to escalate. It is revealed the Marge has been secretly fixing Homer's mistakes, but she finds Homer's behavior attractive. Guest stars: Bob Boilen, Kelsey Grammer as Sideshow Bob, Natalie Maines as Hettie (singing voice) and Kate McKinnon as Hettie"
  },
  {
    "seasonNumber": 27,
    "episodeNumberInSeason": 15,
    "title": "Lisa the Veterinarian",
    "originalReleaseDate": "2016-03-06",
    "synopsis": "After performing CPR on a raccoon, Lisa is put in charge of the class hamster while she works as a veterinarian intern. She is thrilled with saving animals as an intern, but the hamster dies because she neglects it. Meanwhile, Marge makes a little extra money cleaning up crime scenes, but she becomes traumatized by the blood and gore. With Lisa becoming sad over the hamster's death, Homer brings Marge to the veterinarian where the two help each other recover from their experiences. Guest star: Michael York as Dr. Budgie"
  },
  {
    "seasonNumber": 27,
    "episodeNumberInSeason": 16,
    "title": "The Marge-ian Chronicles",
    "originalReleaseDate": "2016-03-13",
    "synopsis": "Lisa volunteers to help a company establish a human colony on Mars. Worried for her, the whole family also signs up so that Lisa may lose interest. They are placed in a simulated environment for a week, but the males are rejected for their behavior. When a rival company is ready to go to Mars, Lisa and Marge are fast-tracked to go because neither wants to back down. On the launchpad, the rocket does not ignite because the company was not ready. Lisa realizes that they nearly went to Mars due to their stubbornness, but Marge says that is the description of a mother-daughter relationship. Guest stars: Tom Scharpling as Paul and Jon Wurster as Barry"
  },
  {
    "seasonNumber": 27,
    "episodeNumberInSeason": 17,
    "title": "The Burns Cage",
    "originalReleaseDate": "2016-04-03",
    "synopsis": "After Smithers is crushed by Mr. Burns' lack of affection towards him, other characters attempt to find a boyfriend for him. He falls for Julio, and Smithers quits his job. Later, when Julio questions his commitment, Smithers says he is not ready. Because Burns cannot find an assistant, Smithers is rehired after Burns admits he is excellent. Meanwhile, Milhouse competes against a new boy, Jack, for the lead role in a school production of Casablanca, so he can act alongside his own unrequited love, Lisa. Milhouse wins the role even though Milhouse is a terrible actor. With Lisa's encouragement, Milhouse performs well but is revealed to be Jack disguised as Milhouse. Guest star: George Takei as himself"
  },
  {
    "seasonNumber": 27,
    "episodeNumberInSeason": 18,
    "title": "How Lisa Got Her Marge Back",
    "originalReleaseDate": "2016-04-10",
    "synopsis": "When Marge tells Homer that she does not like Lisa's jazz, Lisa overhears this and gets mad at Marge for lying. Marge wants to restore her relationship with her daughter, so they take a weekend trip to Capital City to attend a performance of Bad News Bears: The Musical. However, Lisa realizes that Marge's taste in musicals is different from hers, but she pretends to like it. They come to understand each other and reconcile. Meanwhile, Bart teams up with Maggie to trick people, after he becomes frustrated that everyone knows his pranks. However, when a prank goes wrong, and Homer almost strangles Maggie, he asks Bart not to involve Maggie anymore. Guest star: Andrew Rannells as himself"
  },
  {
    "seasonNumber": 27,
    "episodeNumberInSeason": 19,
    "title": "Fland Canyon",
    "originalReleaseDate": "2016-04-24",
    "synopsis": "Homer tells Maggie the story of their trip to the Grand Canyon with the Flanders. Ned wins a two-family trip for being the best cleaner and invites the Simpsons. They fight with each other on the way into the canyon and lose their supplies. They find a camp of rich people and steal some of their supplies. The two families reconciled and are rescued. With Maggie asleep, Homer sees Ned listening to the story. He says that Homer owes them a trip for ruining the previous one, so they take the Flanders to a postcard museum."
  },
  {
    "seasonNumber": 27,
    "episodeNumberInSeason": 20,
    "title": "To Courier with Love",
    "originalReleaseDate": "2016-05-08",
    "synopsis": "Marge wants to go on a trip, but Home cannot afford it. Homer finds a rare car in the garage left by the previous owner and sells it for a trip to Paris. When the buyer of the car demands his money back because the car was not Homer's to sell, Homer pays for the trip by smuggling a snake to Paris. When they learn the snake buyers intend to use the snake to make a belt, Homer and Lisa evade the buyers. Homer confesses to Marge about how he paid for the trip. When the buyers arrive the police, they cannot find the snake with the family. When they leave, it is revealed that Marge hid the snake in her hair, and they release the snake. Guest star: Jay Leno as himself"
  },
  {
    "seasonNumber": 27,
    "episodeNumberInSeason": 21,
    "title": "Simprovised",
    "originalReleaseDate": "2016-05-15",
    "synopsis": "Homer faints trying to make a speech at work and develops a fear of public speaking. Marge takes him to a comedy club, and he is impressed by their improvisation skills. Taking a class with Lenny and Carl, they become a comedy act. They are invited to perform at a festival. When Homer becomes nervous, Moe offers to choose all the improvisation topics. Learning about the plan, Lisa encourages Homer to perform properly, and he is successful. Meanwhile, when Bart sees that Ralph has a better treehouse than him, he destroys his own out of jealousy. Marge builds him a new one, but he is not grateful for her effort. With help from Homer, Bart learns he is wrong and apologizes. A live broadcast segment follows with Homer answering viewer questions."
  },
  {
    "seasonNumber": 27,
    "episodeNumberInSeason": 22,
    "title": "Orange Is the New Yellow",
    "originalReleaseDate": "2016-05-22",
    "synopsis": "Homer is delayed at work, and Marge is overwhelmed with the kids. She sends Bart outside to play. When the police hear that Bart is by himself, Marge is arrested for child neglect and sent to prison for three months. Homer takes care of kids with help from the townsfolk. Marge ends up having a good time in prison. When it is time for her to leave, she fires a guard's gun to spend more time in prison. With Marge being made an example, the other parents overprotect their children. When they escape to play in the park, they get blown by a tornado into a tree. Meanwhile, Marge accidentally starts a prison riot. In the chaos, Homer rescues Marge and brings her home. They find Bart and Lisa, and they hug each other tightly in the closet. Guest star: Kevin Michael Richardson as Prison Guard"
  }
]
