[
  {
    "seasonNumber": 28,
    "episodeNumberInSeason": 1,
    "title": "Monty Burns' Fleeing Circus",
    "originalReleaseDate": "2016-09-25",
    "synopsis": "Mr. Burns puts on a variety show at the Springfield Bowl in exchange for rebuilding the town after it is burned to the ground. As he prepares for the show, Burns hires Lisa as his assistant, but he is frightened by flashbacks of a childhood incident. Burns cancels the show, and Lisa learns that he embarrassed himself when performing as a child. Lisa encourages him to put on the show. During the performance, Burns repeats his childhood act but embarrasses himself again. Meanwhile, the power plant workers party while Burns is away. Marge tells Homer to maintain order as the safety inspector, but some food left in the plant's core causes an explosion. Guest stars: Amy Schumer as Mrs. Burns and Pendleton Ward as himself"
  },
  {
    "seasonNumber": 28,
    "episodeNumberInSeason": 2,
    "title": "Friends and Family",
    "originalReleaseDate": "2016-10-02",
    "synopsis": "Mr. Burns is concerned he will never have a family, so he creates a virtual reality program where he acts as the father. Marge, Bart, and Lisa are hired to act as his family. With Homer alone, he meets his neighbor Julia, who shares many of his interests. When the Simpson family tires of being Burns' family, they are fired. Going home, Marge thinks Homer and Julia are having an affair, but Julia assures her that they are not. Homer shows Marge how Julia taught him how to improve their relationship, so Marge forgives him. Guest star: Allison Janney as Julia"
  },
  {
    "seasonNumber": 28,
    "episodeNumberInSeason": 3,
    "title": "The Town",
    "originalReleaseDate": "2016-10-09",
    "synopsis": "Homer takes the family on a \"hate-cation\" to Boston when he catches Bart rooting for the rival Boston Americans football team. But after discovering the appeal of candlepin bowling over his regular bowling, and finding a better safety inspector job at a candy factory, they agree to move there. Meanwhile, Lisa discovers how much Boston has to offer academically compared to Springfield. However, when Bart discovers that the city is full of intellectuals, including those in his school's detention, he looks for a way to go home. He brings the family to the Americans' championship parade, which provokes Homer into accusing them of cheating. They are forced to move home, which delights Bart but saddens Lisa. Guest stars: Bill Burr as Townie, Michael Chiklis as Handsome quarterback, Rachel Dratch as Doctor, Doris Kearns Goodwin as herself and Dana Gould as Murphy"
  },
  {
    "seasonNumber": 28,
    "episodeNumberInSeason": 4,
    "title": "Treehouse of Horror XXVII",
    "originalReleaseDate": "2016-10-16",
    "synopsis": "In the twenty-seventh annual Simpsons Halloween special: * \"Dry Hard\": Mr. Burns makes the children fight to the death for a day in his personal reservoir. Lisa convinces them to fight back against Burns, but they end up destroying the reservoir. * \"BFF R.I.P.\": Lisa's imaginary friend kills her real friends, so she can be her only friend. Lisa uses her imagination to give her imaginary friend a miserable life, which causes her to leave. * \"MoeFinger\": Bart is recruited to Moe's group of secret barfly agents replace Homer, who was killed. They investigate a company that bought all the beer in the world and learn that the head of the company is Homer. The agents fight Homer, and Bart kills him. Guest stars: Drew Carey as himself, Donald Fagen as himself, Kelsey Grammer as Sideshow Bob, Maurice LaMarche as Hedonismbot, Judith Owen as herself and Sarah Silverman as Rachel Note: This is the show's 600th episode."
  },
  {
    "seasonNumber": 28,
    "episodeNumberInSeason": 5,
    "title": "Trust but Clarify",
    "originalReleaseDate": "2016-10-23",
    "synopsis": "Kent Brockman is caught lying about his war reporting and is fired. Lisa and Bart investigate the side effects of Krusty's new candy and learn that it contains a dangerous chemical. When the local new station refuses to air the story, they go to Kent Brockman to report it. They secretly record Krusty saying he knew of the dangers, which leads to Brockman getting his job back. Meanwhile, Homer is jealous of a coworker who gets a promotion. Marge makes him a suit, so he can ask Mr. Burns for his own promotion. He is denied, so Homer goes to Moe's for comfort. Guest star: Dan Rather as himself"
  },
  {
    "seasonNumber": 28,
    "episodeNumberInSeason": 6,
    "title": "There Will Be Buds",
    "originalReleaseDate": "2016-11-06",
    "synopsis": "Homer coaches the kids' lacrosse team with Milhouse's dad Kirk. The team is successful due to Kirk's experience as a star player whose career was derailed by injury. However, Homer is annoyed by Kirk's behavior. Kirk disappears upon hearing Homer rant about him being a loser, just as the team needs him for the championship game. Homer finds Kirk, who is saddened that Homer does not respect him, but he says that Kirk was able to coach a winning team. Feeling confident, Kirk and Homer return to the team and win the championship."
  },
  {
    "seasonNumber": 28,
    "episodeNumberInSeason": 7,
    "title": "Havana Wild Weekend",
    "originalReleaseDate": "2016-11-13",
    "synopsis": "The Simpsons go to Cuba to help an ailing Grampa get cheap medical care. While there, he falls for a woman named Isabella and encounters a friend from the Air Force who defected to Cuba. They go to a club in the jungle where they are many Americans in exile. Grampa decides to stay in Cuba. However, Isabella reveals that she is a CIA agent and used Grampa to capture the Americans who escaped to Cuba. A saddens Grampa goes home but is comforted by his family. Guest stars: Stacy Keach as H.K. Duff and Deb Lacusta as Isabella"
  },
  {
    "seasonNumber": 28,
    "episodeNumberInSeason": 8,
    "title": "Dad Behavior",
    "originalReleaseDate": "2016-11-20",
    "synopsis": "Homer discovers a new app that makes his life easier, so he hires someone to be a father figure to Bart. With Kirk and Milhouse fighting, Homer bonds with Milhouse. When Bart learns that the bond with his father figure is not real, Bart gets jealous of Homer and Milhouse. Bart bonds with Kirk. They encounter Homer and Milhouse while go-kart racing. When Bart is injured, Homer goes to his aid, and they forgive each other. Kirk and Milhouse also make up. Meanwhile, Grampa learns he is going to be a father again when he impregnates someone at the retirement home. Seeing Homer and Milhouse together, he vows to be a good father, but he is relieved to learn that it was Jasper who fathered the child. Guest star: Matt Leinart as himself"
  },
  {
    "seasonNumber": 28,
    "episodeNumberInSeason": 9,
    "title": "The Last Traction Hero",
    "originalReleaseDate": "2016-12-04",
    "synopsis": "When Homer is injured at work and is immobilized, Mr. Burn finds he could be liable, so he gets Smithers to make Homer sign a waiver. Homer is bored being at home with Marge. Smithers is having trouble getting Homer to sign but bonds with Marge while he is at their home. When Burns threatens to transfer Smithers overseas for not getting the waiver, Homer signs the waiver so Smithers can stay close to Marge. Meanwhile, with the children fighting on the school bus, Lisa is made bus monitor to set the seating arrangement and enforce the peace. However, the children eventually rebel because Bart says the time on the bus allows the children to be themselves."
  },
  {
    "seasonNumber": 28,
    "episodeNumberInSeason": 10,
    "title": "The Nightmare After Krustmas",
    "originalReleaseDate": "2016-12-11",
    "synopsis": "Krusty, who is Jewish, has trouble bonding with his daughter Sophie, who is Christian. Marge invites them to spend Christmas with the Simpsons, but Krusty upsets Sophie. Reverend Lovejoy seeks converts to boost church attendance. When Krusty thinks he sees a sign from God, Lovejoy gets him to convert. Krusty changes his show into one that contemplates his faith. When he is to be baptized in a frozen river, Krusty falls into the ice and has a vision of his father. Lovejoy rescues him, which causes more people to come to church while Krusty returns to the Jewish faith. Meanwhile, a Christmas gnome scares Maggie. After having a nightmare about it, she destroys the gnome so she can sleep peacefully. Guest stars: Wayne Gretzky as himself, Theo Jansen as himself, Natasha Lyonne as Sophie and Jackie Mason as Rabbi Krustofsky"
  },
  {
    "seasonNumber": 28,
    "episodeNumberInSeason": 11,
    "title": "Pork and Burns",
    "originalReleaseDate": "2017-01-08",
    "synopsis": "Inspired by a Japanese self-help book on minimalist living, Marge makes the family get rid of some of their possessions. Homer attempts to give away his pet pig Plopper and ends up using him as a therapy animal. At work, Mr. Burns' hounds injure it, so he agrees to care for it. After bonding with it, he refuses to give it back to Homer. With Bart and Smithers' help, he takes back Plopper from Burns. Meanwhile, Lisa takes the book's advice too far and gives away everything that she owns, including her saxophone. Without it, Lisa is saddened, but Marge reveals that she could not bring herself to throw away their possessions and hid them in a storage locker. Guest stars: Joyce Carol Oates as herself and Michael York as Dr. Budgie"
  },
  {
    "seasonNumber": 28,
    "episodeNumberInSeason": 12,
    "title": "The Great Phatsby",
    "originalReleaseDate": "2017-01-15",
    "synopsis": "Mr. Burns wants to hold a party at his vacation home, and he tasks Homer with sending invitations. He invites his family and a few townsfolk, and the party is a failure. Homer and Burns notice another party nearby. They go and see it is thrown by Jay G, a hip-hop artist who was inspired by Burns' advice book. The Simpson family explore the vacation town, and Bart encounters a man who claims Jay G ruined his life. Jay G gives Burns a credit card as a gift and tells him to go on a spending spree. However, Jay G designed the card to take Burns' money and leaves him bankrupt. Homer decides to help Burns. They learn that the man Bart met wrote the songs on Jay G's first album, and they hire him to write a revenge rap. However, he betrays Burns for Jay G. Planning another revenge, Burns breaks into Jay G's mansion to capture his pet goose. He is discovered, and they attack each other. Jay G confesses that he betrayed Burns because that was in his advice book. Touched, Burns forgive him, and Jay G gives his fortune back to him. Guest stars: Charles Barkley as himself, Jim Beanz, Common as himself, Taraji P. Henson as Praline, Phil LaMarr, Dawnn Lewis, Keegan-Michael Key as Jazzy James, RZA as himself and Snoop Dogg as himself"
  },
  {
    "seasonNumber": 28,
    "episodeNumberInSeason": 13,
    "title": "Fatzcarraldo",
    "originalReleaseDate": "2017-02-12",
    "synopsis": "Homer finds a chili dog stand when Krusty Burger starts serving healthy food. Grampa says that Homer always went there as a child while Grampa and Mona attended marriage counseling next door. The owner does not remember Homer. The stand becomes popular and Krusty Burger loses business. Meanwhile, Lisa joins the school radio show. She tries to produce serious programming, but school shuts it down. Homer takes Lisa to the stand to comfort her but sees that it has shut down for health violations. Krusty tries to buy the stand, but Homer chains it to his car and drives off with it. Homer loses control, and he and the stand ends up dangling off the side of a bridge. The stand's owner tells Homer that he remembers him and to let go of the stand. Homer realizes that the stand represented a difficult time in his childhood. He is rescued, and the stand falls and is destroyed. Guest stars: Glenn Close as Mona Simpson"
  },
  {
    "seasonNumber": 28,
    "episodeNumberInSeason": 14,
    "title": "The Cad and the Hat",
    "originalReleaseDate": "2017-02-19",
    "synopsis": "At the beach, Lisa finds a sunhat while Bart's temporary tattoo quickly fades. Jealous, Bart throws the hat out of the car window on the way home. Bart feels increasingly guilty, but Lisa does not forgive him. Bart finds and retrieves the hat, but Lisa is indifferent. However, Lisa feels guilty for ignoring Bart's gesture, and they forgive each other. Meanwhile, Homer begins playing chess, and everyone in Springfield becomes impressed by his talents. He learns that he used to play chess with Grampa as a child until he defeated Grampa, so Grampa stopped playing. He gets Grampa to play with him again and lets him win to make him feel better. Guest stars: Magnus Carlsen as himself, Seth Green as the Robot Chicken Nerd and Patton Oswalt as Bart's Guilt"
  },
  {
    "seasonNumber": 28,
    "episodeNumberInSeason": 15,
    "title": "Kamp Krustier",
    "originalReleaseDate": "2017-03-05",
    "synopsis": "Bart and Lisa return from Kamp Krusty, both traumatized. A therapist tells Marge to keep a watch on Bart. With Bart interrupting their sexual activity, Homer goes to work and becomes more productive. Bart has a nightmare of being in a canoe at camp while Homer stops having sex with Marge. The therapist suggest they return to Kamp Krusty, which has been turned into an adult resort. Bart and Lisa explore where they went in the canoe and remember another child named Charlie who fell into the river. They find Charlie, who reveals himself to be a security guard at the club with dwarfism. Meanwhile, at the club, Marge is able seduce Homer into having sex. Guest stars: Lizzy Caplan as Virginia Johnson and Michael Sheen as William Masters"
  },
  {
    "seasonNumber": 28,
    "episodeNumberInSeason": 16,
    "title": "22 for 30",
    "originalReleaseDate": "2017-03-12",
    "synopsis": "Bart becomes a star basketball player at Springfield Elementary. After feuding with Homer, his coach, Fat Tony suggests he get revenge on Homer by point shaving while unwittingly helping Tony make money. After winning the semi-finals, Tony gives Bart a sharing of the winnings, which shocks Bart into realizing what was happening. Bart is told to lose the championship game. Bart tries to perform well in the game but is being sabotaged by Milhouse, who is also working for Tony. In the end, Bart wins the game, prompting Tony to try and kill Homer and Bart. However, Lisa stops him by threatening to reveal that Fat Tony played terribly on a girls' basketball team when he was a child. The team is declared champions, but Bart stops playing once he becomes terrible playing against taller children. Guest stars: Stephen Curry as himself, Earl Mann as the Narrator/Eddie Muntz and Joe Mantegna as Fat Tony"
  },
  {
    "seasonNumber": 28,
    "episodeNumberInSeason": 17,
    "title": "A Father's Watch",
    "originalReleaseDate": "2017-03-19",
    "synopsis": "Marge goes to a parenting expert for advice when she thinks that Bart is on the road to failure, and she tells her to give Bart a trophy for any task. Following her advice, Homer opens a trophy store with Bart helping to make trophies. When Bart's poor effort is shown, Homer calls him a loser. Bart goes to Grampa, who gives Bart a prized watch. Meanwhile, Lisa is concerned about giving out participation trophies. Another expert advises never giving out trophies. This prompts Marge to throw away all of Lisa's awards. Bart shows off Grampa's watch to Homer but later loses it in the forest. When Homer sells his trophies at the pawn shop, he finds Grampa's watch. Planning to taunt Bart, he buys the watch back, but when he sees that Bart is saddened over losing the watch, he gives it back to him. Guest stars: Vanessa Bayer as Dr. Clarity Hoffman-Roth, Brian Posehn as Dumlee, Rob Riggle as Dr. Fenton Pooltoy and Adam Silver as himself"
  },
  {
    "seasonNumber": 28,
    "episodeNumberInSeason": 18,
    "title": "The Caper Chase",
    "originalReleaseDate": "2017-04-02",
    "synopsis": "At Yale, Mr. Burns meets a fellow alumnus, Bourbon Verlander, who runs a for-profit university. Inspired, Burns creates his own university with the power plant workers as teachers. Worried that Homer is a teacher, Lisa gives him a set of movies featuring inspirational teachers. Homer becomes a good teacher, and Burns sells him to Verlander. Meeting with other top minds in their fields, Verlander has them teach robots who will enroll in at Yale, so Verlander can collect their financial aid. However, when they enroll, Homer provokes them with a microaggression, causing them to explode. Guest stars: Jason Alexander as Verlander, Ken Jennings as himself, Stan Lee as himself, Robert McKee as himself, Suze Orman as herself and Neil deGrasse Tyson as himself"
  },
  {
    "seasonNumber": 28,
    "episodeNumberInSeason": 19,
    "title": "Looking for Mr. Goodbart",
    "originalReleaseDate": "2017-04-30",
    "synopsis": "Bart learns he can get gifts if he helps elderly women. He encounters a woman, Phoebe, who will give him money if he picks her up from the nursing home four days in a row, so she can look at nature. Meanwhile, Homer and Lisa join an augmented reality game where they walk around and hunt for creatures. After four days, Bart, enjoying Phoebe's company, refuses her money, so she gives him her camera. He realizes that Phoebe plans to commit suicide, so he recruits Homer, Lisa, and the other game players to hunt for Phoebe. When they find her, she thanks Bart for showing she still has a reason to live. Guest stars: Valerie Harper as Ma-Ma and Jennifer Saunders as Phoebe Pratt"
  },
  {
    "seasonNumber": 28,
    "episodeNumberInSeason": 20,
    "title": "Moho House",
    "originalReleaseDate": "2017-05-07",
    "synopsis": "Mr. Burns' boarding school friend Nigel comes to town and bets Mr. Burns that he can break up Homer and Marge. Nigel takes Homer to Moe's to tempt him with women. He refuses but learns that Moe likes Marge. Nigel gives Moe money to open a new club. Homer and Marge are invited to the grand opening. Nigel increases the stakes, betting his fortune against Smithers. As Moe and Marge dance, Smithers gives Homer a gift to give to Marge. Moe and Marge are confused about their feelings, and Marge becomes upset when Homer gives her the gift. Later, Moe separately tells Homer and Marge to come to the club. Moe tells Homer to treat Marge better, so Homer shows Marge a flip-book animation of them together. Burns wins the bet, but Smithers, seeking revenge, says that Nigel is imaginary, so he gets no money. Guest stars: Valerie Harper as Mrs. Butterworth and Michael York as Nigel"
  },
  {
    "seasonNumber": 28,
    "episodeNumberInSeason": 21,
    "title": "Dogtown",
    "originalReleaseDate": "2017-05-21",
    "synopsis": "Homer recklessly drives into an alley where he must choose between hitting Gil or Santa's Little Helper. He hits Gil, who sues Homer. At the trial, the jury accepts the argument that dogs are better than humans. Mayor Quimby decides to give dogs more rights than humans. They ignore the warning that dogs will take control if they are not held in check until it is too late. The town's dogs turn feral. The people enlist Gil to fight the dogs. However, when Marge learns Bart and Lisa went looking for Santa's Little Helper, she goes and defeats the lead dog. This causes the dogs to return to their owners. Guest stars: Michael York as Dr. Budgie"
  }
]
