[
  {
    "seasonNumber": 21,
    "episodeNumberInSeason": 1,
    "title": "Homer the Whopper",
    "originalReleaseDate": "2009-09-27",
    "synopsis": "Comic Book Guy creates a new superhero called Everyman who takes powers from other superheroes. Homer is cast as the lead in the film adaptation. To get Homer into shape, the movie studio hires celebrity fitness trainer Lyle McCarthy to help him. Homer gets into great shape, but when the trainer leaves to work on another movie, Homer regains his weight. As a result, the movie contains scenes of Homer with different body types. The premiere is disastrous, and Comic Book Guy gives it a terrible review. Because the move is not profitable, sequels are prohibited from being made. Guest Stars: Seth Rogen, Matt Groening and Kevin Michael Richardson"
  },
  {
    "seasonNumber": 21,
    "episodeNumberInSeason": 2,
    "title": "Bart Gets a \"Z",
    "originalReleaseDate": "2009-10-04",
    "synopsis": "Edna Krabappel is fired for drinking alcohol on the job because her students added it to her coffee. She is replaced with a young teacher named Zachary Vaughn. Although Bart likes his new teacher, he feels guilty for getting Edna fired, so he gets her a self-help book to help fulfill her dreams. She opens a muffin shop. When Bart confesses what he did, Edna is angered because her real dream is to be a teacher and calls Bart a bad boy. He tells Principal Skinner what he did, but he is unable to rehire Edna. When Zachary gets drunk and insults the schoolchildren, Edna returns and forces the students to eat her muffins as punishment."
  },
  {
    "seasonNumber": 21,
    "episodeNumberInSeason": 3,
    "title": "The Great Wife Hope",
    "originalReleaseDate": "2009-10-11",
    "synopsis": "When the men and boys of Springfield become obsessed with mixed martial arts, Marge leads a protest when she catches Bart fighting in school. The sport's creator, Chett Englebrit, agrees to end it if Marge defeats him in a match. After training, the match begins with Chett immediately knocking down Marge. When Bart enters the ring to defend her, Chett injures him. Enraged, Marge knocks out Chett. Victorious, Marge makes a speech about ending violence, but the audience has already gone to the parking lot to watch two other people fight. Guest Star: Chuck Liddell"
  },
  {
    "seasonNumber": 21,
    "episodeNumberInSeason": 4,
    "title": "Treehouse of Horror XX",
    "originalReleaseDate": "2009-10-18",
    "synopsis": "In the twentieth annual Simpsons Halloween special: * \"Dial \"M\" for Murder or Press \"#\" to Return to Main Menu\": Lisa conspires with Bart to get revenge on their teachers after Ms. Hoover sends Lisa to detention. However, when Bart kills Hoover, but Lisa does not kill Mrs. Krabappel, he tries to blackmail her. To stop him, Lisa chases Bart with a knife until she declares she is not a murderer. She throws the knife away, but it flies back and kills Bart. * \"Don't Have a Cow, Mankind\": Krusty the Clown introduces a new hamburger made from cows that have eaten other cows. The burgers turn the townsfolk into zombies, but the Simpsons have survived. When they learn Bart is immune, the family make their way to a safe zone to develop a cure. Upon arrival, Bart is made to bathe in people's food to gain immunity. * \"There's No Business Like Moe Business\": Moe creates a new beer that becomes a sensation thanks to Homer being impaled on the microbrew machine and bleeding into the beer supply. Moe tries to woo Marge by saying Homer left her, but Homer returns and hurls Moe away to reunite with Marge."
  },
  {
    "seasonNumber": 21,
    "episodeNumberInSeason": 5,
    "title": "The Devil Wears Nada",
    "originalReleaseDate": "2009-11-15",
    "synopsis": "Marge becomes a sex symbol after pin-up pictures of her appear on a calendar. Meanwhile, Carl Carlson is chosen as the Springfield Nuclear Plant's newest supervisor, and Homer gets hired as Carl's assistant. Homer is quickly exhausted by his work and is unable to be with Marge, whose libido has increased because of the calendar shoot. When Homer and Carl go to Paris on business, an angry Marge accidentally hurts Ned, so she invites him over for dinner. When Carl flirts with a woman in Paris, Homer blackmails him to get his old job back. Meanwhile, Marge is tempted to kiss Ned at dinner until she sees her wedding photo and stops herself."
  },
  {
    "seasonNumber": 21,
    "episodeNumberInSeason": 6,
    "title": "Pranks and Greens",
    "originalReleaseDate": "2009-11-22",
    "synopsis": "Bart learns that the best prankster in Springfield Elementary history was Andy Hamilton, who trapped Principal Skinner in a pool of worms for three days. Bart finds him and sees that he is unemployed and living with his mother. Bart gets him a job as Krusty's assistant. When he learns that Krusty made a large order for worms, he is worried that Andy is repeating his prank. However, he learns that it is part of an act, and Andy has been made a writer on the show. Meanwhile, Marge is chastised by the other mothers in her social circle for not serving healthy snacks. At their next meeting, Marge serves healthy food, but when they see the food was prepared on pots containing dangerous chemicals, they immediately run to an ambulance. Marge realizes she prefers eating unhealthy food. Guest Star: Jonah Hill"
  },
  {
    "seasonNumber": 21,
    "episodeNumberInSeason": 7,
    "title": "Rednecks and Broomsticks",
    "originalReleaseDate": "2009-11-29",
    "synopsis": "As the Simpsons drive home from a vacation, Homer loses control of the car, and it lands in a frozen lake. Cletus rescues them, and he invites Homer to taste his moonshine. Bart and Lisa play with the Spuckler children, and Lisa gets lost in the woods and encounters three girls who are practicing Wiccans. Lisa is invited to join their coven, but they are arrested for witchcraft. They cast a spell, and some townsfolk at temporarily blinded. Although they are acquitted, the townsfolk decide to drown them. However, Lisa proves that their blindness was caused by Homer and Cletus throwing their moonshine into the river, the source of their drinking water, because they thought the police were coming to arrest them instead of the Wiccans. The girls are released. Guest Star: Neve Campbell"
  },
  {
    "seasonNumber": 21,
    "episodeNumberInSeason": 8,
    "title": "O Brother, Where Bart Thou?",
    "originalReleaseDate": "2009-12-13",
    "synopsis": "Jealous of Lisa and Maggie's sisterly bond, Bart decides he wants a baby brother to call his own. He fails to convince Homer and Marge to have another child, so he tries to adapt a boy at an orphanage. Although he is denied, a boy named Charlie follows him home. Bart and Charlie have fun together, but when Charlies gets scared watching a horror movie, Bart learns he must be responsible with him. Lisa says Charlie needs to return to the orphanage, so Bart takes him back. Charlie is later adapted by a family with six daughters. Guest Stars: Eli Manning, Peyton Manning, Cooper Manning, Kim Cattrall, Jordan Nagai, Huell Howser and the Smothers Brothers"
  },
  {
    "seasonNumber": 21,
    "episodeNumberInSeason": 9,
    "title": "Thursdays with Abie",
    "originalReleaseDate": "2010-01-03",
    "synopsis": "Grampa meets a human-interest journalist who writes and publishes Grampa's life stories. Homer wants to hear more stories, but Grampa rejects him. Homer tries to write Mr. Burns' stories and publish them in the newspaper, but the publisher turns him down. While there, he finds a story written by the journalist stating that Grampa died. Realizing the journalist plans to kill Grampa, Homer goes to rescue him, and he and Grampa reconcile. Meanwhile, Bart cares for a stuffed lamb as part of a class project. Uninterested, he gives it to Lisa who loses it down a storm drain, so Bart needs to go into the sewer to rescue it. Guest Star: Mitch Albom"
  },
  {
    "seasonNumber": 21,
    "episodeNumberInSeason": 10,
    "title": "Once Upon a Time in Springfield",
    "originalReleaseDate": "2010-01-10",
    "synopsis": "Krusty changes his show to get more girls to watch it by adding a princess character named Penelope. Krusty hates her at first until Princess Penelope reveals that she is Krusty's biggest fan. They fall in love and plan to get married. Bart, upset at the changes, tries to sabotage the wedding by bringing Krusty's former wives. Krusty feels unworthy of Penelope, so he cancels the wedding and Penelope leaves the show. Later, Krusty finds Penelope to apologize and says he has changed his mind. Meanwhile, a corporate recruiter encourages Homer, Lenny, and Carl to work for a nuclear plant in Capital City after Mr. Burns announces a moratorium on free donuts due to budget cuts. They accept the offer, but Burns persuades them to return by offering better donuts. Guest Stars: Anne Hathaway, Gary Larson, Jackie Mason, and Eartha Kitt."
  },
  {
    "seasonNumber": 21,
    "episodeNumberInSeason": 11,
    "title": "Million Dollar Maybe",
    "originalReleaseDate": "2010-01-31",
    "synopsis": "Homer and Marge are scheduled to give a toast at a wedding. Going separately, Homer stops to buy a lottery ticket even though it will make him late to the wedding. To make up for time, he drives recklessly and crashes. In the hospital, he learns he won a million dollars, but Marge does not know why he crashed. To cover his tracks, Homer begins spending his windfall on anonymous gifts for the family, one of which is hiring alternative rock band Coldplay to perform for Bart. When he discovers what happened to Homer, Bart threatens to tell Marge unless Homer embarrasses himself. Instead, Homer tells Marge, who does not care as long as they have each other. Meanwhile, Lisa buys a video game system for the retirement home. However, the nurses destroy it because of the extra work they need to do after the seniors play with it. Guest Star: Chris Martin"
  },
  {
    "seasonNumber": 21,
    "episodeNumberInSeason": 12,
    "title": "Boy Meets Curl",
    "originalReleaseDate": "2010-02-14",
    "synopsis": "Homer and Marge try curling and discover that Marge is talented due to her experience sweeping floors. They are invited by Agnes and Principal Skinner to join their mixed curling team going to the Winter Olympics, which added the event as a demonstration sport. At the Olympics, Lisa begins collecting mascot pins. Performing well, the team wins the semi-final match, but Marge injures her right shoulder. They plan to forfeit the final match until Homer discovers that Marge has been hiding that she is left-handed. They return and win the gold medal. Meanwhile, Lisa, obsessed with the pins, trades her pearl necklace for more pins. When Bart discovers what she did, he creates a fake pin and trades it to get back her necklace. Guest Star: Bob Costas"
  },
  {
    "seasonNumber": 21,
    "episodeNumberInSeason": 13,
    "title": "The Color Yellow",
    "originalReleaseDate": "2010-02-21",
    "synopsis": "Lisa discovers a diary of a Simpson ancestor named Eliza who meets a slave named Virgil. She tries to help him escape and are met by a patrol, but the diary disintegrates before Lisa can finish reading it. At the library, Lisa learns that they escaped to the Simpson house where Virgil impresses Eliza's father, which makes Lisa think Eliza was a hero. When Lisa presents the story at school, Milhouse disputes the story. He reads from a journal of his ancestor, who witnessed Eliza's father being bribed to return Virgil, and Eliza did not stop him. Later, Grampa tells a saddened Lisa that Eliza's mother, Mabel, and Virgil had secretly escaped to Canada together. They get married, and the Simpson family is actually descended from Virgil and Mabel. Guest Star: Wren T. Brown"
  },
  {
    "seasonNumber": 21,
    "episodeNumberInSeason": 14,
    "title": "Postcards from the Wedge",
    "originalReleaseDate": "2010-03-14",
    "synopsis": "Once again, Homer and Marge try to discipline Bart after Mrs. Krabappel tells them that Bart has not been doing his homework, but Bart has a plan to manipulate Homer's strictness and Marge's sympathetic ear. Although they fight about what they should do, they reconcile and decide to ignore Bart. He realizes that he does not enjoy his antics unless someone is angered. He decides to destroy the school by driving the subway train under the school. When Marge and Homer learn from a note from Lisa about what Bart is going to do, Homer stops him in time. Bart is punished and is forced to update Homer about his homework. Lisa tells Bart that she knows it was Bart who actually wrote the note."
  },
  {
    "seasonNumber": 21,
    "episodeNumberInSeason": 15,
    "title": "Stealing First Base",
    "originalReleaseDate": "2010-03-21",
    "synopsis": "When Mrs. Krabappel takes an extended absence, her students join with the other fourth grade class where Bart falls for a girl named Nikki. The two are seen kissing, which leads to a ban on public displays of affection in the school. Nikki, however, alternates between loving and hating him whenever they kiss. When Bart falls off the roof of the school, the ban prevents anyone from touching him, so Nikki resuscitates him. Due to Nikki's continued erratic behavior, Bart ends their relationship. Meanwhile, when Lisa writes a post online about being disliked for being an overachiever, First Lady Michelle Obama comes to Springfield and makes a speech about the importance of academics. At the same time Nelson teaches a blind boy the art of being a schoolyard bully. He pranks Nelson when he says a punch to the face restored his sight. Guest Stars: Sarah Silverman and Angela Bassett"
  },
  {
    "seasonNumber": 21,
    "episodeNumberInSeason": 16,
    "title": "The Greatest Story Ever D'ohed",
    "originalReleaseDate": "2010-03-28",
    "synopsis": "Ned Flanders reluctantly invites the Simpson family to join him on a church retreat to Jerusalem at the suggestion of Reverend Lovejoy. Homer is unappreciative of the culture, which annoys Ned. When Homer angers Ned for sleeping on Jesus' tomb, Homer thinks he went into the desert and goes after him. Lost and dehydrated, Homer has a hallucination in which he is named the new Messiah. When Homer is rescued, he goes and preaches that people of all faiths should come together. Ned is impressed, but Homer's message is lost in a crowd where they all think they are the Messiah. Guest Stars: Sacha Baron Cohen and Yael Naim."
  },
  {
    "seasonNumber": 21,
    "episodeNumberInSeason": 17,
    "title": "American History X-cellent",
    "originalReleaseDate": "2010-04-11",
    "synopsis": "Mr. Burns is sent to jail for stealing valuable art. Smithers is left in charge at the power plant, and Homer and his friends begin taking advantage of his kindness. In prison, Burns' cellmate converts him into a Christian. When Smithers learns of what the employees are doing, he becomes crueler than Burns. Homer and his friends plan to break him out of prison, but Burns' is reluctant to leave until his evil returns. He learns he can use his wealth to buy his way out and resumes control of the power plant. Meanwhile, Bart and Lisa fight, and they break her ant farm. Santa's Little Helper eats all but one ant. They try to care for the ant, and they grow closer. When they decide to release it, the dog immediately eats it. Guest Stars: Joe Mantegna and Kevin Michael Richardson."
  },
  {
    "seasonNumber": 21,
    "episodeNumberInSeason": 18,
    "title": "Chief of Hearts",
    "originalReleaseDate": "2010-04-18",
    "synopsis": "When Homer accidentally appears to rob a bank, he is sentenced to community service. During his punishment, Homer offers Chief Wiggum a sandwich, and the two become friends. When Wiggum is shot trying to stop a robbery, Homer stays by his bedside in the hospital. When Wiggum becomes too needy, Homer leaves him, which angers Wiggum. When Homer goes to apologize, they witness Fat Tony making counterfeit shirts. Tony captures them and prepares to kill them until they fight back and escape. They reconcile and prank Flanders. Meanwhile, Bart becomes addicted to a Japanese kids' game called Battle Ball, which Marge confuses with dealing drugs. When Bart convinces Marge that what he is doing is legal, she thinks the game is cute, so Bart immediately stops playing. Guest Stars: Jane Kaczmarek, Maurice LaMarche and Joe Mantegna. Note: This is the first episode where Lisa (despite her presence) doesn't have a single line of dialogue."
  },
  {
    "seasonNumber": 21,
    "episodeNumberInSeason": 19,
    "title": "The Squirt and the Whale",
    "originalReleaseDate": "2010-04-25",
    "synopsis": "Homer builds a wind turbine in the yard, but the house only gets electricity when the wind is blowing. Bart prays for more wind. When a windy storm comes through town, Bart and Lisa survey the damage and discover a beached whale. Lisa gets the townsfolk to help move the whale back to sea, but they fail. Lisa stays with the whale overnight, but the whale is dead when she wakes up. The police blow up the whale to get rid of the body. Later, Lisa spots two young whales offshore and assumes they are the whale's children. When sharks surround it, Lisa and Homer ride in a boat to kill them. When activists prevent them from killing the sharks, the father whale arrives to protect the young whales."
  },
  {
    "seasonNumber": 21,
    "episodeNumberInSeason": 20,
    "title": "To Surveil with Love",
    "originalReleaseDate": "2010-05-02",
    "synopsis": "Smithers hides plutonium in Homer's gym bag when the plant needs to get rid of its nuclear waste. When Homer forgets it at a train station, a bomb squad blows it up, and the town installs surveillance cameras to prevent possible terrorism. When the police tire of watching the footage from the cameras, Ned is hired, and he enjoys enforcing his values on others. Bart finds a blind spot in the camera network in the backyard, so the townsfolk pay Homer to do their misdeeds there. When Ned finds out, Homer says Ned was playing God. He apologizes, and the town takes down the cameras. Meanwhile, people assume Lisa is not intelligent because she has blonde hair. She dyes her hair brown. When she purposely gives a weak argument at a debate competition and wins anyways, she accuses the judges of prejudice over hair color and tells the audience not to stereotype people. Guest Star: Eddie Izzard"
  },
  {
    "seasonNumber": 21,
    "episodeNumberInSeason": 21,
    "title": "Moe Letter Blues",
    "originalReleaseDate": "2010-05-09",
    "synopsis": "Homer, Reverend Lovejoy and Apu receive a letter from Moe that states he will steal one of their wives. The three get together and try to remember intimate moments between Moe and their wives. Homer goes home, and Marge assures Homer that their marriage is fine. Helen also tells Lovejoy that nothing is wrong, but Apu finds Moe with Manjula. She says Moe convinced her to stay with Apu. Moe reveals that the three were taking their marriage for granted, so he wrote the letter to motivate them. Guest Star: Don Pardo"
  },
  {
    "seasonNumber": 21,
    "episodeNumberInSeason": 22,
    "title": "The Bob Next Door",
    "originalReleaseDate": "2010-05-16",
    "synopsis": "Bart becomes convinced that their new neighbor, Walt Warren, is Sideshow Bob in disguise. Marge does not believe him and personally takes Bart to the Springfield Maximum Security Prison to prove it. Bart is reassured until the neighbor reveals to Bart that he truly is Sideshow Bob. He kidnaps Bart and drives away to kill him. The fake Bob escapes prison and explains to the Simpsons that Bob forced him to switch faces, so he could be released with the other low-level criminals. Walt goes after Bart and arrives as Bob struggles to kill Bart. Walt and Bob fight until the police arrive. Guest Star: Kelsey Grammer."
  },
  {
    "seasonNumber": 21,
    "episodeNumberInSeason": 23,
    "title": "Judge Me Tender",
    "originalReleaseDate": "2010-05-23",
    "synopsis": "Moe discovers his talent for judging in competitions and is invited to become a judge on the show American Idol. Simon Cowell tells Moe that he has become unlikable at home and advises him to be kinder. When he is nice to the contestants, he becomes unpopular. He discovers that Cowell tricked him, and he is removed from the show. Meanwhile, with Moe’s bar closed, Homer drives Marge crazy because he starts spending too much time at home, so she advises he take up golf as a hobby. When she learns that people who golf become addicted, she stops him. Guest Stars: Simon Cowell, Randy Jackson, Ellen DeGeneres, Kara DioGuardi, Ryan Seacrest and Rupert Murdoch."
  }
]
