[
  {
    "seasonNumber": 12,
    "episodeNumberInSeason": 1,
    "title": "Treehouse of Horror XI",
    "originalReleaseDate": "2000-11-01",
    "synopsis": "This year's Halloween story sees The Simpsons as \"The Munsters\" (with everyone except Lisa getting killed), Homer as a wandering spirit on the hunt for a good deed in \"G-G-Ghost D-D-Dad,\" Bart and Lisa as peasants in a fairy tale forest in \"Scary Tales Can Come True,\" and Lisa inadvertently dooming mankind by rescuing a dolphin in \"Night of the Dolphin.\""
  },
  {
    "seasonNumber": 12,
    "episodeNumberInSeason": 2,
    "title": "A Tale of Two Springfields",
    "originalReleaseDate": "2000-11-05",
    "synopsis": "While calling Animal Control over a badger taking residence in Santa's Little Helper's doghouse, Homer discovers that Springfield has two different area codes. Homer notices only the poorer half of town was forced to change area codes and has the town split in two with him as the mayor of New Springfield. The towns feud with each other until Homer builds a wall between the town. Isolated, the New Springfield residents move to Old Springfield. Homer forces The Who, scheduled to play in Old Springfield, to play in New Springfield instead. When the residents attack Homer, the Who resolves the issue by suggesting using speed dial, and they play a guitar riff to destroy the wall."
  },
  {
    "seasonNumber": 12,
    "episodeNumberInSeason": 3,
    "title": "Insane Clown Poppy",
    "originalReleaseDate": "2000-11-12",
    "synopsis": "Krusty takes parenting lessons from Homer when, during an outdoor book fair, a girl tells Krusty that she is his long-lost daughter from a one-night stand with a female soldier who fought during the Gulf War. Later, Krusty bets Sophie's violin when playing poker with Fat Tony and loses, which betrays Sophie's trust. Homer and Krusty break into Fat Tony's house to retrieve the violin and return it to Sophie."
  },
  {
    "seasonNumber": 12,
    "episodeNumberInSeason": 4,
    "title": "Lisa the Tree Hugger",
    "originalReleaseDate": "2000-11-19",
    "synopsis": "At Krusty Burger to celebrate Bart's new job to pay for video game console, Lisa falls for Jesse, the teenaged leader of a militant environmentalist group that is protesting the restaurant. When the group learns an ancient tree in town is scheduled to be cut down, Lisa volunteers to live in it to impress him. Missing her family, she leaves to visit them, but the tree is struck by lightning and destroyed, and Lisa is presumed dead. When the area is set to become an amusement park in her honor, she reveals herself to everyone. At the same time, Jesse, trying to honor Lisa, causes the fallen tree to slide downhill and destroy part of town."
  },
  {
    "seasonNumber": 12,
    "episodeNumberInSeason": 5,
    "title": "Homer vs. Dignity",
    "originalReleaseDate": "2000-11-26",
    "synopsis": "When the Simpsons once again have financial problems, Mr. Burns pays Homer to play pranks on others and humiliate himself in public while Smithers is away performing in a Malibu Stacy-themed musical. When Lisa sees what Homer is doing, she convinces him to spend the money to buy toys for kids at Costington's Department Store. Impressed, Costington invites Homer to be Santa Claus at a parade. When Burns tempts Homer with a million dollars to prank the parade watchers, he declines, and Burns performs the prank himself as Santa Claus."
  },
  {
    "seasonNumber": 12,
    "episodeNumberInSeason": 6,
    "title": "The Computer Wore Menace Shoes",
    "originalReleaseDate": "2000-12-03",
    "synopsis": "Homer decides to buy a computer after turning up at the plant to find that it is closed, and that, not having a computer, he did not receive the e-mail telling the workers. He then creates his own website and it eventually gains attention when he posts gossip. Homer dubs himself as \"Mr. X\" to conceal his identity. When he reveals that he is Mr. X, he becomes drugged into a mysterious island where people who know too much are imprisoned after Homer starts writing conspiracy theories such as flu shots causing increased holiday spending."
  },
  {
    "seasonNumber": 12,
    "episodeNumberInSeason": 7,
    "title": "The Great Money Caper",
    "originalReleaseDate": "2000-12-10",
    "synopsis": "Homer and Bart become father–son con artists after Bart is given money out of pity when Homer decided to not take him home. However, they are arrested for their scheme by an FBI agent, who is also a con man who steals their money and car. They tell Marge the car was stolen, and their description causes Groundskeeper Willie to be arrested. When the situation escalates, and Willie apparently kills Principal Skinner at his trial, Homer confesses the truth. Marge then reveals that she and the town conned Homer and Bart to teach them a lesson although Willie was not aware of it."
  },
  {
    "seasonNumber": 12,
    "episodeNumberInSeason": 8,
    "title": "Skinner's Sense of Snow",
    "originalReleaseDate": "2000-12-17",
    "synopsis": "A snowstorm traps the students of Springfield Elementary inside. While Principal Skinner tries to maintain control, he becomes partially buried while retrieving Bart from trying to escape, causing the children to run amok. Meanwhile, Ned and Homer drive to rescue the children. They lose control of the car but crash into a cracker factory. The salt inside spills out, causing the snow to melt and freeing Skinner and the children."
  },
  {
    "seasonNumber": 12,
    "episodeNumberInSeason": 9,
    "title": "HOMR",
    "originalReleaseDate": "2001-01-07",
    "synopsis": "While working as a human guinea pig (to pay off the family's lost savings after making a bad investment), Homer discovers the root cause of his subnormal intelligence: a crayon that was lodged in his brain ever since he was a boy. He decides to have it removed to increase his IQ, but discovers that being smart does not necessarily equal being happy."
  },
  {
    "seasonNumber": 12,
    "episodeNumberInSeason": 10,
    "title": "Pokey Mom",
    "originalReleaseDate": "2001-01-14",
    "synopsis": "Marge meets a convict, Jack Crowley at a prison rodeo with remarkable artistic talent. Seeing his potential, he is granted parole into her custody and is hired to paint a mural at Springfield Elementary. Crowley does not like the art Principal Skinner forces him to paint. When the mural in burned, Crowley is suspected. Marge defends him when he declares his innocence but is furious when he is found to be the true culprit and returns to prison. Meanwhile, Homer uses a trash can to fix people's spines after he uses it fix his own. However, chiropractors destroy it when it causes their business to decline."
  },
  {
    "seasonNumber": 12,
    "episodeNumberInSeason": 11,
    "title": "Worst Episode Ever",
    "originalReleaseDate": "2001-02-04",
    "synopsis": "Bart and Milhouse are banned from The Android Dungeon after stopping Comic Book Guy from buying a box of priceless Star Wars memorabilia for $5, but are hired as his replacements when Comic Book Guy has a heart attack and is advised to leave his job in order to make friends. The boys find secret illegal videos and hold a screening for the children. Meanwhile, Comic Book Guy begins a romance with Agnes Skinner. The police raid the comic book store, and the boys say the videos belong to Comic Book Guy. He is arrested, and Agnes breaks up with him."
  },
  {
    "seasonNumber": 12,
    "episodeNumberInSeason": 12,
    "title": "Tennis the Menace",
    "originalReleaseDate": "2001-02-11",
    "synopsis": "While making funeral arrangements for Grampa's future, the funeral planner pitches the idea of a mausoleum that uses the same amount of cement as a full-sized tennis court. This prompts Homer to instead build a tennis court in his backyard, initially mistaking the sport for \"Foxy Boxing\". The tennis court makes Marge and Homer popular in town, but it turns out that this is only because Homer's inferior tennis ability makes them an easy target. Bart on the other hand, shines as a natural."
  },
  {
    "seasonNumber": 12,
    "episodeNumberInSeason": 13,
    "title": "Day of the Jackanapes",
    "originalReleaseDate": "2001-02-18",
    "synopsis": "Krusty announces his retirement due to interference from network executives and the growing popularity of the big-money game show \"Me Wantee\", but when Krusty reveals to Sideshow Bob that all of the episodes featuring him have been erased, Sideshow Bob vows to kill Krusty when he is released from prison. He hypnotizes Krusty's biggest fan, Bart, to murder him during Krusty's farewell show. During the show, Krusty sings about his remorse for mistreating Sideshow Bob, causing him to prevent Bart from kill Krusty. However, the attempted murder scheme causes the police to attempt to execute Bob."
  },
  {
    "seasonNumber": 12,
    "episodeNumberInSeason": 14,
    "title": "New Kids on the Blecch",
    "originalReleaseDate": "2001-02-25",
    "synopsis": "A music producer, L.T. Smash, selects Bart, Nelson, Milhouse and Ralph to be members of the next hit boy band. When their song becomes a hit, Lisa discovers a subliminal message in it prompting people to join the Navy. Lisa learns that the producer is a Navy officer, but Homer and Marge dismiss her as being jealous of her brother. When the band becomes less influential after being satirized in Mad Magazine, the program is shut down, prompting Smash to attack Mad headquarters. Smash is arrested for his actions."
  },
  {
    "seasonNumber": 12,
    "episodeNumberInSeason": 15,
    "title": "Hungry, Hungry Homer",
    "originalReleaseDate": "2001-03-04",
    "synopsis": "Homer becomes a Good Samaritan after discovering the simple joys of helping people in need. When Homer stumbles on the plot to discreetly move the Springfield Isotopes to Albuquerque, New Mexico, he warns the town but is discredited. As a result, he goes on a hunger strike outside the ballpark but is moved inside to become an attraction for fans as his health declines. When fans lose interest, the team owner offers him food, which allows Homer to provide proof of the plot and prevent the team from leaving."
  },
  {
    "seasonNumber": 12,
    "episodeNumberInSeason": 16,
    "title": "Bye Bye Nerdie",
    "originalReleaseDate": "2001-03-11",
    "synopsis": "When Lisa becomes the target of a female bully, she attempts to learn why she is being targeted. She learns that a pheromone causes bullies to pick on nerds and creates an agent from salad dressing to block it. She demonstrates it, and it works until she runs out of salad dressing. Meanwhile, Homer goes into the baby-proofing business, which unfortunately threatens those of pediatricians and greeting card salesmen. Feeling guilty, Homer encourages baby to hurt themselves to save their businesses."
  },
  {
    "seasonNumber": 12,
    "episodeNumberInSeason": 17,
    "title": "Simpson Safari",
    "originalReleaseDate": "2001-04-01",
    "synopsis": "When the Simpsons run out of food thanks to a bag boy strike caused by Homer, the family finds an old box of animal crackers with a sweepstakes that sends the Simpsons to Africa. They go on a safari tour, but when Homer enrages a hippo, the family runs until they encounter a chimpanzee sanctuary run by a woman who is fending off poachers. However, they discover that the poachers are Greenpeace activists trying to save the chimps from the woman, who is using them to mine for diamonds."
  },
  {
    "seasonNumber": 12,
    "episodeNumberInSeason": 18,
    "title": "Trilogy of Error",
    "originalReleaseDate": "2001-04-29",
    "synopsis": "In a parody of Go and Run Lola Run, Marge severs Homer's thumb, and they try to get it reattached, but Marge abandons him and an explosion causes Lisa's robot's head to land next to Homer. Lisa tries to get to school with her grammar robot for the school science fair, and when Marge drives her after encountering her, they drive toward Bart emerging from a manhole. Bart and Milhouse help the police find who is smuggling fireworks. When Fat Tony and his henchmen discover them, they chase them through the sewers until the boys emerge near Marge and Lisa. Marge throws the robot at the mobsters, and their vernacular causes the robot to explode. To make a deal, the mobsters offer to reattach Homer's thumb as a presentation for Lisa's science fair project."
  },
  {
    "seasonNumber": 12,
    "episodeNumberInSeason": 19,
    "title": "I'm Goin' to Praiseland",
    "originalReleaseDate": "2001-05-06",
    "synopsis": "After finding a sketchbook belonging to his late wife Maude, Ned Flanders opens a Bible-themed amusement park to honor her memory. The townsfolk are not interested until a souvenir mask floats to the face of the statue of Maude, and park-goers begin having visions of Heaven. Ned discovers that the phenomenon is caused by a gas leak. He tries to confess it, but Homer said he has brought the town together. However, when two orphans attempt to light a candle near the statue, Ned saves them by tackling them, which the park-goers see as assault. This causes the park to shut down."
  },
  {
    "seasonNumber": 12,
    "episodeNumberInSeason": 20,
    "title": "Children of a Lesser Clod",
    "originalReleaseDate": "2001-05-13",
    "synopsis": "After injuring his knee during a basketball game, Homer begins taking care of the neighborhood kids to cure his boredom during his recovery from surgery. This prompts jealousy from Bart and Lisa, who feel that Homer is giving the kids the attention they never had. When Homer is given an award for this behavior, Bart and Lisa show a video of Homer's worst behavior, causing the parents to take the kids away from him. He apologizes to Bart and Lisa and promises to only care for his own children."
  },
  {
    "seasonNumber": 12,
    "episodeNumberInSeason": 21,
    "title": "Simpsons Tall Tales",
    "originalReleaseDate": "2001-05-20",
    "synopsis": "When Homer refuses to pay a five dollar airport tax to fly to Delaware, the family is forced to ride in a livestock car of a train instead. There they meet a singing hobo who tells three tall tales: *Homer, as Paul Bunyan, creates a blue ox named Babe and falls in love with a woman named Marge. *Lisa, as Connie Appleseed, a parody of Johnny Appleseed, travels the land planting apple seeds. *Bart, as Tom Sawyer with Nelson as Huckleberry Finn, gets into trouble, and they are executed when they are caught."
  }
]
