[
  {
    "seasonNumber": 24,
    "episodeNumberInSeason": 1,
    "title": "Moonshine River",
    "originalReleaseDate": "2012-09-30",
    "synopsis": "Bart discovers that, out of all the female interests he has had, the only one who continued to like him was Cletus Spuckler's daughter, who has run away. He learns that Mary went to New York City to be a writer for Saturday Night Live. The Simpson family goes to New York, where Bart and Mary are reunited. Cletus comes to bring Mary home, so Bart helps her escape. Meanwhile, Marge and Lisa explore the city and end up performing Shakespeare in Central Park. Going home, Cletus comforts Bart after letting her go. Guest star: Ken Burns, Zooey Deschanel, Sarah Michelle Gellar, Anne Hathaway, Maurice LaMarche, Don Pardo, Natalie Portman, Kevin Michael Richardson, Al Roker and Sarah Silverman"
  },
  {
    "seasonNumber": 24,
    "episodeNumberInSeason": 2,
    "title": "Treehouse of Horror XXIII",
    "originalReleaseDate": "2012-10-07",
    "synopsis": "A Halloween special: -An intro showing a botched Mayan sacrifice in the past causing the end of the world in 2012. -The Greatest Story Ever Holed: Professor Frink's Subatomic Supercollider releases a black hole that Lisa takes in as a pet – and the hole ends up sucking up all matter thanks to everyone using it as a waste disposal unit. -Unnormal Activity: In this parody of the Paranormal Activity movies, a collection of video clips shows demonic activity in the Simpsons' house late at night – which may have something to do with Marge's deal with the Devil she made years ago. -Bart & Homer's Excellent Adventure: In this light parody of the Back to the Future film franchise, Bart steals Professor Frink's time-traveling car and heads to 1974 so he can buy a Radioactive Man comic at cover price (25 cents instead of the present-day price of $200), but his visit into the past alters the future and leads Marge to marry her first prom date, Artie Ziff. Guest star: Jon Lovitz"
  },
  {
    "seasonNumber": 24,
    "episodeNumberInSeason": 3,
    "title": "Adventures in Baby-Getting",
    "originalReleaseDate": "2012-11-04",
    "synopsis": "A series of events involving a sinkhole and a new car purchase by the family leads Marge to a sudden realization that she wants to have another baby. Homer is reluctant and sterile. Marge learns he previously sold sperm to a fertility clinic, so they go there. She sees that Homer's sperm was used to produce many children, and is horrified by the results, so they stop their plan. Meanwhile, Bart and his friends spy on Lisa when she begins biking to points unknown on weekday afternoons. They learn that Lisa is learning to write in cursive, which is not taught in her regular school. Guest star: Jeff Gordon"
  },
  {
    "seasonNumber": 24,
    "episodeNumberInSeason": 4,
    "title": "Gone Abie Gone",
    "originalReleaseDate": "2012-11-11",
    "synopsis": "Homer gets a settlement for fast-food related injuries, and concerns over bad banks' behavior leads him to put the money into an online poker site, and Lisa ends up becoming a hard-core player to build her nest egg. However, she ends up losing all her money to Sideshow Bob, who is revealed to be Bart's online persona. Because they are underage, they are refunded only their original amount. Meanwhile, Grampa mysteriously disappears from the Springfield Retirement Castle, and leaves behind clues to parts of his life that the family never knew before, including his marriage to a black singer named Rita LaFleur. Homer learns that Grampa left her so that he could care for a young Homer at home. Guest star: Jennifer Tilly, Anika Noni Rose and Marvin Hamlisch"
  },
  {
    "seasonNumber": 24,
    "episodeNumberInSeason": 5,
    "title": "Penny-Wiseguys",
    "originalReleaseDate": "2012-11-18",
    "synopsis": "Homer is shocked to discover that his bowling teammate Dan Gillick is an accountant for Fat Tony and his mob. With Fat Tony away on jury duty, Dan is left in charge. Homer fights Dan to prevent him from murdering people until Tony returns. Dan is fired and opens an ear-piercing store because he likes using the gun. Meanwhile, Lisa adds insects to her vegetarian diet after passing out during a saxophone solo from iron deficiency, but immediately quits when the bugs guilt her in her dreams. She releases them, but they cause havoc around town. Guest star: Steve Carell, Joe Mantegna and Alex Trebek"
  },
  {
    "seasonNumber": 24,
    "episodeNumberInSeason": 6,
    "title": "A Tree Grows in Springfield",
    "originalReleaseDate": "2012-11-25",
    "synopsis": "Lisa wins a Mapple MyPad for Homer at a school raffle and Homer, who had been battling severe depression, becomes happy while using the MyPad, only to fall further into despair when he accidentally breaks the device. Flanders picks up Homer's spirits when he finds the word \"Hope\" written on The Simpsons' backyard tree in sap and everyone sees it as a miracle. Kent Brockman uses a thermal video to expose it as the work of somebody who wrote it. Homer is saddens, but it is revealed that a sleepwalking Homer who wrote it. A short story follows about the lives of the toys that exist in The Simpsons world. Guest star: Kelsey Grammer"
  },
  {
    "seasonNumber": 24,
    "episodeNumberInSeason": 7,
    "title": "The Day the Earth Stood Cool",
    "originalReleaseDate": "2012-12-09",
    "synopsis": "Homer wants a younger, hipper image, so he starts hanging out with Terrence and Emily, two hipsters from Portland. Homer and Lisa like them while Marge and Bart find the couple and their child to be irritating and pretentious. When the hipsters learn that Marge does not breast feed Maggie and when Homer learns they think he is a not genuine, the two families begin to feud. When the hipsters' compost pile starts a fire, the Simpsons use Maggie's baby formula to put it out. They forgive each other, but when Springfield is labelled cool, the hipsters immediately leave. Guest star: Fred Armisen, Carrie Brownstein, Patton Oswalt, and The Decemberists"
  },
  {
    "seasonNumber": 24,
    "episodeNumberInSeason": 8,
    "title": "To Cur with Love",
    "originalReleaseDate": "2012-12-16",
    "synopsis": "When a fire at the retirement home forces Grampa to move home with the Simpsons, Homer throws out his back on moving day and decides to stay home to recover. While enjoying his time alone, Homer gets distracted by a tablet game called \"VillageVille\" and loses the family dog, Santa's Little Helper. Once they find him, Homer says he doesn't care about dogs. Grampa tells them the story of young Homer's dog Bongo. When it attacked Mr. Burns to defend Homer, Bongo is sent away to a farm while Grampa is forced to work for Burns. Grampa then shows Homer a photo of an older Bongo resting on young Homer's shirt, showing that Bongo remembers him."
  },
  {
    "seasonNumber": 24,
    "episodeNumberInSeason": 9,
    "title": "Homer Goes to Prep School",
    "originalReleaseDate": "2013-01-06",
    "synopsis": "After a lockdown at a kids' fun center, Homer is traumatized over seeing everyone panic in the chaos. He meets a doomsday prepper who introduces him to some Springfield residents who are preparing for the day when society crumbles from a disaster. When he neglects his job, the nuclear power plant causes an electromagnetic pulse and blacks out the town. Homer takes his family to the preppers' camp. They refuse to share their resources with the rest of the town, so Homer steals some. He brings the supplies into town but sees that the town has already recovered, which confuses the preppers. Guest star: Tom Waits"
  },
  {
    "seasonNumber": 24,
    "episodeNumberInSeason": 10,
    "title": "A Test Before Trying",
    "originalReleaseDate": "2013-01-13",
    "synopsis": "Springfield Elementary School does badly on a state test and it looks like the school will be permanently shut down. Lisa learns that Bart did not take the test. He does not care until he has a nightmare where Springfield is declared the stupidest town in the country. He takes the test and barely passes, which saves the school. Meanwhile, Homer finds a discarded parking meter. He sets it up to trick people into paying, but Chief Wiggum catches him. As he flees, the meter is destroyed, and Marge forces him to return the money. Guest star: Valerie Harper Note: This episode was dedicated to Huell Howser."
  },
  {
    "seasonNumber": 24,
    "episodeNumberInSeason": 11,
    "title": "The Changing of the Guardian",
    "originalReleaseDate": "2013-01-27",
    "synopsis": "After surviving a tornado landing in Springfield, Marge and Homer seek out guardians for the kids in case they end up getting killed. They first turn to friends and family, but on one wants the job. They find a childless couple, Mav and Portia, to agree but they want to care for the children on the weekends. Homer and Marge learn that they are trying to integrate them into their family. When Mav and Portia are confronted, they learn that the children prefer Homer and Marge. Guest star: Danny DeVito and Rashida Jones"
  },
  {
    "seasonNumber": 24,
    "episodeNumberInSeason": 12,
    "title": "Love Is a Many-Splintered Thing",
    "originalReleaseDate": "2013-02-10",
    "synopsis": "Mary Spuckler has returned to Springfield and starts a relationship with Bart. However, he neglects her, and Mary ends things with him after a while. Homer and Marge argue and when Bart takes Homer's side, they are both kicked out of the house. Moving to an apartment, they realize that they must win back Marge and Mary. They sing a song to them, and Homer wins back Marge. Mary, however, has moved on with someone else. Later, Mary's social media status changes from \"Married\" to \"Single,\" giving Bart hope. Guest star: Benedict Cumberbatch, Robert Caro, Zooey Deschanel and Max Weinberg"
  },
  {
    "seasonNumber": 24,
    "episodeNumberInSeason": 13,
    "title": "Hardly Kirk-ing",
    "originalReleaseDate": "2013-02-17",
    "synopsis": "Bart gives Milhouse a haircut to get the epoxy out of his hair, and Milhouse's new Kirk-mirroring appearance leads the kids to enjoy the adult life for a while. Lisa wants to go downtown, so Milhouse, Bart, and Lisa go together. They go to a condo presentation for a free breakfast, and the saleswoman flirts with Milhouse. Meanwhile, Marge tries to wean Maggie off a series of DVDs for toddlers that were pulled for stunting children's developmental growth, and Homer gets addicted to \"find the hidden object\" puzzle books. When they notice Bart and Lisa are missing, they use Homer's new skill to find them. Guest star: Kevin Michael Richardson"
  },
  {
    "seasonNumber": 24,
    "episodeNumberInSeason": 14,
    "title": "Gorgeous Grampa",
    "originalReleaseDate": "2013-03-03",
    "synopsis": "Homer buys a storage locker after watching a reality show, only to discover that it is Grampa's. He suspects that his dad was secretly gay, but it turns out Grampa was a superstar pro wrestler named Glamorous Godfrey whom wrestling fans hated. Mr. Burns, who idolized him, convinces Grampa to start wrestling again. Bart joins Grampa in wrestling, worrying Homer and Marge. When he sees Bart taunting the crowd, Grampa adopts a new persona to stop Bart. Burns is enraged, but Grampa and Bart team up to defeat him in the ring."
  },
  {
    "seasonNumber": 24,
    "episodeNumberInSeason": 15,
    "title": "Black Eyed, Please",
    "originalReleaseDate": "2013-03-10",
    "synopsis": "Flanders tries to atone for punching Homer in the eye after Flanders' parents take a liking to him instead of their own son. He asks Homer to punch him, but he refuses, saying that he is now better than Flanders. This prompts him to punch Homer's other eye. Meanwhile, a new substitute teacher named Miss Cantwell is hired while Miss Hoover is out with severe depression. Miss Cantwell likes everyone except Lisa. Homer says he will accept Ned's apology if Edna helps Lisa. She sends Bart to Miss Cantwell's class, and he films her making insulting remarks about Lisa. Apparently, Miss Cantwell thought Lisa was pretty and popular, so she gave her a hard time because she was jealous. Delighted, Lisa declines to correct her. Guest star: Richard Dawkins and Tina Fey"
  },
  {
    "seasonNumber": 24,
    "episodeNumberInSeason": 16,
    "title": "Dark Knight Court",
    "originalReleaseDate": "2013-03-17",
    "synopsis": "The Springfield Elementary School band marching in the Easter parade accidentally ruin the watchers' clothes. Bart is blamed, but he denies it. Lisa proposes holding a trial, but it does not go well. Meanwhile, Mr. Burns fulfills his dream of becoming a superhero, and Smithers pays the townspeople to be supervillains for Fruit Bat Man to defeat. Lisa hires Burns to help Bart. Lisa notices that Groundskeeper Willie's kilt is barely stained. He confesses to the prank but destroys the evidence. Burns captures Willie and turns him in before Bart is declared guilty. Guest star: Janet Reno"
  },
  {
    "seasonNumber": 24,
    "episodeNumberInSeason": 17,
    "title": "What Animated Women Want",
    "originalReleaseDate": "2013-04-14",
    "synopsis": "Homer and Marge are having a date at a restaurant, but Homer is only interested in the food. This angers Marge, and Homer fails to win her back. Moe suggests buying sex toys to seduce her. Marge is confused, and Homer injures himself with one of the toys. At the hospital, they reconcile when Marge realizes that Homer will always try to make things up with her. Meanwhile, Lisa becomes interested in Milhouse after he refuses to share his cupcake. Milhouse is not comfortable acting this way, but a school counselor says his normal personality is boring. Later, he apologizes to Lisa for his behavior, which makes him feel better. Guest star: Wanda Sykes and George Takei"
  },
  {
    "seasonNumber": 24,
    "episodeNumberInSeason": 18,
    "title": "Pulpit Friction",
    "originalReleaseDate": "2013-04-28",
    "synopsis": "Reverend Lovejoy leaves his pulpit after a charismatic new minister usurps him. He makes Homer the deacon. Bart, missing his father, and Ned find Lovejoy working as a hot tub salesman, and he refuses to return. Bart induces a plague of frogs that the minister and Homer cannot contain. Lovejoy is able to stop it and takes back his position. Meanwhile, Marge's wedding dress has been switched with one of Krusty's costumes. Lisa and Marge track the dress to a couple who bought it to use as the bride's wedding dress. Guest star: Edward Norton"
  },
  {
    "seasonNumber": 24,
    "episodeNumberInSeason": 19,
    "title": "Whiskey Business",
    "originalReleaseDate": "2013-05-05",
    "synopsis": "Homer and Marge help a suicidal Moe get a new lease on life and Moe's homemade alcohol pings the radar of venture capitalists. They become Moe's business partners. Just before the company goes public on the stock exchange, Moe's suit is destroyed. Moe goes to the stock exchange in his normal clothes, which disgusts the traders, leaving the company worthless. Meanwhile, Grandpa gets hurt at home and finds Bart takes better care of him than the nursing home staff does. Grampa continues faking an injury, so Bart keeps caring for him until he finds out. Grampa apologizes and explains why he was faking it. In the meantime, Bart sends Lisa to a jazz club where a Bleeding Gums Murphy hologram performs. She is angered, but learns it is the next step in the entertainment industry, including commercials featuring deceased celebrities. Guest star: Tony Bennett, Kevin Michael Richardson, Sonny Rollins and Ron Taylor"
  },
  {
    "seasonNumber": 24,
    "episodeNumberInSeason": 20,
    "title": "The Fabulous Faker Boy",
    "originalReleaseDate": "2013-05-12",
    "synopsis": "Bart's interest in piano lessons surges when he sees the instructor is a beautiful young woman. She agrees in exchange for Marge teaching her father how to drive. Bart quickly improves, so the instructor gains more students, causing her to neglect Bart. This causes Bart to confess that his improvement was a deception. This angers Marge, but the father tells her to forgive Bart, since the father only got his driver's license by bribing Patty and Selma. Meanwhile, Homer loses the final two original hairs on his head. He tries to hide it, but learns to be confident. When he shows Marge, she comforts him, causing the hairs to grow back. Guest star: Justin Bieber, Bill Hader, Jane Krakowski and Patrick Stewart"
  },
  {
    "seasonNumber": 24,
    "episodeNumberInSeason": 21,
    "title": "The Saga of Carl",
    "originalReleaseDate": "2013-05-19",
    "synopsis": "Homer, Lenny, Carl, and Moe team up to buy a winning lottery ticket. Carl goes to cash in the ticket but disappears. They learn that Carl fled to Iceland, the ancestral home of his adoptive parents. They track him down, and Carl explains that he used the money to buy a paper that clears his ancient family's name. Lenny is hurt that Carl did not tell them because he does not consider them friends. They translate the paper, which says that his ancestors were collaborators with the barbarians, not just cowards, which makes things worse. In a public square, Homer, Lenny, and Moe explain how Carl has been a good friend. The people are touched, and they forgive Carl's family. Carl accepts the group as his friends. Guest star: Sigur Rós"
  },
  {
    "seasonNumber": 24,
    "episodeNumberInSeason": 22,
    "title": "Dangers on a Train",
    "originalReleaseDate": "2013-05-19",
    "synopsis": "Marge stumbles upon a website for married women to arrange affairs and meets a man named Ben, who falls for Marge after the two bond over a Downton Abbey-esque period drama. Meanwhile, Homer takes home a steam train that used to belong to Springfield's high-end, outside mall and recruits his friends and Reverend Lovejoy to fix it for his wedding anniversary. On that day, Homer sends Marge away to set up the train at home. She returns home impressed, but Ben's wife Ramona arrives to confront Marge. Trusting Marge, Homer says that she does not need to explain anything about Ben because they are in a healthy relationship. Guest star: Lisa Lampanelli and Seth MacFarlane"
  }
]
