[
  {
    "seasonNumber": 23,
    "episodeNumberInSeason": 1,
    "title": "The Falcon and the D'ohman",
    "originalReleaseDate": "2011-09-25",
    "synopsis": "Homer befriends the nuclear plant's newest hire, a security guard who was a CIA agent. He is haunted by past missions and is fired after attacking Mr. Burns. A Ukrainian gang learns of the agent's location and kidnaps Homer to get to him. The agent rescues Homer, and kills them. To thank him, Marge gets him a new job at the DMV. Ned Flanders and Edna Krabappel are shown to still be dating each other. Guest stars: Tom Colicchio, Kevin Michael Richardson and Kiefer Sutherland"
  },
  {
    "seasonNumber": 23,
    "episodeNumberInSeason": 2,
    "title": "Bart Stops to Smell the Roosevelts",
    "originalReleaseDate": "2011-10-02",
    "synopsis": "Principal Skinner challenges Superintendent Chalmers to get Bart and his classmates to be excited about learning after Bart's latest pranks, and he finds it in the form of teaching Bart about the life and times of Theodore Roosevelt. During an unauthorized field trip, Nelson is injured, so Chalmers is fired. Bart and his classmates hold the school hostage and demand Chalmers be reinstated. In the standoff, the police accidentally shoot the state comptroller, and the lawsuit pays for Nelson's injury, resulting in Chalmers' return. Guest stars: John Kricfalusi (credited for animating this episode's couch gag) and Theodore Roosevelt (through archival footage and audio recordings)"
  },
  {
    "seasonNumber": 23,
    "episodeNumberInSeason": 3,
    "title": "Treehouse of Horror XXII",
    "originalReleaseDate": "2011-10-30",
    "synopsis": "In this year's introduction, Homer is charged by Marge to dispose of the candies in a canyon, but he falls and find that his arm is pinned under a boulder which stop him to be able to grab the candies, so he makes a 911 call but when he hear that help will only come in 20 minutes, he chooses to bite his arm off to find that the candies has been replaced by vegetables. In \"The Diving Bell and the Butterball,\" Homer finds himself paralyzed by a spider bite and discovers a new, smelly way to communicate. Next, Flanders gets a call from God to rid the world of sinners by murdering them in '\"Dial D for Diddly.\" Finally, Bart and Milhouse must infiltrate an alien planet by posing as the natives in the Avatar parody, \"In the Na'vi.\" Guest stars: Jackie Mason and Aron Ralston as the 911 operator."
  },
  {
    "seasonNumber": 23,
    "episodeNumberInSeason": 4,
    "title": "Replaceable You",
    "originalReleaseDate": "2011-11-06",
    "synopsis": "Homer gets a new assistant named Roz who takes his job by reporting on his behavior. Ned encountered Roz before and says she does not like physical contact. He manipulates Mr. Burns into hugging her, and she attacks him. She is fired and Homer gets his job back. Meanwhile, Bart and Martin create a robot seal that becomes a hit with the elderly crowd. When the funeral industry learns that the seals make them healthier, they tamper with the seals to make the elderly miserable. Bart and Martin have Professor Frink help them return the seals to their previous state. Guest star: Jane Lynch"
  },
  {
    "seasonNumber": 23,
    "episodeNumberInSeason": 5,
    "title": "The Food Wife",
    "originalReleaseDate": "2011-11-13",
    "synopsis": "Tired of doing \"mom\" things and being much less fun for the kids than Homer, Marge takes the kids out to an Ethiopian restaurant and enjoys the food so much that she starts a food blog with Bart and Lisa, which hurts Homer's feelings. They are invited to a new restaurant. Fearing Homer will be more popular if he comes, Marge sends him to the wrong address, which is a meth lab. Marge feels guilty and rescues Homer after he is caught in a shootout with the police. Guest stars: Gordon Ramsay, Mario Batali, Anthony Bourdain, Tim Heidecker and Eric Wareheim"
  },
  {
    "seasonNumber": 23,
    "episodeNumberInSeason": 6,
    "title": "The Book Job",
    "originalReleaseDate": "2011-11-20",
    "synopsis": "When Lisa discovers that her favorite book is ghost-written by a group of publishers with an actress as the \"author,\" Homer and Bart are inspired to do the same by getting a group of people to write a fantasy novel about trolls in a prestigious academy. Lisa struggles to write her own book and agrees to be the fake author of Homer's group's book. When the publisher changes the subject from trolls to vampires, they try to stop them by infiltrating the printers. However, Lisa instead changes the subject back to trolls and allows the book to be published. Moreover, she unknowingly changes the author to someone else, leaving her without credit. Guest stars: Andy García and Neil Gaiman"
  },
  {
    "seasonNumber": 23,
    "episodeNumberInSeason": 7,
    "title": "The Man in the Blue Flannel Pants",
    "originalReleaseDate": "2011-11-27",
    "synopsis": "Homer becomes Mr. Burns' accountant executive after a successful launch party for Absolut Krusty. Robert Marlow, a seasoned account veteran, takes Homer under his wing and shows Homer what the high life is like in the corner office, but long hours at the office become the norm. When Marge forces him to go on a vacation with his family, he also takes his co-workers there as a company retreat. When he is discovered and is forced to choose, he chooses his family and is sent back to his old job. Guest stars: Kevin Michael Richardson, John Slattery and Matthew Weiner"
  },
  {
    "seasonNumber": 23,
    "episodeNumberInSeason": 8,
    "title": "The Ten-Per-Cent Solution",
    "originalReleaseDate": "2011-12-04",
    "synopsis": "Krusty the Clown's show gets canceled because of its dated references. Krusty reunites with his original agent and bitter former lover Annie Dubinsky. Krusty start performing a show for adults, and his success leads him to a show on cable television. Krusty's retro comedy show reboot is deemed a critical success, but executives tell Krusty to fire Annie for her behavior. He refuses and quits in solidarity. Guest stars: Kevin Dillon, Janeane Garofalo, Jackie Mason and Joan Rivers"
  },
  {
    "seasonNumber": 23,
    "episodeNumberInSeason": 9,
    "title": "Holidays of Future Passed",
    "originalReleaseDate": "2011-12-11",
    "synopsis": "The latest \"look-into-the-future\" episode sees Bart as a deadbeat dad living in Springfield Elementary (which is now an apartment complex instead of a school) and trying to be a good dad to the children he had with Jenda from \"Future-Drama\". Meanwhile, a pregnant, unwed Maggie (who is now a pop singing superstar) goes into labor while on her way to family dinner and Lisa tries to find a common bond with her rebellious teenage daughter, Zia."
  },
  {
    "seasonNumber": 23,
    "episodeNumberInSeason": 10,
    "title": "Politically Inept, with Homer Simpson",
    "originalReleaseDate": "2012-01-08",
    "synopsis": "Video footage of Homer ranting about being harassed by TSA agents and forced to sit on a grounded plane for seven hours (due to airport incompetence) goes viral and lands Homer on cable television as a political pundit with his own show. But when he stirs up mixed emotions with his planned endorsement of the next GOP Presidential candidate, Marge and Lisa worry that Homer's opinion and influence might be more powerful than he realizes. Guest stars: Ted Nugent and Dana Gould"
  },
  {
    "seasonNumber": 23,
    "episodeNumberInSeason": 11,
    "title": "The D'oh-cial Network",
    "originalReleaseDate": "2012-01-15",
    "synopsis": "Lisa wants to spend time with her schoolmates but they decline the offer. She wants more friends, so she starts her own social network website called SpringFace to gets more friends. The service turns everyone into an online addict, which causes destruction when they are distracted. The court forces her to shut it down, but she finds some kids who invite her to play with them. A short story follows, showing Bart and Milhouse covering the school in toilet paper and its consequences. Guest stars: Armie Hammer, David Letterman"
  },
  {
    "seasonNumber": 23,
    "episodeNumberInSeason": 12,
    "title": "Moe Goes from Rags to Riches",
    "originalReleaseDate": "2012-01-29",
    "synopsis": "Moe's bar rag tells the story of how it went from being part of a medieval tapestry to being Moe's most used prop. Meanwhile, Milhouse is upset with Bart after he compares Milhouse to Moe's bar rag. He asks for forgiveness. Bart has Drederick Tatum punch him as a sign of good faith, and Milhouse forgives him. Later, Moe's rag is stolen, but he finds that Marge has cleaned it for him. He sees that the Simpsons are his friends, and he gives the rag to Santa's Little Helper. Guest star: Jeremy Irons"
  },
  {
    "seasonNumber": 23,
    "episodeNumberInSeason": 13,
    "title": "The Daughter Also Rises",
    "originalReleaseDate": "2012-02-12",
    "synopsis": "Lisa falls in love with Nick, an intellectual romantic. Marge tells her not to spend too much time with him, but Grampa helps them be together. Marge goes after them, and they break up when they cannot commit to each other. Marge says that she will always love Lisa. Meanwhile, Bart and Milhouse team up with the gang from MythCrackers to debunk some urban schoolyard legends. However, when they get bored of the myths, they make up some new ones. Guest stars: Michael Cera, Jamie Hyneman and Adam Savage"
  },
  {
    "seasonNumber": 23,
    "episodeNumberInSeason": 14,
    "title": "At Long Last Leave",
    "originalReleaseDate": "2012-02-19",
    "synopsis": "After hiding in their basement, the Simpsons stumble upon a secret town meeting where everyone is voting to throw them out of Springfield. As a result, they find themselves in an off-the-grid community, and when Homer and Marge try to sneak back into Springfield, they are met with hostility from their former friends and neighbors and begin to appreciate their new and more accepting home. They leave after Marge reprimands them. Feeling guilty, the townspeople gradually move to the new community and eventually declare it the new Springfield. Guest stars: Julian Assange, Allison Krauss and Union Station, Kelsey Grammer and Jackie Mason * This is the show's 500th episode."
  },
  {
    "seasonNumber": 23,
    "episodeNumberInSeason": 15,
    "title": "Exit Through the Kwik-E-Mart",
    "originalReleaseDate": "2012-03-04",
    "synopsis": "After being forced to spend some time in a rabbit cage for a prank he didn't commit, Bart exacts revenge by spray painting unflattering caricatures of Homer all over town, which become a sensation with real-life graffiti artists Shepard Fairey, Ron English, Kenny Scharf, and Robbie Conal. They offer Bart his own art show. At the show, Bart is arrested because the artists were working undercover to identify Bart. He is punished by being put back in the rabbit cage. Meanwhile, Apu's Kwik-E-Mart is in danger of shutting down when it faces competition from a health-food supermarket. As it is about to shut down, it is saved when they learn that the supermarket was selling improper meat. Guest stars: Shepard Fairey, Ron English, Kenny Scharf and Robbie Conal"
  },
  {
    "seasonNumber": 23,
    "episodeNumberInSeason": 16,
    "title": "How I Wet Your Mother",
    "originalReleaseDate": "2012-03-11",
    "synopsis": "In this Simpsonized parody of Inception, Homer develops a bed-wetting problem, which he thinks is karmic payback for getting everyone in trouble for stealing office supplies at work, but a trip through Homer's dreams reveals that Homer's embarrassing problem is connected with a childhood memory. As a child, Grampa took Homer fishing, but they returned home with no fish. Shortly after, Mona left them, and Homer believed that the lack of fish caused her to leave. A dream of Mona assures Homer that he is not to blame, and Homer stops his bed wetting. Guest stars: Glenn Close and David Byrne"
  },
  {
    "seasonNumber": 23,
    "episodeNumberInSeason": 17,
    "title": "Them, Robot",
    "originalReleaseDate": "2012-03-18",
    "synopsis": "To get out of paying for employee drug tests, Mr. Burns fires all of his employees except for Homer, who is kept on as a scapegoat and replaces them with robot workers. Bored, Homer gives them personalities and learns that they must protect humans, including preventing Homer from drinking beer. As a result, Homer removes this impediment, which causes them to try to kill him. He asks Mr. Burns for help, but he is also put in danger. They are saved by the former plant employees, and Mr. Burns rehires them. Guest star: Brent Spiner"
  },
  {
    "seasonNumber": 23,
    "episodeNumberInSeason": 18,
    "title": "Beware My Cheating Bart",
    "originalReleaseDate": "2012-04-15",
    "synopsis": "Bart is forced to stay with Jimbo's girlfriend, Shauna, as she watches a movie. They hang out afterwards, and after he helps her, she rewards him by showing him her breasts. They decide to have a secret relationship but Jimbo figures it out. Shauna chooses to break up with both of them, and Bart is punished by Jimbo. Meanwhile, Homer buys a state-of-the-art treadmill that gets wireless TV and uses the treadmill to binge-watch a \"Lost\"-style show rather than exercise. Annoyed with his theories about the show, Marge tells him all the answers, which angers Homer. She later makes it up to him. Guest star: Kevin Michael Richardson with a special couch gag done by Bill Plympton"
  },
  {
    "seasonNumber": 23,
    "episodeNumberInSeason": 19,
    "title": "A Totally Fun Thing Bart Will Never Do Again",
    "originalReleaseDate": "2012-04-29",
    "synopsis": "To alleviate his boredom with life, Bart begs the family to go on a cruise trip, and the Simpsons sell their most prized possessions to pay for it. But when Bart realizes the trip only lasts a week and that his life will be nothing after that, he stages an announcement that a virus has spread on the mainland, and they must remain at sea. Conditions worsen as they are stranded until Marge and Lisa learn the truth. After telling the passengers, the Simpsons are abandoned in Antarctica. As they go to a research station for help, the family is angry at Bart, although he says their lives were better on the ship. They forgive him after they play on a slice made of ice. Guest star: Treat Williams and Steve Coogan"
  },
  {
    "seasonNumber": 23,
    "episodeNumberInSeason": 20,
    "title": "The Spy Who Learned Me",
    "originalReleaseDate": "2012-05-06",
    "synopsis": "After a disastrous date night at the movies, Homer suffers a head injury the next day at work and, during his eight weeks off to recover, sees visions of a super-suave superspy named Stradivarius Cain. He gives Homer lessons on being the husband of Marge's dreams. When Marge learns that Homer has not been going to work, Homer tells her the truth, and Marge forgives him. Meanwhile, Nelson uses a cellular phone to take lunch money from students. Bart gets revenge on Nelson by giving him coupons for Krusty burgers, which make him fat. Lisa helps Nelson get back into better shape because she cares for him. Guest stars: Bryan Cranston and Eric Idle"
  },
  {
    "seasonNumber": 23,
    "episodeNumberInSeason": 21,
    "title": "Ned 'n' Edna's Blend Agenda",
    "originalReleaseDate": "2012-05-13",
    "synopsis": "Ned Flanders is injured as the town watches a play. Edna Krabappel wants to go with him to the hospital, and the town learns that they eloped after months of dating. Later, Edna sends Rod and Todd to public school because of their poor education at Christian school. Seeing Rod and Todd's personalities change and not trusting Edna's intentions, Ned stays with the Simpsons. He sees Homer and Marge fight and immediately make up. He sees that couples will always have disagreements and asks Edna for forgiveness."
  },
  {
    "seasonNumber": 23,
    "episodeNumberInSeason": 22,
    "title": "Lisa Goes Gaga",
    "originalReleaseDate": "2012-05-20",
    "synopsis": "Lisa is voted as the least popular student at school. She writes an anonymous blog to make herself popular. When Bart finds out, he outs her, which lowers her status even more. Lady Gaga is passing through Springfield and tries to cheer her up. Lisa ends up yelling at her, and she learns that she was holding in her anger. Lisa and Lady Gaga sing together, and they teach the townspeople to be true to themselves. Guest star: Lady Gaga"
  }
]
