[
  {
    "seasonNumber": 4,
    "episodeNumberInSeason": 1,
    "title": "Kamp Krusty",
    "originalReleaseDate": "1992-09-24",
    "synopsis": "Bart and Lisa go to Kamp Krusty for the summer in order to have a break from their parents and meet Krusty the Clown. However, their promises of a fun summer at Kamp Krusty are broken when the director of the camp, Mr. Black, is revealed to be a ferocious accountant and that the camp counselors are the three teenage bullies from school. Meanwhile, Homer is rejuvenated with the kids gone and even begins to regain his hair and lose weight. All of the kids at the camp are treated horribly and Bart survives by clinging to the promise that Krusty himself will soon arrive. However, when this does not happen, Bart leads the campers into a rebellion and they eventually take over the camp. Homer sees a news report about this and immediately loses his hair and regains his lost weight. The real Krusty arrives at the camp and decides to make it up to the kids by taking them to Tijuana, Mexico."
  },
  {
    "seasonNumber": 4,
    "episodeNumberInSeason": 2,
    "title": "A Streetcar Named Marge",
    "originalReleaseDate": "1992-10-01",
    "synopsis": "Marge is cast in a musical production of A Streetcar Named Desire as Blanche DuBois after the play director sees Marge's deep-seated depression when dealing with an uncaring Homer. She struggles with a scene where she has to shove a glass bottle into the brutish Stanley Kowalski (who is played by Ned Flanders), but manages to get over it by imagining Homer as Stanley. Marge begins to become extremely angry with Homer as she sees parallels between him and Stanley. At the end of the musical, Marge believes Homer does not pay attention to her and confronts him with hostility. However, Homer explains that he was genuinely moved by Blanche's situation. Marge realizes that Homer really did watch the musical, and the two happily leave the theater with his saddened expression left behind. Meanwhile, Maggie is sent to the Ayn Rand School for Tots where she attempts to retrieve her pacifier from a strict daycare attendant. Guest star: Jon Lovitz Note: This is the last episode to be animated by Klasky Csupo. Starting with the next episode until the season 28 episode \"Havana Wild Weekend\", the series was animated by Film Roman."
  },
  {
    "seasonNumber": 4,
    "episodeNumberInSeason": 3,
    "title": "Homer the Heretic",
    "originalReleaseDate": "1992-10-08",
    "synopsis": "While skipping Sunday's church services, Homer discovers the joy of staying home and having the house all to himself while Marge and the kids experience a rambling sermon from Reverend Lovejoy. Homer decides to start his very own religion customized for himself, despite Marge's continuing objections for giving up his faith. Marge, Reverend Lovejoy and Ned Flanders all try to convert Homer back to Christianity but fail. The next Sunday morning, Homer once again stays at home, but accidentally sets the house on fire and is rescued by Flanders. After the blaze is extinguished, Reverend Lovejoy suggests that God was working in the hearts of Homer's friends, despite their different faiths and this convinces Homer to give church another try. Note: First appearance of God."
  },
  {
    "seasonNumber": 4,
    "episodeNumberInSeason": 4,
    "title": "Lisa the Beauty Queen",
    "originalReleaseDate": "1992-10-15",
    "synopsis": "Lisa's self-esteem breaks off after she sees a crude drawing of herself at Springfield Elementary's fair. When Homer wins the Duff Beer raffle and a ticket to ride on the Duff Blimp, he sacrifices the ticket for the money in order to get Lisa entered into a beauty pageant. Although originally reluctant to enter, she competes and finishes second. However, after the winner is hospitalized, Lisa is declared the new Little Miss Springfield. She is forced to become a shill for Laramie Cigarettes and after seeing children smoking, decides to fight back by protesting against the dangers of cigarettes, and also vows to target the corruption of Mayor Quimby. Quimby and the Laramie officials meet and use a technicality to dethrone Lisa. Homer is upset that Lisa lost her title, but Lisa reminds him that he originally entered her in the contest to help her self-esteem, which it has, and she thanks him."
  },
  {
    "seasonNumber": 4,
    "episodeNumberInSeason": 5,
    "title": "Treehouse of Horror III",
    "originalReleaseDate": "1992-10-29",
    "synopsis": "In the third Treehouse of Horror episode, the Simpson family holds a Halloween party and several family members tell scary stories: * \"Clown Without Pity\": In Lisa's story, Homer buys Bart a Krusty doll which turns out to be evil and tries to kill Homer. * \"King Homer\": In Grampa's story, a King Kong parody, Mr. Burns decides to hire Marge Bouvier to trap an ape who looks like Homer. * \"Dial \"Z\" for Zombie\": In Bart's story, Bart discovers an occult book and tries to use one of the spells to bring back the family cat, but instead, he accidentally summons a horde of zombies."
  },
  {
    "seasonNumber": 4,
    "episodeNumberInSeason": 6,
    "title": "The Movie",
    "originalReleaseDate": "1992-11-03",
    "synopsis": "At Springfield Elementary's Parent Teacher night, Mrs. Krabappel tells Homer and Marge about Bart's behavior. Wanting Bart to one day become Chief Justice of the Supreme Court, Homer decides to punish Bart. However, he never makes his punishments stick and Bart continues on his destructive path. Marge confronts Homer and he agrees that next time he will make his punishment stick. Meanwhile, Bart finds out that Itchy & Scratchy: The Movie is about to hit theaters and immediately buys a ticket. However, when Bart one day forgets to watch Maggie, Homer bans Bart from ever seeing the movie. Bart tries everything to see the movie, but Homer refuses to budge and after the movie closes, Homer declares that one day Bart will thank him. In a flashforward forty years into the future, Homer and Bart, now Chief Justice of the Supreme Court, decide to watch the movie together. Note: First appearance of Bumblebee Man."
  },
  {
    "seasonNumber": 4,
    "episodeNumberInSeason": 7,
    "title": "Marge Gets a Job",
    "originalReleaseDate": "1992-11-05",
    "synopsis": "The Simpsons' house begins sinking into the ground. Marge decides to earn extra money to repair the foundation by working at the Springfield Nuclear Power Plant and Homer is forced to work alongside his wife. However, Mr. Burns falls deeply in love with her and begins to seduce her. However, Marge resists and Burns fires her after discovering she is married. Homer stands up for Marge and an impressed Mr. Burns treats them to a free Tom Jones concert. Meanwhile, Bart continually fakes sick to get out of taking a test."
  },
  {
    "seasonNumber": 4,
    "episodeNumberInSeason": 8,
    "title": "New Kid on the Block",
    "originalReleaseDate": "1992-11-12",
    "synopsis": "The Simpsons' next door neighbors move and are replaced by a single mother, Ruth Powers and her daughter Laura. Laura becomes the object of Bart's affection but Bart becomes heart broken after learning that her boyfriend is Jimbo Jones. Meanwhile, Homer wages war against the Sea Captain's seafood restaurant The Frying Dutchman, for falsely advertising their \"all-you-can-eat\" buffet. Guest star: Sara Gilbert Note: First appearances of The Sea Captain and Ruth Powers."
  },
  {
    "seasonNumber": 4,
    "episodeNumberInSeason": 9,
    "title": "Mr. Plow",
    "originalReleaseDate": "1992-11-19",
    "synopsis": "After demolishing both his and Marge's family cars during a snowstorm, Homer buys a snowplow and starts a business plowing driveways. He calls his business \"Mr. Plow\" and becomes a huge success. Barney Gumble, inspired by Homer decides to start his own rival company and becomes Springfield's new favorite snow plower. Homer tricks Barney into plowing the dangerous Widow's Peak. Barney does so, but gets trapped in an avalanche and after seeing a news report about it, Homer rushes to save him and the two decide to work together, but God melts all of the snow. Guest stars: Adam West and Linda Ronstadt"
  },
  {
    "seasonNumber": 4,
    "episodeNumberInSeason": 10,
    "title": "Lisa's First Word",
    "originalReleaseDate": "1992-12-03",
    "synopsis": "While attempting to get Maggie to say her first word, Marge tells the story of Lisa's first word. In 1983, Marge, Homer and Bart are living in the Lower East Springfield district and Marge announces that she is pregnant. She and Homer decide to move into a house to support their bigger family and move into their present day home. Lisa is born during the 1984 Summer Olympics and Bart immediately becomes jealous of her. He tries several mean things to her, but only manages to get himself in trouble. Bart decides to run away, but Lisa says her first word: \"Bart\". Bart discovers that Lisa loves him and embraces her as his sister. In the present day, Homer puts Maggie to bed, saying he wishes that she will never talk. Once he leaves, Maggie utters her first word: \"daddy\"."
  },
  {
    "seasonNumber": 4,
    "episodeNumberInSeason": 11,
    "title": "Homer's Triple Bypass",
    "originalReleaseDate": "1992-12-17",
    "synopsis": "Due to his many years of eating unhealthy foods, Homer suffers a heart attack, and needs to have a triple bypass surgery. He has to choose between the $40,000 operation set by Dr. Julius Hibbert, which he cannot afford or the $129.95 operation by Dr. Nick Riviera. When he chooses the cheaper surgery, Homer begins to accept that he may die. However, the operation goes well and with a little help from Lisa, Dr. Nick saves Homer's life."
  },
  {
    "seasonNumber": 4,
    "episodeNumberInSeason": 12,
    "title": "Marge vs. the Monorail",
    "originalReleaseDate": "1993-01-14",
    "synopsis": "After Mr. Burns is caught storing his excess nuclear waste inside Springfield Park's trees, he is ordered to pay the town $3 million. The town is originally set to agree to fix Main Street, but the charismatic Lyle Lanley interrupts and convinces the town to use the money to buy one of his monorails. The town embraces the suggestion and Homer is hired as the conductor. The only person remaining not so pleased about the whole situation is Marge, who discovers suspicious evidence and visits a town that had previously purchased one of Lanley's monorails. She discovers that Lanley is indeed a con man and rushes back to town. However, she arrives too late and the monorail has begun to operate, but Homer is then advised to use an anchor to stop the train, thus saving the passengers. Guest star: Leonard Nimoy"
  },
  {
    "seasonNumber": 4,
    "episodeNumberInSeason": 13,
    "title": "Selma's Choice",
    "originalReleaseDate": "1993-01-21",
    "synopsis": "Marge's Great Aunt Gladys Bouvier dies and the Simpsons, Patty, and Selma attend her funeral. During the reading of her video will, Gladys tells Patty and Selma not to die lonely and miserable like she did. Though Patty does not care, Selma decides that she wants a baby. Meanwhile, Homer eats a spoiled hoagie, and becomes dreadfully ill. As a result, he can not fulfill his promise of taking Bart and Lisa to Duff Gardens and Selma agrees to take them instead. However, Selma struggles with parenting and decides she is happier taking care of her pet Iguana Jub Jub."
  },
  {
    "seasonNumber": 4,
    "episodeNumberInSeason": 14,
    "title": "Brother from the Same Planet",
    "originalReleaseDate": "1993-02-04",
    "synopsis": "After leaving Bart alone at soccer practice, Homer's inept parenting prompts Bart to get a \"Bigger Brother\" named Tom. Homer finds out about this and decides to get revenge by taking part in the \"Bigger Brother\" program and taking charge of a young boy named Pepi. Pepi and Homer begin to bond and Bart starts to regret taking advantage of the program. At an aquarium, Homer and Tom meet and begin to brawl and Homer is injured. Tom becomes Pepi's new Bigger Brother and Bart bonds with Homer by asking him to share his knowledge of fighting. Meanwhile, Lisa becomes addicted to calling a 1-900 number featuring a pretty-boy celebrity named Corey."
  },
  {
    "seasonNumber": 4,
    "episodeNumberInSeason": 15,
    "title": "I Love Lisa",
    "originalReleaseDate": "1993-02-11",
    "synopsis": "On Valentine's Day, everyone in Lisa's class receives a card, except Ralph Wiggum. Out of pity, Lisa quickly writes one up and gives it to him, much to Ralph's delight. Ralph begins to develop an interest in Lisa, but Lisa is not interested. However, she does not know how to get rid of him. Ralph invites her to go to Krusty's 29th Anniversary Special and she reluctantly accepts. During a televised talk session with Krusty, Ralph declares that he loves her and Lisa explodes and declares that she never liked Ralph. Ralph becomes heartbroken. For the President's Day play, Lisa is cast in a role as Martha Washington and to her horror, Ralph gets the role of George Washington. She becomes afraid that Ralph will embarrass her again, but Ralph gives a rousing performance. After the play, Lisa and Ralph decide to just be friends."
  },
  {
    "seasonNumber": 4,
    "episodeNumberInSeason": 16,
    "title": "Duffless",
    "originalReleaseDate": "1993-02-18",
    "synopsis": "After taking the Duff Brewery tour, Homer is caught driving drunk and is arrested. His license is revoked and he must attend traffic school and Alcoholics Anonymous meetings. After much reluctance, Homer agrees to Marge's suggestion of giving up drinking beer for an entire month. He struggles to make it, but eventually does and decides to forgo a reward of a beer by taking Marge for a bicycle ride. Meanwhile, Bart demolishes Lisa's science project of a steroid-pumped tomato, prompting Lisa to make a science project pitting Bart against a Hamster."
  },
  {
    "seasonNumber": 4,
    "episodeNumberInSeason": 17,
    "title": "Last Exit to Springfield",
    "originalReleaseDate": "1993-03-11",
    "synopsis": "After learning that Mr. Burns' decision to revoke their dental plan has coincided with Lisa needing braces, Homer convinces his coworkers not to give up their dental plan and becomes the new head of the workers union at the Springfield Nuclear Power Plant. He holds talks with Mr. Burns, but these go badly because Homer is not intelligent enough to understand Burns' sly innuendos. The plant goes on strike and Mr. Burns decides to take away the electricity for the entire town. However, this just encourages the workers union and Burns decides to reach a deal with Homer. Guest star: Dr. Joyce Brothers"
  },
  {
    "seasonNumber": 4,
    "episodeNumberInSeason": 18,
    "title": "A Simpsons Clip Show",
    "originalReleaseDate": "1993-04-01",
    "synopsis": "In the first Simpsons clip show, it's April Fools' Day and Homer starts playing pranks upon Bart through the day. Bart, angered by the numerous tricks he has fallen for, plans the ultimate revenge on Homer by shaking a can of beer so hard that it causes an explosion. While Homer ends up in a coma, the family reminisces about their past adventures. Bart eventually admits to being the cause of Homer's condition and Homer immediately awakens and begins strangling Bart."
  },
  {
    "seasonNumber": 4,
    "episodeNumberInSeason": 19,
    "title": "The Front",
    "originalReleaseDate": "1993-04-15",
    "synopsis": "After watching a terribly lackluster episode of The Itchy & Scratchy Show, Bart and Lisa decide to start writing their own episodes and sending it to the studio. Roger Meyers, the CEO, immediately rejects their script due to their age. They put Grampa's name on the script and send it back, and Meyers loves it and hires Grampa. Bart and Lisa's cartoons are hugely successful and are nominated for an award. At the ceremony, Grampa finally sees an Itchy & Scratchy cartoon for the first time and is horrified. Meanwhile, Homer and Marge revisit a High School reunion, which prompts Homer to admit that he never officially graduated because he failed a science class. At the reunion, Homer wins several awards but these are revoked, causing Homer to go to night school to make up the lost credits on the class he never passed — remedial science."
  },
  {
    "seasonNumber": 4,
    "episodeNumberInSeason": 20,
    "title": "Whacking Day",
    "originalReleaseDate": "1993-04-29",
    "synopsis": "Bart is expelled from Springfield Elementary School, so Marge decides to home school him. Springfield's annual holiday arrives: Whacking Day, a day specifically designed to drive snakes into the town's square and club them to death. When most Springfielders celebrate the local holiday, Lisa is appalled at the upcoming celebration, but her protests fall on deaf ears. Lisa and Bart manage to convince the town about the nightmare of Whacking Day and Principal Skinner decides to allow Bart to return to school. Guest star: Barry White Note: First appearance of Superintendent Chalmers."
  },
  {
    "seasonNumber": 4,
    "episodeNumberInSeason": 21,
    "title": "Marge in Chains",
    "originalReleaseDate": "1993-05-06",
    "synopsis": "Springfield is hit with the dreaded Osaka Flu, causing many of the town to fall ill. Due to the exhaustion from having to look after the rest of her ill family, Marge accidentally forgets to pay for Grampa's bottle of bourbon when shopping at the Kwik-E-Mart. Marge is soon arrested for shoplifting and is sentenced to 30 days at Springfield's Woman Prison. Marge's absence is felt everywhere and she is welcomed back with open arms when she is released."
  },
  {
    "seasonNumber": 4,
    "episodeNumberInSeason": 22,
    "title": "Krusty Gets Kancelled",
    "originalReleaseDate": "1993-05-13",
    "synopsis": "A new show about a ventriloquist dummy named Gabbo becomes the hottest show in Springfield and Krusty's show is cancelled due to low ratings. Krusty is at first crestfallen at the cancellation of his show, but Bart and Lisa manage to convince him to stage a comeback special and invite his celebrity friends to take part. The special is a huge success and Krusty's show goes back on the air. Guest Stars: Johnny Carson, Hugh Hefner, Bette Midler, Luke Perry, Red Hot Chili Peppers and Elizabeth Taylor Note: This is the only episode to date that Marge (despite her prominence) does not have any dialogue."
  }
]
