[
  {
    "seasonNumber": 10,
    "episodeNumberInSeason": 1,
    "title": "Lard of the Dance",
    "originalReleaseDate": "1998-08-23",
    "synopsis": "All the girls in Lisa's class are impressed by the mature, trendy personality of a new student named Alex Whitney, and do everything they can to be just like her. Lisa, who is not as impressed and chooses to be herself, is forgotten by her classmates and becomes jealous of Alex. Lisa's friends and Alex decide to host a school dance and they buy outfits for it in order to get dates. When Lisa goes to the dance, she discovers that the boys and the girls are at separate ends of the room, too embarrassed to dance with each other. As a result, Lisa is able to prove that Alex and her classmates are only children and not as mature as they try to be. Meanwhile, Homer convinces Bart to drop out of school for what he thinks to be a more promising pursuit: selling grease. However, this endeavor fails when their business results in a scuffle with Groundskeeper Willie. Guest star: Lisa Kudrow"
  },
  {
    "seasonNumber": 10,
    "episodeNumberInSeason": 2,
    "title": "The Wizard of Evergreen Terrace",
    "originalReleaseDate": "1998-09-20",
    "synopsis": "Homer discovers that he has not done anything in life that will be remembered after he dies, so he decides to become an inventor like Thomas Edison. However, his initial inventions such as an electric hammer are considered unpractical and are not well received. After a period of depression, Homer comes up with his first good invention—a chair that cannot tip over—only to discover that Edison also invented the same design. However, Edison's invention has remained unnoticed in Edison's preserved office at the Edison National Historic Site in West Orange New Jersey, so Homer sets out to destroy it. There, he has a change of heart and returns home, only to leave his electric hammer behind. When the museum staff members find it, they believe it is an undiscovered invention by Edison. The hammer becomes a success and Edison's heirs earn a lot of money, making Homer angry."
  },
  {
    "seasonNumber": 10,
    "episodeNumberInSeason": 3,
    "title": "Bart the Mother",
    "originalReleaseDate": "1998-09-27",
    "synopsis": "Nelson invites Bart over to test a BB gun he \"won\" at an arcade center. When Bart uses it and accidentally kills a bird mother, Marge becomes furious with him, thinking that he killed the animal on purpose. Bart feels guilty for what he has done and takes it upon himself to nurse the mother's orphaned eggs. Marge soon finds out about this and becomes proud of him. However, when the eggs hatch, they are found to be lizards that lived in the bird's nest. Skinner, a member of the Springfield Birdwatching Society, tells Bart that the lizards must die because they kill so many species of birds. Bart refuses and helps the lizards escape. After the lizards devour the pigeon population, which the townsfolk considered to be a nuisance, Bart is honored by Mayor Quimby. Note: This episode was dedicated to Phil Hartman."
  },
  {
    "seasonNumber": 10,
    "episodeNumberInSeason": 4,
    "title": "Treehouse of Horror IX",
    "originalReleaseDate": "1998-10-25",
    "synopsis": "In the ninth Treehouse of Horror episode, there are three stories: \"Hell Toupée\" – Homer gets a hair transplant from Snake Jailbird, who was sentenced to death after breaking the city's three-strikes law. Snake's spirit possesses Homer through the hair, forcing Homer to kill the people who witnessed against Snake after his final crime, including Bart. \"The Terror of Tiny Toon\" – When Lisa and Bart find a plutonium rod to use as a remote control battery, the two get sucked into a special, extremely violent Halloween episode of The Itchy & Scratchy Show. \"Starship Poopers\" – Marge, Homer, and Kang end up on The Jerry Springer Show after Marge confesses to Homer that Maggie is an alien and that Kang is her real father."
  },
  {
    "seasonNumber": 10,
    "episodeNumberInSeason": 5,
    "title": "When You Dish Upon a Star",
    "originalReleaseDate": "1998-11-08",
    "synopsis": "When a parasailing accident sends Homer crashing into the secret home of Hollywood couple Kim Basinger and Alec Baldwin, they hire him as their personal assistant, provided that Homer does not tell anyone where they live. The couple starts to become irritated with Homer, who gives them ridiculous suggestions for film screenplays. When he accidentally violates their trust by revealing their location in Springfield, the couple immediately end the friendship. After a chase between the Hollywood stars in their Hummer and Homer in his mobile museum of stuff that belongs to the couple, Homer is ordered by a court of law to remain 500 miles away from any celebrity. Guest stars: Alec Baldwin, Kim Basinger, Ron Howard and Brian Grazer"
  },
  {
    "seasonNumber": 10,
    "episodeNumberInSeason": 6,
    "title": "D'oh-in' in the Wind",
    "originalReleaseDate": "1998-11-15",
    "synopsis": "While filling out a Screen Actors Guild form (after starring in an instructional video filmed at the nuclear plant where he works), Homer realizes that he does not know what his middle initial \"J\" stands for. After finding the answer, \"Jay\", on a mural in the hippie commune where his mother once lived, Homer decides to live the hippie lifestyle. He stays with his mother's old friends Seth and Munchie who now own a juice company. Homer quickly ruins one of their juice shipments by accident, and tries to make up for it by taking crops from their garden and making juice with them. However, some of these crops contained drugs and after people start to have crazy hallucinations from drinking the juice, Chief Wiggum arrives to arrest Seth and Munchie. Homer stands up for their rights and ends up with a gunshot-propelled flower embedded in his head. Guest stars: George Carlin and Martin Mull"
  },
  {
    "seasonNumber": 10,
    "episodeNumberInSeason": 7,
    "title": "Lisa Gets an 'A'",
    "originalReleaseDate": "1998-11-22",
    "synopsis": "While sick from school, Lisa becomes obsessed with a video game and forgets to study for a test on the book The Wind in the Willows. Not willing to fail, she calls upon Bart and Nelson to help her pass via Nelson's archive of \"study aids\", and gets an A+++. Consequently, Springfield Elementary School now qualifies for a basic assistance grant as Lisa's grade lifted the overall GPA enough. Tormented by guilt for cheating, she reveals what she did to Skinner and Superintendent Chalmers, who try to persuade her to keep it a secret so the school can keep the money. At the grant ceremony, Lisa finally blurts out her indiscretion, prior the real ceremony taking place as Skinner and Chalmers had anticipated her actions, with Bart using a dummy to substitute for her. Meanwhile, Homer houses a lobster to eat, but becomes emotionally attached to it and makes it his pet. However, he accidentally boils it to death while giving it a hot bath, and eats it sadly."
  },
  {
    "seasonNumber": 10,
    "episodeNumberInSeason": 8,
    "title": "Homer Simpson in: 'Kidney Trouble'",
    "originalReleaseDate": "1998-12-06",
    "synopsis": "As the Simpson family is driving home after spending the day at a ghost town tourist attraction, Grampa needs to use the restroom but Homer refuses to stop the car. Grampa is forced to hold his urine in for hours and as a result his kidneys explode. With not much time left for Grampa to live, Homer offers to give his father one of his kidneys. However, he runs away from the hospital out of fear of the procedure and decides to hide, feeling shame for leaving Grampa on the operating table. He joins a group of weird characters on a ship who are also hiding out of shame for things they have done in their lives. However, Homer is rejected even from these outcasts because they are angered and disgusted by what he has done to his father. They throw him into the ocean and he drifts back to Springfield. There, he plans on giving his kidney again, but runs away at the last minute once more. After being knocked out by a car while fleeing from the hospital, he wakes up and sees a hale Abe, wrongly believing he just recovered miraculously before he notices incision outlines on his side..."
  },
  {
    "seasonNumber": 10,
    "episodeNumberInSeason": 9,
    "title": "Mayored to the Mob",
    "originalReleaseDate": "1998-12-20",
    "synopsis": "After saving Mayor Quimby and Mark Hamill from rioters at a science fiction convention, Homer becomes Quimby's bodyguard. When Homer discovers that Mafia leader Fat Tony is providing rat milk to the schools of Springfield, he forces Quimby to expose Tony in return for saving Quimby from falling off a ledge. After Tony is arrested, he threatens to take Quimby's life. While Quimby is spending an evening at a dinner theater, Homer discovers that Fat Tony is there alongside his henchman, Louie, having been released on bail. Homer foils an attempt by Louie to kill Quimby, and as Homer and Louie fight, Tony is able to savagely beat Quimby with a baseball bat. However, Tony makes sure to only restore Quimby's fear of the Mafia and not kill him, and Mark Hamill assures Homer he did a great job as a bodyguard. Guest star: Mark Hamill"
  },
  {
    "seasonNumber": 10,
    "episodeNumberInSeason": 10,
    "title": "Viva Ned Flanders",
    "originalReleaseDate": "1999-01-10",
    "synopsis": "When Springfield's only casino is demolished because of curfew, massive dust clouds form, prompting the Simpson family and Ned Flanders to go to a car wash to get rid of the dust on their cars. There, Homer sees Ned gets a senior discount. Thinking that Flanders is not a senior and lying about his age, Homer reveals this at church. As a result, Ned is forced to admit to everyone that he is 60 years old and only looks young because he has never done anything exciting in his life. Out of pity, Homer decides to take him to Las Vegas, where, after a night of partying and gambling, they end up marrying two casino barmaids while drunk. As Homer and Ned try to escape from the barmaids the next day, they go on a wild rampage through the casino, until they are confronted by casino security and banned from ever visiting Las Vegas again."
  },
  {
    "seasonNumber": 10,
    "episodeNumberInSeason": 11,
    "title": "Wild Barts Can't Be Broken",
    "originalReleaseDate": "1999-01-17",
    "synopsis": "Homer, Lenny, Carl, and Barney celebrate a turnaround-capping title victory for the Springfield Isotopes baseball team and end up going on a drunken rampage through town. During this rampage, they vandalize Springfield Elementary School. The next morning, Chief Wiggum decides without evidence that students committed the crime and places all of Springfield's youth under a curfew. The children respond by setting up a pirate radio show in which they reveal the embarrassing secrets of Springfield's adults. The location from which the children send out the broadcast is soon tracked down and an argument between the children and the adults ensues. As each side is stating their case in a song, the senior citizens turn up to complain about the children and the adults. Both the kids and their parents end up getting screwed because a senior citizen-decided vote puts everyone who's under 70 in the curfew zone, and Grandpa and his friends enjoy the night out."
  },
  {
    "seasonNumber": 10,
    "episodeNumberInSeason": 12,
    "title": "Sunday, Cruddy Sunday",
    "originalReleaseDate": "1999-01-31",
    "synopsis": "While buying new tires for his car, Homer meets a travel agent who offers Homer a free bus ride to the Super Bowl, as long as he can find enough people to fill the agent's bus. A group of Springfield men tag along to what soon becomes a problematic trip after the tickets are discovered to be fake. As a result, they are locked in \"Super Bowl Jail\". Thanks to help from Dolly Parton, they break out and attempt to find the football field, until they get lost in the sea of players that run through the corridors of the stadium to the locker room after winning the Super Bowl. Much to their happiness, Homer and his friends end up in the locker room with the players, and leave happily as John Madden and Pat Summerall note the episode had no football or music scenes. Meanwhile, Marge and Lisa try to find the missing parts of \"Vincent Price's Egg Magic\", a celebrity-endorsed craft kit."
  },
  {
    "seasonNumber": 10,
    "episodeNumberInSeason": 13,
    "title": "Homer to the Max",
    "originalReleaseDate": "1999-02-07",
    "synopsis": "Homer is delighted with the positive attention he receives after a new television show airs that features a police character also named Homer Simpson. However, when the character is changed from a hero to a bumbling idiot by the show's producers, Homer is mocked and taunted by those he knows, so he changes his name to \"Max Power\" to rid himself of the negative attention. The new name earns Homer respect, and he and Marge are invited to a party where they meet a lot of famous people who are going to save a redwood forest from destruction by chaining themselves to the trees. However, Homer accidentally cuts his tree with his chains while running away from police officers Eddie and Lou. The tree knocks down all the other redwoods in a chain reaction, angering Max's newfound friends. In the end, Max changes his name back to Homer."
  },
  {
    "seasonNumber": 10,
    "episodeNumberInSeason": 14,
    "title": "I'm with Cupid",
    "originalReleaseDate": "1999-02-14",
    "synopsis": "After Apu and Manjula have a big fight, Apu showers his wife with elaborate Valentine's Day gifts to make up for it, making the rest of the men in Springfield look bad in front of their women. His final gift is to write a love note to Manjula in the sky—which Homer (along with a group of other discontented male characters) plans to sabotage. When the plane is about to spray the message \"I LOVE U MANJULA\", Homer manages to destroy the canister at \"I LOVE U ⭐️\", a message that the women of Springfield think was made only for them by their partners. Homer is able to win Marge's love back by jumping out of the plane covered in roses and landing in front of her in their backyard. Meanwhile, to reconcile Apu with his wife, Elton John performs a private concert for the couple."
  },
  {
    "seasonNumber": 10,
    "episodeNumberInSeason": 15,
    "title": "Marge Simpson in: 'Screaming Yellow Honkers'&hairsp;",
    "originalReleaseDate": "1999-02-21",
    "synopsis": "Homer buys an SUV but upon discovery that it was designed as a \"woman's car\", he gives it to Marge. Infatuated with the car, she proceeds to develop a ferocious road rage and ends up losing her license when she fails a driving test and crashes it into a prison. However, her road rage is required when Homer accidentally sets all the rhinoceros in a zoo free. Marge agrees to assist the police in rounding up the animals, but learns there is one missing and sees Homer being carried off by it. She chases the angry rhino into a construction site and deliberately crashes the SUV, making it burst into flames. The rhino instinctively attempts to stamp out the fire, allowing Homer to escape."
  },
  {
    "seasonNumber": 10,
    "episodeNumberInSeason": 16,
    "title": "Make Room for Lisa",
    "originalReleaseDate": "1999-02-28",
    "synopsis": "When Homer uses Lisa's room as a cellular phone transmitter to pay off damages he did to the Bill of Rights at a Smithsonian exhibit, Lisa is forced to move into Bart's room. Lisa becomes furious with her father for having to share a room with her brother. She fears that she and Homer will never be close because of their clashing personalities and begins to develop stress-related stomach aches. To relieve these aches, Homer and Lisa visit a New Age store where the owner convinces them to go on a spiritual journey by lying in a sensory deprivation tank for a prolonged amount of time. On her journey, Lisa discovers that beneath Homer's bumbling outside, he really does care about her. Reconciled, the two of them watch a demolition derby together, something they equally enjoy. Meanwhile, Marge uses Maggie's monitor to listen in on other people's phone calls; however, when Milhouse and Bart play a prank on her, Marge knocks Milhouse out, thinking he was a burglar."
  },
  {
    "seasonNumber": 10,
    "episodeNumberInSeason": 17,
    "title": "Maximum Homerdrive",
    "originalReleaseDate": "1999-03-28",
    "synopsis": "While the family dines at a new steakhouse, a trucker named Red challenges Homer to a steak-eating contest. Red wins, but quickly dies of \"beef poisoning\", making it the first time he will miss a shipment. Feeling bad for him, Homer takes on the duty of transporting Red's cargo to Atlanta with Bart by his side. After falling asleep behind the wheel, Homer awakes to discover that the truck drove by itself with its Navitron Autodrive system. He informs other truck drivers, who tell him that he cannot let anyone know about the Autodrive system because it would cost the truckers their high-paying and no-effort jobs. Later, when cars that pass by Homer find out about it, a mob of truckers confront him. Homer and Bart escape, finish the shipment on time, and go home on a freight train. Meanwhile, after deducing that only Homer and Bart get to do the fun things in life, Marge and Lisa decide to add excitement to their lives by installing a new doorbell. However, it starts to malfunction after Lisa presses it."
  },
  {
    "seasonNumber": 10,
    "episodeNumberInSeason": 18,
    "title": "Simpsons Bible Stories",
    "originalReleaseDate": "1999-04-04",
    "synopsis": "Reverend Lovejoy punishes the congregation with a thorough reading of the Bible after discovering a chocolate Easter bunny in the collection plate. This leads to the Simpson family falling asleep and dreaming of themselves in Biblical stores: Adam and Eve – Homer and Marge are Adam and Eve, who get tempted by a snake into eating the forbidden fruit from the Tree of Knowledge."
  },
  {
    "seasonNumber": 10,
    "episodeNumberInSeason": 19,
    "title": "Mom and Pop Art",
    "originalReleaseDate": "1999-04-11",
    "synopsis": "Homer tries to assemble a barbecue pit quickly, but fails and is left with a mismatched collection of parts stuck in hardened cement. As a result, he vents his rage on the construct, mangling it further. When Homer takes the failed barbecue pit back to the store, an art dealer sees it and describes it as a masterpiece of outsider art. As a result, he gets his own art exhibition and channels his rage into his work. Marge, who had been trying to succeed at art for years, gets jealous of Homer's easy success. However, when Homer makes new art pieces for a show called \"Art in America\" that are similar to his first piece, his peers reject him as repetitive. In an attempt to do something groundbreaking, Homer floods Springfield and puts snorkels on the animals. The townspeople declare this a masterpiece and everyone including Marge enjoys the new \"Grand Canals of Springfield\"."
  },
  {
    "seasonNumber": 10,
    "episodeNumberInSeason": 20,
    "title": "The Old Man and the 'C' Student",
    "originalReleaseDate": "1999-04-25",
    "synopsis": "After ruining Springfield's chances of hosting the Olympics with an ethnically offensive stand-up act in front of the International Olympic Committee, Bart is forced to volunteer at the Springfield Retirement Castle. Meanwhile, Homer receives 1,000 springs he intended to sell as the mascot he created for the Olympics, Springy the Springfield Spring. He uses various get-rich-quick schemes to sell off the mascots, but fails miserably due to Springfield's hatred of Bart's comedy routine. Ultimately, Homer is forced to flush the mascots down the toilet. At the retirement home, Bart is dismayed at how little the seniors are allowed to do and decides to take them on a boat ride, which the seniors thoroughly enjoy until they crash into Mr. Burns' schooner. The boat begins to sink, but the springs that Homer flushed down the toilet out onto the bottom of the sea cause the boat to bounce up to the surface long enough for the United States Coast Guard to rescue everyone."
  },
  {
    "seasonNumber": 10,
    "episodeNumberInSeason": 21,
    "title": "Monty Can't Buy Me Love",
    "originalReleaseDate": "1999-05-02",
    "synopsis": "Billionaire Arthur Fortune captures Springfield's heart by giving each customer a dollar at the opening of his new mega-store. This embarrasses the unpopular Mr. Burns, who recruits Homer to help him be loved by all. However, their various schemes fail. Feeling disappointed, Burns makes Homer, Groundskeeper Willie, and Professor Frink join him on a trip to Scotland to catch the legendary Loch Ness Monster. After some minor setbacks, Burns is able to capture the monster and sends it to Springfield to be unveiled, where the friendly \"Nessie\" charms all of the spectators and makes Burns more likable. However, during the unveiling, Burns is blinded by camera flashes and runs into a camera which crashes and starts a fire. As a result, the crowd flees in panic. Following this disaster, Homer cheers up Burns by pointing out that being loved means you have to be nice to people every day but being hated is effortless. Burns embraces his misanthropic nature and gets Nessie a job as a greeter at his new casino."
  },
  {
    "seasonNumber": 10,
    "episodeNumberInSeason": 22,
    "title": "They Saved Lisa's Brain",
    "originalReleaseDate": "1999-05-09",
    "synopsis": "After a riot occurs at a Springfield contest that falsely promises a luxurious trip to the most disgusting and dimwitted contest participant, Lisa, disgusted at the lack of intelligence, writes a letter that appears in the newspaper. Springfield's branch of Mensa International, consisting of Comic Book Guy, Dr. Hibbert, Principal Skinner, Professor Frink, and Lindsay Naegle, is impressed and invites Lisa to join the group. When the Mensa members lose their gazebo at the park, they go to complain to Mayor Quimby. However, the mayor thinks they are there to confront him about his political corruption so he flees from Springfield. As a result, Lisa and the others are granted power to the city since they are the smartest. The power eventually corrupts them and they are cornered by a mob, only to be saved when Stephen Hawking shows up. Meanwhile, Homer gets erotic photographs of himself taken for Marge, but while she enjoys them a lot, she gets distracted by the interior design Homer did in their basement for the photo shoot and they do not have sex that night."
  },
  {
    "seasonNumber": 10,
    "episodeNumberInSeason": 23,
    "title": "Thirty Minutes over Tokyo",
    "originalReleaseDate": "1999-05-16",
    "synopsis": "When Snake Jailbird steals money from the Simpson family's bank account through the Internet, the Simpsons go on a budget and save enough to buy a trip to Japan. The Simpsons thoroughly enjoy the country, and Homer defeats one of the mightiest sumo wrestlers. Impressed, the Emperor of Japan congratulates Homer, but, thinking the emperor is a new challenger, Homer knocks him out. As a result, he is placed in prison. After Marge pays the bail, Homer loses the last of their money and the family is unable to buy plane tickets home. All seems lost until a sadistic Japanese game show allows the Simpsons to compete in order to return to Springfield. Their last task on the show is to retrieve the plane tickets on a suspension bridge over an active volcano, which, once the family falls in, is revealed to be filled with orangeade and not lava. Although the family gets the tickets, Homer scolds the Japanese for their lack of ethics, before Godzilla lets go of their plane home and they head back across the ocean to Springfield."
  }
]
