[
  {
    "seasonNumber": 15,
    "episodeNumberInSeason": 1,
    "title": "Treehouse of Horror XIV",
    "originalReleaseDate": "2003-11-02",
    "synopsis": "Reaper Madness – Homer enjoys his new life as The Grim Reaper after killing the old one and plaguing the world with immortality, but becomes conflicted when Marge is next on his death list. Frinkenstein – Professor Frink wins the Nobel Prize in science, but is sad that his dead father is not with him to share in his success, so Frink rebuilds him out of his father's real body with mechanical parts, but the latter is not happy with this and he will steal the body parts of other corpses. Stop the World, I Want to Goof Off – Bart and Milhouse order a stopwatch from the back of a comic book that possesses the power to manipulate time. Guest star: Jerry Lewis, Dudley Herschbach, Jennifer Garner and Oscar De La Hoya"
  },
  {
    "seasonNumber": 15,
    "episodeNumberInSeason": 2,
    "title": "My Mother the Carjacker",
    "originalReleaseDate": "2003-11-09",
    "synopsis": "Homer finds a hidden message in the newspaper asking to meet him finds that it is from Homer's mother, Mona. The police find them, and Mona is put on trial and is acquitted by the jury. She moves in with the Simpsons and makes up for missed time with Homer. Mr. Burns, seeking revenge for her previous acts, tricks her into committing a federal offense, and she is arrested. Homer helps her escape from the prison transport bus, but she subdues Homer to keep him safe before apparently dying in an explosion while driving away in the bus. Homer is comforted, thinking he found short message from Mona, but she truly survived and left a longer message explaining what happened. Guest star: Glenn Close"
  },
  {
    "seasonNumber": 15,
    "episodeNumberInSeason": 3,
    "title": "The President Wore Pearls",
    "originalReleaseDate": "2003-11-16",
    "synopsis": "In this loose parody of the musical/movie Evita, Lisa is elected Student Body president. However, the school staff controls her by giving her a makeover so they can cut the school budget and use her as a scapegoat. When she learns what happened, she resigns and joins the students in a strike. To cripple the protest, Principal Skinner transfers Lisa to another school, but Homer returns her because of the extra commute time. The cuts are restored by selling cigarettes and eliminating flu shots. Guest star: Michael Moore"
  },
  {
    "seasonNumber": 15,
    "episodeNumberInSeason": 4,
    "title": "The Regina Monologues",
    "originalReleaseDate": "2003-11-23",
    "synopsis": "After making over $3000 from his own museum featuring a $1000 bill, Bart takes the family to London on the suggestion of Grampa to find a former lover. While driving in London, Homer collides with the Queen's carriage. At his trial, he insults the queen and is sentenced to death. Waiting for execution, he tries to escape but ends up in the queen's bedroom. He begs for forgiveness and the queen allows him to leave the country if he takes Madonna with him. Meanwhile, Grampa finds his former love and discovers he has a daughter, which prompts him to run away. Guest star: Tony Blair, J. K. Rowling, Ian McKellen, Jane Leeves and Evan Marriott"
  },
  {
    "seasonNumber": 15,
    "episodeNumberInSeason": 5,
    "title": "The Fat and the Furriest",
    "originalReleaseDate": "2003-11-30",
    "synopsis": "When Homer is forced to dispose of a giant ball of candy, he encounters a bear and cowers in fear, but it leaves him alone. A hunter captures the scene on camera, and Homer is humiliated when he appears on the news. To regain his dignity, he builds a suit of armor to confront the bear. He loses the battle with it but removes an electric prod from it, making it docile. Homer takes the bear to a wildlife refuge after giving it his armor to protect itself against hunters. Guest star: Charles Napier"
  },
  {
    "seasonNumber": 15,
    "episodeNumberInSeason": 6,
    "title": "Today I Am a Clown",
    "originalReleaseDate": "2003-12-07",
    "synopsis": "Krusty discovers that he never had a bar mitzvah as a child. He quits his show to have it as an adult, with the help of his father, Rabbi Krustofsky. Meanwhile, Homer hosts a late-night talk show à la Politically Incorrect with Bill Maher as a replacement for Krusty's show. However, when he starts discussing meaningful topics at the suggestion of Lisa, it gets cancelled. To regain his popularity, Krusty televises his bar mitzvah, which disappoints his father, so he has a second traditional one to please him. Guest star: Jackie Mason and Mr. T"
  },
  {
    "seasonNumber": 15,
    "episodeNumberInSeason": 7,
    "title": "'Tis the Fifteenth Season",
    "originalReleaseDate": "2003-12-14",
    "synopsis": "Homer realizes how selfish he is after he spends all the family's Christmas money on a present for himself. Trying to change, he becomes the most charitable person in town, making Ned Flanders jealous. Lisa tells Homer that Buddhists believe that people would be happier without material possessions, so he steals the townsfolk's Christmas presents as his next good deed. When an angry mob comes for him, Flanders calms them down and gives back their presents."
  },
  {
    "seasonNumber": 15,
    "episodeNumberInSeason": 8,
    "title": "Marge vs. Singles, Seniors, Childless Couples and Teens, and Gays",
    "originalReleaseDate": "2004-01-04",
    "synopsis": "When a concert for babies causes a riot, the town must take taxpayer money to cover the damage. A group of singles, seniors, childless couples, teens, and gays band together to protest having to accommodate families to force the town to remove anything that is child friendly. Marge takes up the cause for the families by placing an initiative on the ballot. With the petition likely to lose, Bart and Lisa form a plan to have the children hug the childless adults on election day, which gives them germ and makes them too sick to vote, and the petition passes."
  },
  {
    "seasonNumber": 15,
    "episodeNumberInSeason": 9,
    "title": "I, (Annoyed Grunt)-Bot",
    "originalReleaseDate": "2004-01-11",
    "synopsis": "Homer is unable to assemble a bicycle for Bart, which embarrasses him in front of the bullies. To win Bart's respect, Homer builds a battle robot, which is actually Homer in a costume. When he enters the robot into a tournament, Homer reaches the final round despite his injuries. In the final battle, Bart discovers Homer, who wins his respect because of the injuries his sustained. When the robot ejects Homer from his suit, the robot stops because it was programmed not to harm people, so Homer wins. Meanwhile, Snowball II dies and Lisa tries to find a replacement cat, but they keep dying. When she finds a cat that survives, she names it Snowball V but will be called Snowball II to maintain the status quo."
  },
  {
    "seasonNumber": 15,
    "episodeNumberInSeason": 10,
    "title": "Diatribe of a Mad Housewife",
    "originalReleaseDate": "2004-01-25",
    "synopsis": "Marge writes a romance novel with characters based on Homer as the villain and Ned Flanders as the hero that becomes a hit. Rumors spread that the novel is based on Marge's life. Meanwhile, Homer gets fired from the power plant again and becomes an ambulance driver. When Homer reads the novel, he chases Ned in his ambulance. He corners Ned but begs him to teach him how to be a good husband. Marge is relieved, and they write the next novel together. Guest star: Mary-Kate and Ashley Olsen, Thomas Pynchon and Tom Clancy"
  },
  {
    "seasonNumber": 15,
    "episodeNumberInSeason": 11,
    "title": "Margical History Tour",
    "originalReleaseDate": "2004-02-08",
    "synopsis": "When the local library proves to be useless for the kids' class project, Marge tells Milhouse, Bart, and Lisa three Simpsons-style historical accounts: Henry VIII's (Homer's) attempts at siring a son, Lewis and Clark (Lenny and Carl) exploring the USA's wilderness with Sacagawea (Lisa), and Salieri (Lisa again) out to ruin piano-playing virtuoso Mozart (Bart). Lisa notes that the last story is not accurate."
  },
  {
    "seasonNumber": 15,
    "episodeNumberInSeason": 12,
    "title": "Milhouse Doesn't Live Here Anymore",
    "originalReleaseDate": "2004-02-15",
    "synopsis": "Milhouse moves away to Capitol City to live with his divorced mom. Without his friend, Bart bonds with Lisa, and they become best friends. Meanwhile, Homer goes into panhandling to buy anniversary gifts for Marge. A group of beggars become angry at Homer, and tell Marge what he is doing, but she does not return the gifts. Later, Milhouse returns to live with his father, and Bart goes back being friends with him and abandons Lisa. However, he gives Lisa a set of cards to do nice things for her as a token of appreciation. Guest star: Isabel Sanford, Nick Bakay, William Daniels, Dick Tufeld and Casey Kasem"
  },
  {
    "seasonNumber": 15,
    "episodeNumberInSeason": 13,
    "title": "Smart & Smarter",
    "originalReleaseDate": "2004-02-22",
    "synopsis": "When Maggie does better than Lisa on an IQ test, Lisa becomes upset over no longer being the smart one and tries to lead Maggie astray. When Marge scolds her for this, Lisa hides in the Natural History Museum. The family comes looks for her, and everyone except Maggie becomes trapped in a human body exhibit. Lisa is able to get Maggie to release them after several tries. Later, they are shown a video in which Lisa subconsciously supplies answers to Maggie, which is why Maggie performed well on the IQ test. Guest star: Simon Cowell"
  },
  {
    "seasonNumber": 15,
    "episodeNumberInSeason": 14,
    "title": "The Ziff Who Came to Dinner",
    "originalReleaseDate": "2004-03-14",
    "synopsis": "The Simpsons go on a late-night attic search after Bart and Lisa, who are freaked out over a horror movie Homer let them watch, begin hearing voices and find Marge's ex-prom date Artie Ziff, who is on the run for cheating the shareholders of his company. The family allows Artie to stay with them, but Homer is arrested after he wins all of Artie's shares of his company in a game of poker. Marge kicks Artie out, but after encountering Selma and sleeping with her, he admits to being at fault, and Homer is freed. Guest star: Jon Lovitz"
  },
  {
    "seasonNumber": 15,
    "episodeNumberInSeason": 15,
    "title": "Co-Dependents' Day",
    "originalReleaseDate": "2004-03-21",
    "synopsis": "Bart and Lisa complain to Randall Curtis, a George Lucas-esque science fiction movie director, about his latest film. When they are not satisfied with his response, the family goes to Northern California to confront him where Homer and Marge's bond becomes stronger when they both get drunk on wine. Returning home, they continue to bond over drinking until Homer crashes the car while drunk and has a drunken Marge unknowingly take the blame. She gets sent to rehab, and is angered when Homer confesses. The other patients help Marge realize she likes Homer more than drinking, and she forgives him. Guest star: Brave Combo"
  },
  {
    "seasonNumber": 15,
    "episodeNumberInSeason": 16,
    "title": "The Wandering Juvie",
    "originalReleaseDate": "2004-03-28",
    "synopsis": "Bart gets sent to juvenile hall after faking a wedding to keep the gifts from the wedding registry. He tries to be friendly with the girls but is threatened by a girl named Gina. At a dance, Bart is partnered with Gina, and when Gina escapes, Bart is forced to go with her since they are handcuffed together. When they are freed of the cuffs, Bart leaves but returns after hearing Gina cry. He tries to comfort her, but they fight until the police arrive. Gina admits the escape was her idea so that Bart does not face additional charges. Guest star: Sarah Michelle Gellar, Jane Kaczmarek and Charles Napier"
  },
  {
    "seasonNumber": 15,
    "episodeNumberInSeason": 17,
    "title": "My Big Fat Geek Wedding",
    "originalReleaseDate": "2004-04-18",
    "synopsis": "After hearing that Skinner is getting cold feet about their wedding, Edna leaves Skinner at the altar. Homer tries to help Skinner win back Edna, and Marge tries to have Edna reconcile with Skinner but ends up have doubts about her own marriage. When returning a wedding gift to Comic Book Guy, they start bonding. When Skinner tries to woo Edna, he learns she and Comic Book Guy are in a relationship. The Simpsons and Skinner confront Edna and Comic Book Guy at a Sci-Fi convention where he proposes marriage. Edna chooses neither of them and leaves. Later, Homer asks to remarry Marge, and she accepts. Guest star: Matt Groening"
  },
  {
    "seasonNumber": 15,
    "episodeNumberInSeason": 18,
    "title": "Catch 'em if You Can",
    "originalReleaseDate": "2004-04-25",
    "synopsis": "After a ruined movie night, thanks to Bart and Lisa, Homer and Marge take a vacation away from them, but decide to go to Miami instead of going to see an uncle. When Bart and Lisa learn that they went to Miami, Bart, Lisa, and Grampa go look for them. When Homer and Marge see that the children tracked them down, they leave with the kids in pursuit while Grampa finds companionship with an old man in Miami. The parents are caught at Niagara Falls, but the children feel guilty. They give them space but accidentally encounter Homer and Marge, who had left earlier. Running away, the parents end up in an inflatable castle that goes over the falls. The castle keeps them safe, and they have sex under the falls."
  },
  {
    "seasonNumber": 15,
    "episodeNumberInSeason": 19,
    "title": "Simple Simpson",
    "originalReleaseDate": "2004-05-02",
    "synopsis": "When the Rich Texan humiliates Lisa at a contest, Homer retaliates by becoming \"Pie Man\", and throwing a pie at his face. He continues with the vigilante persona until he gets shot at one incident, and Lisa asks him to stop. However, he becomes Pie Man one more time to retaliate against Mr. Burns, and is caught. Burns blackmails him to be his personal hitman. When Homer is ordered to attack the Dalai Lama, he reveals himself to the world, but no one believes Homer could be him. Guest star: Nichelle Nichols"
  },
  {
    "seasonNumber": 15,
    "episodeNumberInSeason": 20,
    "title": "The Way We Weren't",
    "originalReleaseDate": "2004-05-09",
    "synopsis": "After Bart and Milhouse are caught playing spin the bottle with some girls, Homer recalls the story of his first kiss. At a boys camp where they were forced to work the kitchen at a girls camp, Homer agreed to a date with a girl he talked with on the other side of a wall. After hurting himself, he wore an eyepatch to the date, and Marge says that girl was her. Marge had burned her hair, so she went on the date with brown hair. On the date, they kissed and agreed to meet again the following night, but Homer never appeared. After leaving, Homer had an accident and ended up at a fat camp and could not escape in time. Marge left her camp broken-hearted, and Homer found half of a heart-shaped rock he had given her when he arrived. In the present, Homer shows Marge the rock to prove he cared while Marge shows him the other half, and they reconcile."
  },
  {
    "seasonNumber": 15,
    "episodeNumberInSeason": 21,
    "title": "Bart-Mangled Banner",
    "originalReleaseDate": "2004-05-16",
    "synopsis": "After receiving an injection from Dr. Hibbert, Bart becomes temporarily deaf, which makes him impervious to being bullied. During the playing of the national anthem at a donkey basketball game, Bart cannot hear it, and he accidentally moons the American flag during a prank gone wrong. Everyone in town to accuse the Simpsons of being unpatriotic, and when they try to explain themselves on a talk show, they are misinterpreted and imply that Springfield hates America. As the situation escalates, the Simpsons are arrested under the new \"Government Knows Best\" Act. The escape from prison and are brought to France on a freighter. Because they miss America, they return to the country as immigrants."
  },
  {
    "seasonNumber": 15,
    "episodeNumberInSeason": 22,
    "title": "Fraudcast News",
    "originalReleaseDate": "2004-05-23",
    "synopsis": "Lisa is preparing to recite a poem in honor of a rock formation when it collapses and crushes Mr. Burns. When Burns survives and learns no one likes him, he buys out Springfield's media outlets to improve his image. Meanwhile, Marge tells to publish her poem, so she starts her own newspaper. When Lisa refuses to be bought out by Burns, he cuts off the power, so she publishes by hand. After Lisa is humiliated by Burns, she gives up but sees that other residents have started their own newspapers."
  }
]
