[
  {
    "seasonNumber": 35,
    "episodeNumberInSeason": 1,
    "title": "Homer's Crossing",
    "originalReleaseDate": "2023-10-01",
    "synopsis": "After Otto gets high on acid brownies, the students of Springfield Elementary are forced to walk to school under the supervision of the crossing guards alongside Homer, who accidentally joins when a parent volunteer is needed. When Homer saves Ralph Wiggum's life, the crossing guards become a town-renowned association that progressively gains more of Springfield's funding despite protests from Chief Wiggum. When Mayor Quimby tries to reduce funding for the crossing guards, Homer threatens him. The crossing guards and the police end up fighting in the street until Otto returns and hits Homer with the school bus."
  },
  {
    "seasonNumber": 35,
    "episodeNumberInSeason": 2,
    "title": "A Mid-Childhood Night's Dream",
    "originalReleaseDate": "2023-10-08",
    "synopsis": "Marge gets food poisoning following a meeting with Miss Peyton about Bart entering middle school. This leads to Marge having feverish nightmares about her children growing up too fast and leaving her. The next day at the school's Bounce-A-Thon event, Bart wants to make a funny pose at the event, breaking with his traditional pose, while Marge is too sick to go. Remembering Lisa was excited for the event and her traditional pose, Marge goes anyways but loses consciousness as she tries to take a photo of Lisa. When she wakes up, she sees Bart's pose, which makes her laugh. Guest star: Kerry Washington as Rayshelle Peyton and Grocery Store Announcer"
  },
  {
    "seasonNumber": 35,
    "episodeNumberInSeason": 3,
    "title": "McMansion & Wife",
    "originalReleaseDate": "2023-10-22",
    "synopsis": "The new neighbors, Thayer and Anne, befriend the Simpsons, so they can get permission to extensively remodel their home. When the construction becomes noisy, Thayer lets Homer borrow a sports car. Meanwhile, Nelson wants to intensify his bullying, but Lisa stops him by uploading humiliating videos of him. When Nelson recruits Hubert Wong to block Lisa, she and Hubert agree to stop because it would look bad on their college applications. Later, when the neighbors' construction blocks sunlight from reaching the Simpson house, Lisa and Hubert learn that their street is a historical site, and the remodeled house must be returned to its original design. Guest stars: Rosalie Chiang as Hubert Wong and Dick Van Dyke as himself Note: This episode was dedicated in memory of Suzanne Somers."
  },
  {
    "seasonNumber": 35,
    "episodeNumberInSeason": 4,
    "title": "A Corporate Love Story",
    "originalReleaseDate": "2023-10-29",
    "synopsis": "A documentary is being filmed about the rise and fall of the company LifeBoat, the brainchild of a young college dropout named Persephone Odair. Mr. Burns agrees to give her part of the power plant and its workers to build a device to desalinate ocean water into drinkable water at a fraction of the cost. Burns and Persephone also fall in love and get married. When a whistleblower questions the project, Burns attempts to cover it up, including buying the rights to the documentary. Homer, revealed to be the whistleblower, attempts to stop the first demonstration of the device at Springfield Elementary. Homer convinces Burns that Persephone is a fraud and stops her. Burns and Persephone divorce, and she goes to prison. Guest stars: Christiane Amanpour as herself, Elizabeth Banks as Persephone Odair, Ken Burns as himself, Peter Coyote as himself, Peter Jackson as himself, Andrew Ross Sorkin as himself, and Kara Swisher as herself"
  },
  {
    "seasonNumber": 35,
    "episodeNumberInSeason": 5,
    "title": "Treehouse of Horror XXXIV",
    "originalReleaseDate": "2023-11-05",
    "synopsis": "In the thirty-fourth annual Simpsons Halloween special: * \"Wild Barts Can't Be Token\": Bart is accidentally digitized into a non-fungible token. Marge enters the digital realm to rescue him. Though she manages to rescue Bart, Homer digitizes himself to live the good life as a valuable NFT until the market crashes leaving him worthless and trapped. * \"Ei8ht\": In an alternate outcome of the episode \"Cape Feare\", Sideshow Bob has killed Bart, and Lisa grows up to become a criminal psychology teacher. The police bring Lisa to help when a series of murders of her first-born childhood friends occurs. When footage shows Lisa killing Nelson and she is sent to prison, Lisa reveals to Bob that she developed a split-personality that committed the murders to allow her to get close him. She kills Bob in the same way that he killed Bart. * \"Lout Break\": Eating a radioactive doughnut causes Homer's burps to infect everyone with his DNA, turning them into versions of him. His children are immune, but they fail to convince Homer to help find a cure even when it infects Marge. Instead, he finds the new Marge attractive, and the infection takes over the world. Guest stars: Matthew Friend as Jimmy Fallon, Kelsey Grammer as Sideshow Bob, and Kylie Jenner as herself"
  },
  {
    "seasonNumber": 35,
    "episodeNumberInSeason": 6,
    "title": "Iron Marge",
    "originalReleaseDate": "2023-11-12",
    "synopsis": "When Marge is mocked by the neighborhood women because of her worn-out bathrobe, Bart and Lisa try to get their mother a new robe for her birthday, but they buy a spy kit instead. After hearing Marge confess to Ned Flanders that she feels her family thinks of her as an afterthought, a guilt-ridden Bart and Lisa seek to learn about their mother's past to make it up to her. When they learn her family gave away her pet parrot, they retrieve it for her. However, they learn that the parrot attacks Marge as a sign of affection, but she is moved by her children's effort. Meanwhile, when Homer saves Kirk from an exposed wire, he competes with other townsfolk to warn people about increasingly trivial dangers. His exaggerations lead to Agnes and him becoming trapped in a sinkhole where he confesses that he only wanted to help people. He helps Agnes out of the hole, but she abandons him. Guest star: Megan Mullally as Sarah Wiggum"
  },
  {
    "seasonNumber": 35,
    "episodeNumberInSeason": 7,
    "title": "It's a Blunderful Life",
    "originalReleaseDate": "2023-11-19",
    "synopsis": "In the future, Lisa tells the story of how a blackout almost ruined the town. Mr. Burns overloads the power grid and causes a power plant meltdown that the workers blame on Homer. The Simpsons become targeted by the town's residents, and Marge finds no reason to believe Homer's innocence after she thinks he stole food from the refrigerator. The town moves the Simpson house to the top of a mountain. When Homer shows Marge that he put the food in the snow to preserve it, they suspect Mr. Burns and confront him. He is arrested, and Mayor Quimby punishes him by fining him an amount that he can pay. The townsfolk move the Simpson house back to its original location."
  },
  {
    "seasonNumber": 35,
    "episodeNumberInSeason": 8,
    "title": "Ae Bonny Romance",
    "originalReleaseDate": "2023-12-03",
    "synopsis": "When Bart accidentally intoxicates the schoolchildren, Principal Skinner puts him in Groundskeeper Willie's shack for detention. They bond over a mutual feeling that women have brought misery to them. When Willie seems to have been kidnapped and brought to Scotland, Bart brings the whole family with him to save Willie but learns he is marrying his old girlfriend, Maisie. Bart learns that Maisie's family plans to use Willie's sense of smell to make them rich. When he exposes the plot, Maisie proves her love by breaking Willie's nose to ruin his sense of smell, and they get married. Guest stars: Karen Gillan as Maisie MacWeldon, Paul Higgins as Hamish MacWeldon and \"Ticket Booth\" Actor, David Tennant as Pa MacWeldon, and Belle & Sebastian as themselves and performing \"Willie and the Dream of Peat Bogs\" Note: During the second airing of this episode, it was dedicated in memory of Richard Lewis who died on February 27, 2024."
  },
  {
    "seasonNumber": 35,
    "episodeNumberInSeason": 9,
    "title": "Murder, She Boat",
    "originalReleaseDate": "2023-12-17",
    "synopsis": "At Lisa's behest, the Simpson family boards a pop culture-themed cruise ship. Comic Book Guy shows off his rare action figure. When the valuable figure is beheaded, Bart is the primary suspect and is placed in the ship's jail. When he pleads his innocence, Lisa investigates with Taika Waititi and interviews the passengers. She finds evidence that suggests Bart is guilty, but Comic Book Guy goes missing. Waititi postulates that Comic Book Guy destroyed the figure and escaped with the insurance money. Lisa deduces that Waititi was the culprit because he broke his own figure and replaced it with Comic Book Guy's figure. They find Comic Book Guy, who was hiding in shame after hearing people talk about him. Bart thanks Lisa for believing him, but she hides the fact that she thought he was guilty earlier. Guest stars: Maurice LaMarche as Hedonismbot Cosplayer and Taika Waititi as himself Note: This episode is dedicated in memory of Norman Lear who died on December 5, 2023."
  },
  {
    "seasonNumber": 35,
    "episodeNumberInSeason": 10,
    "title": "Do the Wrong Thing",
    "originalReleaseDate": "2023-12-24",
    "synopsis": "Homer wins a fishing competition when Bart helps him cheat. He and Bart bond over cheating at more sporting events. Marge does not condone their activity, but Homer implies that not cheating hinders their children's opportunities. Meanwhile, Lisa tries to get into the University of Springfield's summer camp program. When Lisa is accepted into the camp's rowing program, she finds altered photos over her on a rowing team. She accuses Homer of cheating for her, but Marge admits that she did it, shocking the family. The family is kidnapped by the camp dean, who says that all admitted applicants are cheaters. Homer is offered a job teaching people how to cheat, but he declines. Guest stars: Ken Marino as Dean Belichick and Dan Patrick as Rock-Skipping Announcer"
  },
  {
    "seasonNumber": 35,
    "episodeNumberInSeason": 11,
    "title": "Frinkenstein's Monster",
    "originalReleaseDate": "2024-02-18",
    "synopsis": "When Homer is offered a job interview at a competing nuclear power plant, he enlists Professor Frink's help to perform well by telling him all the answers. After getting Homer the job, Frink reluctantly agrees to keep up Homer's charade at the job itself with a listening device. However, Homer's new assistant and fellow applicant for the role grows suspicious of her new boss' abilities. She finds the listening device and tells Frink that Homer stole her job, which makes Frink feel guilty. Later, she tells Marge what Homer did, prompting Homer to confess and return to his old job. Guest star: Amanda Seyfried as Dr. Lori Spivak"
  },
  {
    "seasonNumber": 35,
    "episodeNumberInSeason": 12,
    "title": "Lisa Gets an F1",
    "originalReleaseDate": "2024-02-25",
    "synopsis": "When Homer's reckless driving gives Lisa anxiety, her therapist suggests that Lisa try driving a go-kart to make herself feel in control whilst in a vehicle. Lisa likes it so much that she takes up kart racing. When Springfield hosts the next leg of the go-kart racing circuit, Bart befriends Lisa's rival Paolo for money. Homer becomes anxious about his daughter's safety while watching her race. He unsuccessfully tries to stop her. When Paolo learns that Bart is Lisa's brother, he ends their friendship. In the final race, Paolo tampers with Lisa's kart. When Homer sees Lisa driving out of control, he drives onto the track to rescue her, and they reconcile. Guest stars: Matt Berry as Chester Arborday and Rachel Bloom as Annette"
  },
  {
    "seasonNumber": 35,
    "episodeNumberInSeason": 13,
    "title": "Clan of the Cave Mom",
    "originalReleaseDate": "2024-03-24",
    "synopsis": "Marge attends a movie about the Stone Age at a museum with the kids of Springfield Elementary. While there, Bart and Milhouse damage an exhibit. When Milhouse gets tickets for a concert, Luann forbids Bart from going with him after what happened. This causes a war between Marge and Luann where Marge gets better tickets to the concert. Luann tries to remove Marge from the school board, which further angers her. When Luann sees that Marge is denied entry to the concert for using paper tickets instead of electronic ones, she charges in, which scares Bart. Marge comes to her sense and makes peace with Luann. The story is interspersed with scenes of a cavewoman protecting her family from continued threats from a wolf. When the wolf gets injured, the woman treats its wound and domesticates it. Guest stars: Cesar Mazariegos as Violencia Gigante singer and Kerry Washington as Rayshelle Payton"
  },
  {
    "seasonNumber": 35,
    "episodeNumberInSeason": 14,
    "title": "Night of the Living Wage",
    "originalReleaseDate": "2024-04-07",
    "synopsis": "Marge takes a job as a cook at a GimmeChow ghost kitchen to pay off a veterinary bill for a chicken that Snowball II injured. She discovers that her coworkers are overworked and underpaid while GimmeChow CEO Finn Bon Idée becomes a billionaire. Homer and the kids promise to cook food for dinner, but have been secretly ordering GimmeChow in her absence. Sick of the unfairness, Marge convinces her co-workers to form a union to fight the corporate system. As punishment, Marge is forced to deliver food and is fired for being too slow to make a delivery at the Simpson house. Marge is angered at her family's deception. The union goes on strike while Homer is hired as a spokesman for GimmeChow. When the two sides clash in the street, Finn says the workers have been replaced by robots and drones. Feeling guilty, Homer causes an electromagnetic pulse to disable the robots. The workers are rehired, and Marge forgives Homer. Guest star: Jason Mantzoukas as Finn Bon Idée"
  },
  {
    "seasonNumber": 35,
    "episodeNumberInSeason": 15,
    "title": "Cremains of the Day",
    "originalReleaseDate": "2024-04-21",
    "synopsis": "When Larry suddenly dies at Moe's Tavern, Homer, Moe, Lenny, and Carl all attend his funeral and realize that they did not know Larry at all despite spending so much time with him. To make up for it, the group decides to scatter Larry's ashes at a waterfall Larry had pictured in a scrapbook. On the way, Homer and Moe discover that Larry was smuggling sapphires in his body, which are mixed with his ashes, and keep it a secret. When Lenny and Carl find out, they argue until a sheriff arrests them for smuggling. The sheriff, working for Fat Tony, plans to kill them. As they try to escape, Homer is trapped as the sheriff's car rolls down a hill until Larry's urn stops the wheels from moving. When the group arrives at the waterfall, they are not satisfied with the location, so they place Larry’s urn at Moe’s Tavern. Guest star: Joe Mantegna as Fat Tony"
  },
  {
    "seasonNumber": 35,
    "episodeNumberInSeason": 16,
    "title": "The Tell-Tale Pants",
    "originalReleaseDate": "2024-05-05",
    "synopsis": "Homer rips his pants and asks Marge to repair them. Feeling underappreciated by her family and annoyed at Homer, Marge discovers that Homer's pants have a rare feature that is worth thousands of dollars. She keeps it to herself and tells Homer that his pants are not repairable. She sells the pants but feels guilty about spending the money on herself. Meanwhile, Homer wears sweatpants to work. His pants give him a newfound mobility that helps him prevent an accident, so Mr. Burns sends him to a baseball game as a reward. When Marge hears where Homer is, she spends the money on a ring. Homer feels guilty for not inviting Marge to the game while, at home, Marge feels guilty and tries to hide the ring. When Homer comes home, he sees the ring and puts it on Marge's finger, and they reconcile. Guest star: Kipp Lennon as Elton John"
  },
  {
    "seasonNumber": 35,
    "episodeNumberInSeason": 17,
    "title": "The Tipping Point",
    "originalReleaseDate": "2024-05-12",
    "synopsis": "When Homer becomes annoyed with being forced to give gratuity, he tips a waitress one dollar that gets mistakenly interpreted as $10,000. He is praised for his generosity and becomes popular even though he cannot afford it. He becomes addicted to tipping large amounts but is ashamed to face his family as he runs out of money. He goes to the waitress for comfort, but she pushes him away. He ends up in a place when tipping is illegal. Bart and Lisa find him and ask him to come home. Back in Springfield, Homer proposes a tipping ban and is assaulted by the waiters. Guest stars: Kyle Gordon as DJ Crazy Times, Chrissi Poland as Ms. Biljana Electronica, and Audrey Trullinger as Inga"
  },
  {
    "seasonNumber": 35,
    "episodeNumberInSeason": 18,
    "title": "Bart's Brain",
    "originalReleaseDate": "2024-05-19",
    "synopsis": "Bart sells some of Grampa's old army paraphernalia to Herman in exchange for a human brain in a jar. After using it for a prank at school, Bart is forced to take care of it as a school project. He becomes attached to it and gives it a persona. The family becomes worried for Bart's reputation when he continues to care for it after the project ends. At church, he declares the brain his best friend, but the label falls off the jar, revealing to whom the brain belonged. Bart comes to his senses and gives the brain to the university. Guest stars: Megan Mullally as Sarah Wiggum and Kerry Washington as Rayshelle Payton"
  }
]
