[
  {
    "seasonNumber": 34,
    "episodeNumberInSeason": 1,
    "title": "Habeas Tortoise",
    "originalReleaseDate": "2022-09-25",
    "synopsis": "When Homer finds himself publicly humiliated once again, Marge takes Homer to the Springfield Zoo to see the tortoise so he can feel better. When he sees it is missing, he investigates its whereabouts. He joins an online group to solve the mystery behind a missing tortoise. They exchange theories and protest outside the zookeeper's house. Homer enjoys the company, but Marge is worried. When Homer finds the tortoise, he declines to tell the group, so they can stay together. However, when the group starts getting violent ideas to get information from the zookeeper, Homer tells them the truth. The group drifts apart, so Homer starts a new conspiracy theory for them to solve. Guest stars: Joe Mantegna as Fat Tony, Jay Pharoah as Drederick Tatum"
  },
  {
    "seasonNumber": 34,
    "episodeNumberInSeason": 2,
    "title": "One Angry Lisa",
    "originalReleaseDate": "2022-10-02",
    "synopsis": "Homer buys an internet-connected stationary bike for Marge, and she selects Jesse as her instructor. As Marge spends more time with Jesse and goes on private rides with him, Homer gets jealous. Homer goes to Jesse's home and finds him with multiple private rides, so they fight. Marge sees this and goes to Jesse's house. When she sees the multiple private rides, she reconciles with Homer, and they leave. Meanwhile, Lisa is summoned to jury duty and goes through with the process even though she is underage. Selected for a jury, she is angered by the incompetence of everyone involved. Her outbursts cause a mistrial. Guest stars: Jane Kaczmarek as Judge Constance Harm, Joe Mantegna as Fat Tony Note: This episode was removed from the Disney+ streaming platform in Hong Kong for the dialogue \"Behold the wonders of China. Bitcoin mines, forced labor camps where children make smartphones.\""
  },
  {
    "seasonNumber": 34,
    "episodeNumberInSeason": 3,
    "title": "Lisa the Boy Scout",
    "originalReleaseDate": "2022-10-09",
    "synopsis": "Lisa is joining a newly co-ed scouting organization and competing against Bart when the episode is interrupted by two hackers who hold it for ransom. They start showing scenes that were cut from previous episodes that are intended to shock the audience such as Lenny being imaginary and Martin being a married adult. At the same time, the hackers begin falling in love with each other. When the police find them, they threaten to release similar scenes from other Disney intellectual properties, so they are allowed to escape. The hackers return to the broadcast of the episode as Bart and Lisa are found after being lost in the forest and they go home. Guest stars: Anna Faris as Ashley the Female Hacker, Matthew Friend as Baby Jeff Goldblum, Megan Mullally as Sarah Wiggum"
  },
  {
    "seasonNumber": 34,
    "episodeNumberInSeason": 4,
    "title": "The King of Nice",
    "originalReleaseDate": "2022-10-16",
    "synopsis": "Krusty is forced to be the children's entertainment at a party because he needs the money. He learns he can make money being the host of a daytime talk show. Marge is hired as a producer on the show after making some good suggestions for segments. Pressure to constantly think of new segments causes the show to consume Marge's life. The family tries to intervene, but Marge thinks they are jealous of her success. When the harsh working environment is exposed, Marge realizes how much she has changed. Krusty is forced to apologize. He ends the show to become a judge on a courtroom show. Guest stars: Drew Barrymore as herself, Renee Ridgeley as Dr. Wendy Sage, James Sie as Segment Producer #2"
  },
  {
    "seasonNumber": 34,
    "episodeNumberInSeason": 5,
    "title": "Not It",
    "originalReleaseDate": "2022-10-23",
    "synopsis": "Young Homer sees a clown, Krusto, as he is attacked by bullies. Another group protects Homer and drives the bullies away. They share stories of their encounters with Krusto and learn he appears every twenty-seven years to kill children. Meanwhile, Homer writes a love note to Marge. When they watch an old video of Krusto on television, he comes out of it and tries to kill Comic Book Guy. They go to the television station to kill Krusto, but he escapes. Marge thinks the note is from Comic Book Guy, and they kiss. Twenty-seven years later, Homer learns Krusto has returned. Marge, married to Comic Book Guy, goes to help, but he is reluctant to go. Marge's children are kidnapped by Krusto. They return to the television station. Krusto reveals that Comic Book Guy did not write the love note. Marge deduces that Homer wrote the note. They learn they need to destroy the laughter sign to kill Krusto. Comic Book Guy sacrifices himself so Marge can destroy the sign. Krusto dies, and the group leaves with Homer and Marge holding hands."
  },
  {
    "seasonNumber": 34,
    "episodeNumberInSeason": 6,
    "title": "Treehouse of Horror XXXIII",
    "originalReleaseDate": "2022-10-30",
    "synopsis": "In the thirty-third annual Simpsons Halloween special: * \"The Pookadook\": Marge reads Maggie a storybook about a monster that feeds on people's rage and is released by reading the book itself. Marge burns the book but becomes possessed by the monster after breathing the smoke. She chases Maggie, but Maggie touches her cheek, which releases the smoke. Marge traps the smoke with a vacuum cleaner. * \"Death Tome\": Lisa finds a tome that will kill anybody whose name is written in it if the manner of death is different each time. A shinigami tells Lisa she will enjoy using the book. When Mr. Burns' new company plans to accelerate climate change, she uses the book to kill him and anyone else at the company who wants to do so. Bart learns what Lisa is doing. Lisa is tempted to kill him, but she kills the shinigami instead. However, Lisa becomes a shinigami in its place. * \"Simpsonsworld\": In an amusement park based on The Simpsons, robot versions of the Simpson family become self-aware. They attempt to flee the park and destroy anything in their way. When they escape, they discover other parks based on other animated television shows. Guest stars: John Roberts as Linda Belcher, Hank Williams, Jr. singing \"Canyonero!\""
  },
  {
    "seasonNumber": 34,
    "episodeNumberInSeason": 7,
    "title": "From Beer to Paternity",
    "originalReleaseDate": "2022-11-13",
    "synopsis": "Duff Beer holds a new mascot contest, so Duffman fights to remain relevant. He proves that he is not sexist by using a photo of Lisa with him from an old promotional event and claiming she is his daughter. When Homer and Lisa confront Duffman, he reveals he has an estranged daughter named Amber. He asks for their help to reconnect with her. Lisa will only go if they visit the Agatha Christie museum along the way. In the car, Duffman's agent calls about a fan event and tells him to go for the publicity. Because of the detour, they do not arrive at the museum in time, which angers Lisa. Duffman continues alone, but Homer and Lisa find a drawing of Amber in the car and turn around. They learn from Amber that Duffman, who was nervous, did not arrive and is at a nearby party. When a beer barrel breaks loose, Duffman rescues Amber, and they reconcile. Guest stars: Paul Brittain as Brandon, Aubrey Plaza as Amber Duffman Note: This episode was dedicated in memory of David Davis, the spouse of Julie Kavner."
  },
  {
    "seasonNumber": 34,
    "episodeNumberInSeason": 8,
    "title": "Step Brother from the Same Planet",
    "originalReleaseDate": "2022-11-20",
    "synopsis": "Grampa Simpson starts dating Blythe, and Homer gets jealous of the time Grampa spends with her son Calvin. When Grampa moves in with Blythe, Lisa throws parties in his room at the retirement home so she can be popular. When Homer develops an allergy at home, he is forced to share a room with Calvin. They empathize with each other when they see Grampa is treating Calvin better than Homer. They enter a taxidermy contest, where Grampa is made to see his behavior, and he apologizes to Homer. Meanwhile, Lisa's parties get out of control, so she calls the police to stop them. She has Chief Wiggum pretend to arrest her to make her look cool. Guest stars: Carol Kane as Blythe, Melissa McCarthy as Calvin"
  },
  {
    "seasonNumber": 34,
    "episodeNumberInSeason": 9,
    "title": "When Nelson Met Lisa",
    "originalReleaseDate": "2022-11-27",
    "synopsis": "As she graduates from college, Lisa encounters Nelson, and they talk about the past. She considers a life with him, but she leaves without saying goodbye. Five years later, Lisa is married to Hubert Wong when they encounter Nelson. Hubert gloats that he won Lisa's heart, so Nelson attacks him, causing Lisa to leave. Another five years later, Lisa, now single, encounters Nelson. Hubert makes a romantic gesture to win back Lisa, and Nelson tells her to go back to him. Later, Lisa and Nelson see each other at a wedding. With Hubert distracted, they run off together and kiss. Guest stars: Simu Liu as Adult Hubert Wong, Natasha Lyonne as Sophie Krustofsky, Jackie Mason as Rabbi Krustofsky Hologram (archive recording) Note: This episode aired at a special time of 8:30/7:30c."
  },
  {
    "seasonNumber": 34,
    "episodeNumberInSeason": 10,
    "title": "Game Done Changed",
    "originalReleaseDate": "2022-12-04",
    "synopsis": "Bart discovers a glitch in an online multiplayer game that allows him to duplicate items on old computers, so he uses the outdated computers at school to make money selling the items. When Principal Skinner finds out, Bart convinces him to join with promises that they can use the profits to benefit Springfield Elementary. Meanwhile, Marge discovers that she can communicate with Maggie in the game via emojis. When Bart's group is attacked in the game by a rival school, Bart and Skinner go to negotiate. Bart agrees to divide territory, but Skinner refuses. When they start losing the war, Skinner tries to bulldoze the rival school. Bart brings Skinner to his senses, and they end the scheme. Later, Ned sees that the other Simpsons have become addicted to the game. Guest star: Montse Hernandez as Astrid"
  },
  {
    "seasonNumber": 34,
    "episodeNumberInSeason": 11,
    "title": "Top Goon",
    "originalReleaseDate": "2022-12-11",
    "synopsis": "King Toot flaunts his trophy for coaching a winning children's ice hockey team to Moe. Jealous, Moe coaches Bart's ice hockey team the next season. Moe feels that Nelson Muntz could be the enforcer he needs to protect top-scorer Bart from violent opponents. Moe takes Nelson under his wing and sends him to Top Goon Academy where he learns how to harness his aggression to protect his primary. When Bart pranks Moe, Nelson, thinking Moe is his primary, breaks Bart's arm. An angry Moe kicks Nelson off the team, so he joins Fat Tony's gang. When Moe goes to apologize, he learns Nelson thinks Moe is the primary. He finds Nelson as he attacks King Toot and stops him. Moe apologizes and steals King Toot's trophy for Nelson. Guest stars: Will Forte as King Toot, Stu Grimson as Himself, Joe Mantegna as Fat Tony, Dave Schultz as Himself, Tiger Williams as Himself"
  },
  {
    "seasonNumber": 34,
    "episodeNumberInSeason": 12,
    "title": "My Life as a Vlog",
    "originalReleaseDate": "2023-01-01",
    "synopsis": "The ups and downs of the Simpsons' social media presence are revealed from the perspective of a YouTube user. When videos of the Simpsons go viral, each family member gets their own channel. As they become rich and famous, another set of videos begins to appear showing the Simpsons performing misdeeds. The Simpsons announce they will be making a statement, but they suddenly disappear. Other people begin posting their theories, and they converge at the Simpson mansion. They discover the Simpsons locked in their panic room. The family members reconnected with each other during their time in the room and vow to stop making videos. Guest stars: Michael Rapaport as Mike Wegman, Bob the Drag Queen as Herself, Monét X Change as Herself Note: This episode was dedicated in memory of Chris Ledesma, the longtime music editor of the series."
  },
  {
    "seasonNumber": 34,
    "episodeNumberInSeason": 13,
    "title": "The Many Saints of Springfield",
    "originalReleaseDate": "2023-02-19",
    "synopsis": "Ned is fired from Springfield Elementary when he makes Nelson pray. With nowhere to go, he meets Fat Tony in a Catholic church. Tony offers to fund the Leftorium, and they become friends. Lisa tries to explain to Ned what Fat Tony does, but he does not believe her. Concerned, he confronts Fat Tony who admits it. He then threatens Ned's life by destroying his house and church. He hides with the Simpsons in their attic, but he goes to confront Fat Tony again. After talking, Ned reveals he has been working with the FBI, and Fat Tony is arrested. Guest star: Paul Fusco as ALF, Kipp Lennon as Italian American Singer, Joe Mantegna as Fat Tony Note: This episode was dedicated in memory of David Crosby."
  },
  {
    "seasonNumber": 34,
    "episodeNumberInSeason": 14,
    "title": "Carl Carlson Rides Again",
    "originalReleaseDate": "2023-02-26",
    "synopsis": "After getting into shape, Carl wears a belt buckle depicting a bull rider to hold up his pants. While bowling, he meets a woman named Naima, who agrees to go on a date with him. To get new clothes for his date, he trades his belt buckle. On the date, he fails to impress Naima because he lies about who he is. At Moe's, he says the only thing he had from his parents was his belt buckle. Homer and Carl track it down and learn that Carl descends from a slave who became a cowboy, and Carl's father was a bull rider who won the belt buckle as a prize. He decides to ride a bull and invites Naima to watch. He lasts only a few seconds, but Naima is happy that Carl learned from where he came. Guest star: John Autry II as Monk Murphy, Henry Louis Gates Jr. as himself"
  },
  {
    "seasonNumber": 34,
    "episodeNumberInSeason": 15,
    "title": "Bartless",
    "originalReleaseDate": "2023-03-05",
    "synopsis": "Homer and Marge become enraged at Bart for defacing the books at school, only to discover that others are thanking him for getting the younger children interested in reading by making it fun. Feeling guilty, Homer and Marge suddenly become introspective about their feelings towards their son, wondering if they have been too harsh on him over the years, simply because they are his parents. Wishing they could see Bart through the eyes of people that are not his parents, Homer and Marge dream of a world where Bart was never born. In the dream, Homer and Marge have successful jobs. One day, they accidentally hit Bart with their car and take him home when he has amnesia. He annoys the family, but indirectly improves their lives. When Chief Wiggum arrives to take the boy away back to the orphanage, Homer and Marge run after him. They wake up and tell Bart they like him the way he is. Guest star: Kerry Washington as Rayshelle Peyton"
  },
  {
    "seasonNumber": 34,
    "episodeNumberInSeason": 16,
    "title": "Hostile Kirk Place",
    "originalReleaseDate": "2023-03-12",
    "synopsis": "Kirk Van Houten is angry that the schoolchildren are learning about the collapse of the Great Springfield Gazebo that was blamed on his ancestor. He demands that the school stop teaching it. Meanwhile, Homer tries to earn money making shirts containing electric signs. Kirk and his supporters force Mayor Quimby into giving in to his demands. Weeks later, Kirk has taken control of the town with Homer supplying his supporters with shirts. Kirk builds a new gazebo. To celebrate its opening, he plays an electric guitar. Combined with the electricity in his supporters' shirts, the resultant electric wave causes the gazebo to collapse. Guest star: Kerry Washington as Rayshelle Peyton, \"Weird Al\" Yankovic as himself"
  },
  {
    "seasonNumber": 34,
    "episodeNumberInSeason": 17,
    "title": "Pin Gal",
    "originalReleaseDate": "2023-03-19",
    "synopsis": "Homer learns that Barney's Bowlarama is being turned into a trendy hangout by Terrence, so he asks the hipster to give him a week to prove that bowling is still popular. After Homer convinces a reluctant Marge to bowl, her impressive performance sees Terrence offering to keep the Bowlarama alive if she beats an opponent of his choice. Homer hires a coach to help Marge and chooses Jacques, unaware of their prior history together. When Homer discovers what happened, he fights Jacques but forgives Marge. At the bowling match, Terrence selects Jacques as her opponent. Marge wins a close match, so Terrence keeps only one bowling lane open to create demand. Guest stars: Fred Armisen as Terrence, A. Brooks as Jacques"
  },
  {
    "seasonNumber": 34,
    "episodeNumberInSeason": 18,
    "title": "Fan-ily Feud",
    "originalReleaseDate": "2023-04-23",
    "synopsis": "Homer publicly insults pop singer Ashlee Starling after her fans interrupt a baseball game. This quickly makes him the target of her unrelenting fanbase of whom Lisa is a member. While Homer's own family betrays him, he is kidnapped by Echo, Ashlee's rival. Echo vows to protect Homer, and a war ensues between the two fanbases. Ashlee invites Marge to dinner and uses her to write a song about Marge and Homer's past relationship difficulties. He goes to Echo, and they write a song about how Homer loves his family. They reconcile, and Ashlee's fanbase stops attacking Homer due to his apparently terrible song. Guest stars: Billy Eichner as Billy, Jade Novah as Ashlee Starling and Echo"
  },
  {
    "seasonNumber": 34,
    "episodeNumberInSeason": 19,
    "title": "Write Off This Episode",
    "originalReleaseDate": "2023-04-30",
    "synopsis": "When Homer is sprayed by skunks, Marge uses simple ingredients to rid his clothes of the smell. Lisa suggests that she and Marge should create a charitable organization to help the local homeless population clean their clothes. Lisa attempts to make their institution as morally clean and ideal as possible. While Lisa leaves to find ingredients from ethical sources, Marge takes large monetary donations to build a fancy headquarters for the charity. Lisa and Marge fight about the purpose of the charity, and Lisa is removed from control. At a gala for the opening of the headquarters, Marge sees the error of her ways and returns control to Lisa. She immediately turns the headquarters into a homeless shelter, which shocks the rich gala attendees who were only donating to make themselves feel good."
  },
  {
    "seasonNumber": 34,
    "episodeNumberInSeason": 20,
    "title": "The Very Hungry Caterpillars",
    "originalReleaseDate": "2023-05-07",
    "synopsis": "Springfield is in lockdown mode when a caterpillar infestation hits the town. When Maggie only wants to eat food with ranch dressing, Flanders refuses to give any to Homer after he insults him. Later, when Homer and Marge attempt to steal it, he and Flanders fight until Flanders comes to his senses. Meanwhile, Bart is learning remotely, and he catches Principal Skinner's mother give his cousin Peter his security blanket. With the other children, he helps Skinner get it back and kick Peter out of their house. At the same time, Lisa, scared of the caterpillars, pretends to be in her dollhouse and tries to stay sealed off. When a caterpillar gets in, she learns not to fear it. The lockdown ends when the caterpillars become cocoons. Guest star: Rob Lowe as Cousin Peter"
  },
  {
    "seasonNumber": 34,
    "episodeNumberInSeason": 21,
    "title": "Clown V. Board of Education",
    "originalReleaseDate": "2023-05-14",
    "synopsis": "When Krusty learns that clowning is a dying profession, he opens a clown school for children. Bart joins and finally discovers a love for going to school. When other kids follow in his footsteps, Krusty soon discovers his new school is not only more successful than he imagined, but more personally rewarding too. However, Fat Tony forcibly takes over the school to take money out of it. Krusty goes to the police for help. He wears a recording device to incriminate Fat Tony and is caught, but the children protect him. Instead, Fat Tony burns down the school for money. Guest star: Joe Mantegna as Fat Tony"
  },
  {
    "seasonNumber": 34,
    "episodeNumberInSeason": 22,
    "title": "Homer's Adventures Through the Windshield Glass",
    "originalReleaseDate": "2023-05-21",
    "synopsis": "After discovering Marge has been hiding something from him, Homer becomes so incensed that he crashes his car into a fire hydrant. Time seems to slow as Homer finds himself flying through the car's windshield and sees a projection of his psyche in the form of Maggie's elf doll Goobie Woo. Homer recounts learning that Marge's father, Clancy, left her money each month because he did not trust Homer. He assumes that Marge spends that money on herself, but the doll says she uses that money when Homer gets into trouble. Homer dies and goes to Hell. He finds Clancy, who shows him a future with Lisa's terrible boyfriend. Homer empathizes with how Clancy felt, which sends him back to Earth. When the family arrives at the scene of the accident, Marge uses some of her money for painkillers for Homer while Maggie collects her doll. Guest stars: Lizzo as Goobie Woo and herself, Tim Robinson as Mercer and Bowen Yang as Richard"
  }
]
