[
  {
    "seasonNumber": 5,
    "episodeNumberInSeason": 1,
    "title": "Homer's Barbershop Quartet",
    "originalReleaseDate": "1993-09-30",
    "synopsis": "In a flashback, Homer recounts his time with a barbershop quartet called The Be Sharps that also featured Principal Skinner, Apu and Chief Wiggum who was later replaced with Barney. The group became music stars with their hit song \"Baby on Board\" and won a Grammy. Eventually, Homer started missing his family and the group began to lose its popularity, so it broke up. Guest stars: George Harrison and David Crosby"
  },
  {
    "seasonNumber": 5,
    "episodeNumberInSeason": 2,
    "title": "Cape Feare",
    "originalReleaseDate": "1993-10-07",
    "synopsis": "Bart starts receiving threatening letters in the mail and it is soon revealed that they were sent to him by Sideshow Bob. Bob is released from prison, so Bart is placed in the Witness Relocation Program and the Simpson family is moved to Terror Lake. However, Bob follows the Simpsons there and sneaks onto the family's houseboat and tries to kill Bart. Cornered, Bart asks Bob to sing the entire score of H.M.S. Pinafore as a last request. Bob does so, and during his performance the boat drifts through Springfield and Bob is caught."
  },
  {
    "seasonNumber": 5,
    "episodeNumberInSeason": 3,
    "title": "Homer Goes to College",
    "originalReleaseDate": "1993-10-14",
    "synopsis": "After failing a test at the nuclear plant, Homer's lack of a college degree is revealed and he is sent back to pass a nuclear physics class. Homer, having seen too many bad National Lampoon's Animal House knock-off movies, goofs off, so he is sent to a group of boys for tutoring. The boys, who are stereotypical nerds, try to help Homer, but he instead tries to help them party and decides to pull a prank on another college. They steal Springfield A&M's mascot, but his friends are caught and expelled. Homer invites them to live with him, but his family soon become angered by their new housemates, so Homer decides to try to help them get back into college. Consequentially, he fails his final exam and is convinced by Marge to return to college for another year."
  },
  {
    "seasonNumber": 5,
    "episodeNumberInSeason": 4,
    "title": "Rosebud",
    "originalReleaseDate": "1993-10-21",
    "synopsis": "After a disastrous birthday party, Mr. Burns pines for his long-lost childhood toy, a teddy bear named Bobo. The bear ends up in the hands of Maggie and when Homer discovers this, he tries to use the bear to get a large reward from Burns. When Burns agrees, Homer tries to hand the bear over, but is stopped by Maggie. Homer, seeing that Maggie has become attached to the bear, decides not to give it back to Mr. Burns, who promises that Homer will regret the decision. Mr. Burns later returns and talks to Maggie and she eventually gives it back to him."
  },
  {
    "seasonNumber": 5,
    "episodeNumberInSeason": 5,
    "title": "Treehouse of Horror IV",
    "originalReleaseDate": "1993-10-28",
    "synopsis": "In a parody of Night Gallery, Bart tells three scary stories based on paintings: * \"The Devil and Homer Simpson\": Homer sells his soul to the Devil (Ned Flanders) for a doughnut. * \"Terror at 5½ Feet\": While riding the bus to school, Bart discovers that there is a Gremlin on the side of the bus. * \"Bart Simpson's Dracula\": The Simpsons are invited to a dinner with Mr. Burns, where Bart and Lisa discover that Mr. Burns is a vampire."
  },
  {
    "seasonNumber": 5,
    "episodeNumberInSeason": 6,
    "title": "Marge on the Lam",
    "originalReleaseDate": "1993-11-04",
    "synopsis": "Marge and neighbor Ruth Powers have a girls' night. Meanwhile, Homer tries to have fun without Marge and Lionel Hutz is hired as Bart, Lisa, and Maggie's babysitter. Homer hitches a ride home with Chief Wiggum, who is following behind Marge and Ruth and decides to pull them over. However, Ruth speeds her car up and reveals to Marge that she stole it from her ex-husband. Marge decides to stay with Ruth, but eventually the police catch up with them and the charges are dismissed."
  },
  {
    "seasonNumber": 5,
    "episodeNumberInSeason": 7,
    "title": "Bart's Inner Child",
    "originalReleaseDate": "1993-11-11",
    "synopsis": "Marge realizes that she is no fun because of her constant nagging and seeks help from self-help guru Brad Goodman, who then uses Bart's irreverent attitude as a new example of how people should behave. The entire town of Springfield begins to act like Bart, who at first enjoys things but begins to feel that his role as a troublemaker is usurped. During the inaugural \"Do what you feel\" festival, several things go wrong and the town decides to stop acting like Bart."
  },
  {
    "seasonNumber": 5,
    "episodeNumberInSeason": 8,
    "title": "Boy-Scoutz 'n the Hood",
    "originalReleaseDate": "1993-11-18",
    "synopsis": "Bart and Milhouse find $20.00 on the street and buy a Squishee made entirely of syrup. After a night of bingeing and carousing, Bart wakes up to discover that he has joined a Boy Scouts-esque troupe called \"The Junior Campers\". Bart initially hates the group, then enjoys it, until Homer agrees to participate in their river-rafting trip. In a boat with Ned and Rod Flanders, Homer loses their map and the boat gets lost in the ocean. After being stuck out at sea for a week, they discover an offshore oil rig with a Krusty Burger and are saved. At the end of the episode, the rest of the campers including Ernest Borgnine are attacked by an unknown monster at an abandoned campsite. Guest star: Ernest Borgnine"
  },
  {
    "seasonNumber": 5,
    "episodeNumberInSeason": 9,
    "title": "The Last Temptation of Homer",
    "originalReleaseDate": "1993-12-09",
    "synopsis": "Mr. Burns hires a female worker named Mindy Simmons in accordance with government policy and Homer is worried that his crush on her will ruin his marriage with Marge. Both Mindy and Homer have feelings for each other, but in the end Homer decides not to cheat on Marge. Meanwhile, Bart becomes a nerd after doctors find several things physically wrong with him and apply treatments that make him look like a nerd. Guest star: Michelle Pfeiffer"
  },
  {
    "seasonNumber": 5,
    "episodeNumberInSeason": 10,
    "title": "$pringfield (or, How I Learned to Stop Worrying and Love Legalized Gambling)",
    "originalReleaseDate": "1993-12-16",
    "synopsis": "After the local economy stalls, everyone in town votes for gambling to be legalized, prompting Mr. Burns to open a casino. Homer becomes a blackjack dealer, and Marge becomes so addicted to gambling that she forgets about her family life. Meanwhile, Bart opens up his own casino after being kicked out of Mr. Burns's and Lisa struggles to have her costume done for a school pageant. Homer agrees to help her, but does a terrible job, so he decides to go to the casino to get Marge back. Guest stars: Gerry Cooney and Robert Goulet"
  },
  {
    "seasonNumber": 5,
    "episodeNumberInSeason": 11,
    "title": "Homer the Vigilante",
    "originalReleaseDate": "1994-01-06",
    "synopsis": "A crime wave hits Springfield, caused by the elusive cat burglar and Lisa's saxophone is stolen, so Homer agrees to try to get it back. The police are ineffective, so Flanders creates a neighborhood watch group, which Homer takes charge of. However, Homer's incompetence causes the vigilante group to commit more crimes than it prevents, and they are unsuccessful in catching the cat burglar. With the help of Grampa, Homer discovers that the burglar is a charming senior named Malloy. Malloy is arrested, but he tricks the citizens of Springfield into thinking he has hidden millions of dollars and escapes during the ensuing rush to find the money."
  },
  {
    "seasonNumber": 5,
    "episodeNumberInSeason": 12,
    "title": "Bart Gets Famous",
    "originalReleaseDate": "1994-02-03",
    "synopsis": "After sneaking away from a school trip to a box factory, Bart sneaks onto the set of the Krusty the Clown show. He gets a job as Krusty's production assistant and soon becomes sick of the job. One day, he is close to quitting, but Krusty runs up and says he needs to use Bart in a sketch. Bart becomes an accidental star when he says, \"I didn't do it\" during the botched sketch. He becomes famous but soon becomes tired of being known for one line. Marge convinces him that the main thing is to make people happy, so Bart decides to continue, but the audience soon becomes tired of Bart's act and forget about him. Guest star: Conan O'Brien"
  },
  {
    "seasonNumber": 5,
    "episodeNumberInSeason": 13,
    "title": "Homer and Apu",
    "originalReleaseDate": "1994-02-10",
    "synopsis": "After twice getting food poisoning from expired food sold at the Kwik-E-Mart, Homer teams up with Kent Brockman to report Apu. Apu is fired from his job and comes to stay with the Simpsons, and he is replaced by actor James Woods. Homer resolves to help Apu get his old job back, and the two travel to India to talk to the owner of the Kwik-E-Mart, but are unsuccessful. Apu decides to visit his old Kwik-E-Mart and saves James Woods's life. Woods is so grateful that he helps Apu get rehired. Guest star: James Woods"
  },
  {
    "seasonNumber": 5,
    "episodeNumberInSeason": 14,
    "title": "Lisa vs. Malibu Stacy",
    "originalReleaseDate": "1994-02-17",
    "synopsis": "Lisa protests against the phrases on her new Talking Malibu Stacy doll, which she finds demeaning to women. She tracks down the reclusive creator Stacy to make a more politically correct doll. Meanwhile, Grampa is worried that he is getting old, so he takes a job at Krusty Burger. Lisa and Stacy create \"Lisa Lionheart\" which gets a lot of positive buzz, but is a flop when the Malibu Stacy executives release a new doll that comes with a hat. Guest star: Kathleen Turner"
  },
  {
    "seasonNumber": 5,
    "episodeNumberInSeason": 15,
    "title": "Deep Space Homer",
    "originalReleaseDate": "1994-02-24",
    "synopsis": "NASA decides that they need to hire average joes in order to get higher television ratings. They recruit Homer and Barney to train to be the first average American in space. Homer, who wants to be respected, is the winner by default, and goes into space with Buzz Aldrin. While there, he causes a lot of havoc and eventually breaks the handle on the space shuttle's hatch. Homer inadvertently seals the door shut with an inanimate carbon rod, and the shuttle returns to Earth. The rod is hailed as a hero, but Homer gains the respect of Aldrin and his family."
  },
  {
    "seasonNumber": 5,
    "episodeNumberInSeason": 16,
    "title": "Homer Loves Flanders",
    "originalReleaseDate": "1994-03-17",
    "synopsis": "Homer begins to like Flanders after being invited to a football game. However, Homer's constant presence around Flanders and his family causes Ned to feel hate for Homer. One day while trying to drive away from Homer, Flanders is arrested and charged with drunk driving. Flanders begins to lose the respect of the church congregation until Homer sticks up for him. Flanders thanks Homer and the two remain friends."
  },
  {
    "seasonNumber": 5,
    "episodeNumberInSeason": 17,
    "title": "Bart Gets an Elephant",
    "originalReleaseDate": "1994-03-31",
    "synopsis": "While stuck cleaning the house, Bart wins a radio contest and chooses a gag prize, an elephant, instead of the real prize, $10,000 cash. The radio station eventually gets Bart his elephant, which is named Stampy. When taking care of Stampy gets too expensive Homer decides to sell him to an ivory dealer rather than turn him over to a non-profit Animal Refuge. Bart tries to run away with Stampy, but the elephant escapes. They track him down, and Homer agrees to give him to the Animal Refuge."
  },
  {
    "seasonNumber": 5,
    "episodeNumberInSeason": 18,
    "title": "Burns' Heir",
    "originalReleaseDate": "1994-04-14",
    "synopsis": "Mr. Burns has a near-death experience which prompts him to find an heir to inherit his wealth after he dies. Bart is rejected, but Burns soon decides to choose him after seeing that Bart is \"a creature of pure malevolence\". Marge convinces Bart to go spend some time with Burns, and soon becomes more disruptive than normal to his own family and decides to go live with Mr. Burns. Bart eventually starts to miss his family, but Burns manipulates him into staying. Burns tries to have Bart prove his loyalty by firing Homer, but Bart instead decides to go back to living with his family."
  },
  {
    "seasonNumber": 5,
    "episodeNumberInSeason": 19,
    "title": "Sweet Seymour Skinner's Baadasssss Song",
    "originalReleaseDate": "1994-04-28",
    "synopsis": "Bart accidentally gets Principal Skinner fired after he brings Santa's Little Helper to school for show and tell. Bart feels guilty for what he did, and befriends Skinner. Meanwhile, Ned Flanders is hired as principal and the school goes to pot. Bart decides that while he enjoys having Skinner as a friend, he needs him as an enemy, but discovers that he returned to the Army to be a sergeant. Bart convinces Skinner to return and they get Flanders fired so that Skinner can get his old job back. Note: This is the show's 100th episode."
  },
  {
    "seasonNumber": 5,
    "episodeNumberInSeason": 20,
    "title": "The Boy Who Knew Too Much",
    "originalReleaseDate": "1994-05-05",
    "synopsis": "Bart plays hooky from school and ends up at the birthday party of Freddy Quimby, the Mayor's nephew, where Freddy is accused of assaulting a waiter. Bart knows the truth, but would have to admit that he was playing hooky if he testifies. Meanwhile, Homer is chosen for jury duty in the assault case against Freddy Quimby and takes advantage of being sequestered in a hotel."
  },
  {
    "seasonNumber": 5,
    "episodeNumberInSeason": 21,
    "title": "Lady Bouvier's Lover",
    "originalReleaseDate": "1994-05-12",
    "synopsis": "While attending Maggie's first birthday party, Grampa falls for Marge's mother Jacqueline. Grampa and Jacqueline start dating, but he is soon pushed aside in favor of Mr. Burns. Mr. Burns and Jacqueline are soon engaged to be married, much to the chagrin of Marge and Smithers. Grampa crashes the wedding and tries to get Jacqueline back, but she decides that she does not want to be married. Meanwhile, Bart steals Homer's credit card to buy a piece of Itchy and Scratchy memorabilia that turns out to be a rip-off."
  },
  {
    "seasonNumber": 5,
    "episodeNumberInSeason": 22,
    "title": "Secrets of a Successful Marriage",
    "originalReleaseDate": "1994-05-19",
    "synopsis": "Tired of being called \"slow,\" Homer signs up to teach a class on keeping a successful marriage at a learning annex. He is an unsuccessful teacher and finds that the only way he can keep the class interested is to tell racy secrets about Marge and their bedroom antics. Marge soon gets fed up with Homer telling their secrets and kicks him out. Homer starts living in Bart's treehouse and becomes so lost without Marge that he begs her to take him back, and she eventually agrees."
  }
]
