[
  {
    "seasonNumber": 14,
    "episodeNumberInSeason": 1,
    "title": "Treehouse of Horror XIII",
    "originalReleaseDate": "2002-11-03",
    "synopsis": "The thirteenth Treehouse of Horror episode, consisting of three self-contained segments. Send in the Clones – Homer buys a hammock that can produce clones of himself. He creates numerous clones to help him around the house, but they soon overrun Springfield. The Fright to Creep and Scare Harms – Lisa petitions the town to get rid of their firearms after discovering the gravestone of a young man named William Bonney who died from gun violence. However, Lisa soon discovers that William Bonney is the real name of Western outlaw Billy the Kid, whose undead corpse, along with Frank James, Jesse James, the Sundance Kid, and Kaiser Wilhelm II, takes over the defenseless town. The Island of Dr. Hibbert – Dr. Hibbert invites the citizens of Springfield to his island resort, where he turns them into animals."
  },
  {
    "seasonNumber": 14,
    "episodeNumberInSeason": 2,
    "title": "How I Spent My Strummer Vacation",
    "originalReleaseDate": "2002-11-10",
    "synopsis": "A drunken Homer appears on the show Taxicab Conversations and rants about how awful his life as a husband and father is. Although his family is at first outraged, they realise that they do somewhat burden him and decide to make up for it by sending him to a Rock 'n Roll Fantasy Camp where he mingles with rock stars, including Mick Jagger and Keith Richards. The rock stars ask Homer to help out at a concert and, expecting that he will be allowed to perform, he accepts. Actually, they want him to test the microphones; however, a humiliated Homer grabs a guitar and starts playing. Guest stars: Mick Jagger, Keith Richards, Lenny Kravitz, Elvis Costello, Brian Setzer and Tom Petty."
  },
  {
    "seasonNumber": 14,
    "episodeNumberInSeason": 3,
    "title": "Bart vs. Lisa vs. the Third Grade",
    "originalReleaseDate": "2002-11-17",
    "synopsis": "The Simpsons buy a satellite television, which Bart spends so much time watching that he does not study for an important achievement test. He scores so low that Principal Skinner demotes him to third grade, while Lisa does so well that she is moved up to third grade. The two are placed in the same class and become rivals. During a trip to Capital City, they get separated from their class and are forced to help each other in order to find their classmates."
  },
  {
    "seasonNumber": 14,
    "episodeNumberInSeason": 4,
    "title": "Large Marge",
    "originalReleaseDate": "2002-11-24",
    "synopsis": "Thinking Homer does not find her attractive anymore, Marge chooses to get liposuction, but instead receives breast implants. She becomes adored by many of the men in Springfield, and becomes a spokesmodel for trade shows. Meanwhile, Bart and Milhouse try to imitate a stunt they saw on an episode of Batman that guest stars Krusty the Clown. When the stunt ends badly, media watchdog groups blame Krusty, forcing the clown to make his show more safety-conscious and less fun. Guest stars: The Baha Men (Patrick Carey, Omerit Hield and Marvin Prosper), Jan Hooks, Adam West and Burt Ward."
  },
  {
    "seasonNumber": 14,
    "episodeNumberInSeason": 5,
    "title": "Helter Shelter",
    "originalReleaseDate": "2002-12-01",
    "synopsis": "The Simpson family has to find temporary residence while their house is fumigated for termites. When they run out of options, they decide to become contestants on a reality show where families live in the manner that people did in 1895. The family is initially miserable, but slowly adapt to their new life, which causes the show to lose ratings. The producers decide to try to boost viewers by dumping the house in a river and forcing the family to survive in the wilderness. However, the Simpsons find a bunch of rejects from other reality shows and they attack the producers. Guest stars: Larry Holmes and David Lander. Note: This is the final aired episode to use traditional cel animation."
  },
  {
    "seasonNumber": 14,
    "episodeNumberInSeason": 6,
    "title": "The Great Louse Detective",
    "originalReleaseDate": "2002-12-15",
    "synopsis": "The Simpson family win a free spa weekend, and Homer is nearly killed when a mysterious figure locks him in a sauna. Chief Wiggum hires someone who can think like a murderer in order to find one. Bart's mortal enemy Sideshow Bob is sent to live with the Simpsons so he can help find Homer's attempted killer. Bob and Homer track down the attempted murderer and discover that it is Frank Grimes, Jr., the son of a man that Homer drove to insanity (in the season eight episode \"Homer's Enemy\"). After Grimes is arrested, Bob tries to kill Bart, but he finds that he has \"[[I've Grown Accustomed to Her Face|grown accustomed to [his] face]]\" and cannot harm him. Guest star: Kelsey Grammer."
  },
  {
    "seasonNumber": 14,
    "episodeNumberInSeason": 7,
    "title": "Special Edna",
    "originalReleaseDate": "2003-01-05",
    "synopsis": "Ms. Edna Krabappel begins to lose faith in her relationship with Principal Skinner and becomes depressed. Bart wants to cheer her up and nominates her for the Teacher of the Year Award. Ms. Krabappel and the Simpsons are given a free trip to Epcot Center in Orlando, Florida. Skinner decides that he needs to do something to win Edna back, so he follows them there. He tries to sabotage Edna's chances of winning the award, in hopes that she will become so depressed that she will come back to him. However, he has a change of heart and proposes to her. Guest star: Little Richard."
  },
  {
    "seasonNumber": 14,
    "episodeNumberInSeason": 8,
    "title": "The Dad Who Knew Too Little",
    "originalReleaseDate": "2003-01-12",
    "synopsis": "Homer disappoints Lisa on her birthday when he gives her a thoughtless present. He realizes that he knows little about her and hires private detective Dexter Colt to spy on her. Colt compiles a report, the information from which helps Homer bond with his daughter. However, Colt soon demands to be paid $1000, which Homer refuses. In retaliation, Colt vandalises an animal research lab and steals all the animals, leaving behind several clues that implicate Lisa. Homer and Lisa go on the run as fugitives and end up at a circus, where they meet Colt. He tries to kill Homer, but Lisa saves him. Later, Colt is arrested and Lisa exonerated. She finally receives the present she wanted from Homer. Guest star: Elliott Gould."
  },
  {
    "seasonNumber": 14,
    "episodeNumberInSeason": 9,
    "title": "The Strong Arms of the Ma",
    "originalReleaseDate": "2003-02-02",
    "synopsis": "Marge gets mugged and becomes so traumatized that she develops agoraphobia. She hides in the basement. Having little else to do, she exercises with a weight set Homer bought from Rainier Wolfcastle's garage sale. She becomes so strong and confident that she is able to leave the basement. She continues working out and starts taking steroids so she can enter a bodybuilding competition. One night at Moe's Tavern she loses her temper and starts destroying the bar and fighting all of the patrons. Homer confronts Marge and says he misses the sweet woman that he married. Marge, horrified at what she has done, apologizes and agrees to stop working out. Guest star: Pamela Reed. Note: This is the show's 300th episode."
  },
  {
    "seasonNumber": 14,
    "episodeNumberInSeason": 10,
    "title": "Pray Anything",
    "originalReleaseDate": "2003-02-09",
    "synopsis": "Homer becomes depressed when he sees that Ned Flanders seems to be better off than him. To remedy this, he begins to pray constantly. Meanwhile, the Simpsons discover that tree roots have clogged up their plumbing. The house becomes too run down to live in, and Homer prays for a solution. Homer is injured while attending church; he sues Reverend Lovejoy and is awarded the deed to the church. He throws a huge house-warming party, in which all of the partiers drink and engage in sinful activities. It suddenly starts raining and the town begins to flood. The townspeople flee to the roof of the church. Homer tries praying again but the flood keeps rising. Reverend Lovejoy returns in a helicopter and leads everyone in prayer, asking God to forgive them, and the rain stops. Guest stars: Lisa Leslie and Ken Burns."
  },
  {
    "seasonNumber": 14,
    "episodeNumberInSeason": 11,
    "title": "Barting Over",
    "originalReleaseDate": "2003-02-16",
    "synopsis": "Bart learns that he was once a child actor in commercials and that all the money earned was spent by Homer. In retaliation, Bart petitions the court to have himself legally emancipated from his parents and moves out of the Simpson house. Bart is initially miserable in his new apartment, but discovers that skateboarder Tony Hawk lives on one of the floors above. He and Hawk become friends, and Bart is content with his new life. Homer apologizes to Bart and requests that he return home. Bart accepts the apology, but tells his family that he is going on tour with Hawk. At an event, Homer speaks to Bart and finally promises Bart that he will never treat him badly again. Guest stars: Blink-182 (Travis Barker, Tom DeLonge and Mark Hoppus), Tony Hawk, and Jane Kaczmarek."
  },
  {
    "seasonNumber": 14,
    "episodeNumberInSeason": 12,
    "title": "I'm Spelling as Fast as I Can",
    "originalReleaseDate": "2003-02-16",
    "synopsis": "Lisa competes at a spelling bee and earns the right to compete in the Spell-lympics, becoming the pride of the town. The host of the show George Plimpton, asks her to intentionally lose so that a more popular boy can win. Lisa refuses and continues to compete, but accidentally misspells a word and loses. Meanwhile, Homer tours with a group obsessed with eating Krusty Burger's latest sandwich. Guest star: George Plimpton."
  },
  {
    "seasonNumber": 14,
    "episodeNumberInSeason": 13,
    "title": "A Star Is Born Again",
    "originalReleaseDate": "2003-03-02",
    "synopsis": "During the annual Jellyfish Festival, Ned Flanders realizes that he is lonely and becomes depressed. One night, he meets a beautiful woman, who asks him out on a date. He soon learns that the woman is Sara Sloane, a famous actress. Sloane is charmed by Flanders' wholesomeness, and they continue to date to the point at which she asks that he move to Hollywood. Flanders, worried that Hollywood would conflict with his conservative Christian values, refuses, so Sloane instead chooses to stay in Springfield. However, their relationship does not work out, due to his insistence on marriage. Guest stars: James L. Brooks, Helen Fielding and Marisa Tomei."
  },
  {
    "seasonNumber": 14,
    "episodeNumberInSeason": 14,
    "title": "Mr. Spritz Goes to Washington",
    "originalReleaseDate": "2003-03-09",
    "synopsis": "An air traffic route is redirected so that airplanes start flying directly over the Simpsons' house. The noise starts to disrupt their lives and, desperate for a solution, the family turns to their Congressman. However, he dies of a heart attack, so they ask Krusty the Clown to run for Congress so that he can help them. Krusty is successful in his campaign, but finds that his air traffic bill is ignored by the veteran Congressmen. He soon becomes disillusioned with the system, so the Simpsons, with guidance from Walter Mondale, help him out by blackmailing one of his opponents and attaching the bill to a more popular one. The bill passes, and the air traffic is re-routed. Guest star: Joe Mantegna."
  },
  {
    "seasonNumber": 14,
    "episodeNumberInSeason": 15,
    "title": "C.E.D'oh",
    "originalReleaseDate": "2003-03-16",
    "synopsis": "Homer tries for a promotion at Springfield Nuclear Power Plant and suggests several ideas to Mr. Burns, all of which are rejected. One night, Homer overhears Burns admit that the plant's real owner is a canary to protect Burns from responsibility for any wrongdoing by the power plant. Homer releases the bird and tells Burns that nuclear inspectors have arrived for a surprise inspection. Burns, desperate to find a scapegoat, names Homer the new owner. As his first act, Homer fires Burns and takes control of the Plant. However, he finds that his work life as a CEO is conflicting with his family life. Homer returns to his old job and gives ownership back to Burns."
  },
  {
    "seasonNumber": 14,
    "episodeNumberInSeason": 16,
    "title": "'Scuse Me While I Miss the Sky",
    "originalReleaseDate": "2003-03-30",
    "synopsis": "A snobby British filmmaker named Declan Desmond begins making a documentary about student life at Springfield Elementary School. When introduced to Lisa, he tells her that she has too many goals and suggests that she pick one career. Lisa focuses on astronomy, but cannot watch the stars because of light pollution. She convinces Mayor Quimby to decrease the light's intensity during the night, which only results in an increase in the crime rate. Quimby bows to public pressure and switches the lights back on permanently. Lisa overloads the generators at the Power Plant, causing a power outage, and is able to watch a meteor shower undisturbed by light. Guest stars: Eric Idle and Joe Mantegna."
  },
  {
    "seasonNumber": 14,
    "episodeNumberInSeason": 17,
    "title": "Three Gays of the Condo",
    "originalReleaseDate": "2003-04-13",
    "synopsis": "While searching in his closet, Homer discovers an old letter from Marge that states that she no longer loves him. He begins to think that she only married him because she became pregnant and so moves out. He finds a new apartment in Springfield's gay district and moves in with a gay couple, Grady and Julio. Marge and Homer attempt a reconciliation dinner, but Homer becomes intoxicated and arrives late. Homer goes to Moe's Tavern, where he continues drinking and gets alcohol poisoning. At the hospital, Dr. Hibbert shows Homer a videotape that documents Homer's first alcohol poisoning. It shows Marge's compassion for the unconscious Homer, as she tells him she loves him. Back in the present, Marge comes into the hospital room and says that she still loves Homer and they kiss. Guest stars: \"Weird Al\" Yankovic, Ben Schatz and Scott Thompson."
  },
  {
    "seasonNumber": 14,
    "episodeNumberInSeason": 18,
    "title": "Dude, Where's My Ranch?",
    "originalReleaseDate": "2003-04-27",
    "synopsis": "When challenged to think up a new Christmas carol, Homer instead writes a song about how much he hates Ned Flanders. The song becomes such a hit that the Simpsons become sick of hearing it and take a trip to a dude ranch. Lisa develops affection for a local boy named Luke but becomes jealous when he hears him talking to a girl named Clara on the telephone. One night, she meets Clara and gives her the wrong directions, leading her to become lost. After Lisa discovers that Clara is actually Luke's sister, she rushes to find her. She saves Clara, and tells Luke what happened, but he is offended and dumps her. Meanwhile, Bart and Homer decide to help a tribe of Native Americans who want a beaver dam removed so they can reclaim their land. Guest stars: David Byrne, Andy Serkis and Jonathan Taylor Thomas."
  },
  {
    "seasonNumber": 14,
    "episodeNumberInSeason": 19,
    "title": "Old Yeller-Belly",
    "originalReleaseDate": "2003-05-04",
    "synopsis": "The Simpson family's dog Santa's Little Helper fails to save Homer from a treehouse when it is on fire. Consequently, Homer declares him a coward and disowns him. One day, a photographer finds Santa's Little Helper playing with a Duff Beer can and takes a picture. The picture becomes popular and SLH becomes the new mascot for Duff Beer while the old mascot, Duffman, is fired. Homer earns a lot of money but SLH's original owner shows up, claiming that the dog is rightfully his. Bart fears that he will never see Santa's Little Helper again. The Simpsons conceive a plan to get Duffman rehired as Duff's mascot by showing what a coward Santa's Little Helper is. At a Duff-sponsored beach event, Homer pretends to be drowning (while floating on a keg of beer) but is attacked by a shark. The shark bites the beer keg and becomes drunk, and wins over the crowd on the beach. The shark is named the new mascot of Duff Beer and Santa's Little Helper returns to the Simpson family. Guest stars: Stacy Keach and John Kassir."
  },
  {
    "seasonNumber": 14,
    "episodeNumberInSeason": 20,
    "title": "Brake My Wife, Please",
    "originalReleaseDate": "2003-05-11",
    "synopsis": "Homer becomes obsessed with using new gadgets in his car. One day, he becomes distracted and drives off a pier, losing his driver's license. Unable to use a car, Homer starts to learn the joys of walking. Meanwhile, Marge shoulders the burden of Homer's driving duties and becomes stressed out. One day, as Homer sings about the virtues of walking, Marge accidentally runs him over with her car. Later, as Homer recuperates from the accident, he begins to suspect that Marge is trying to hurt him. They fight and go to see a marriage counselor. The counselor advises Homer to perform one completely unselfish gesture to win Marge back. Homer holds a party with all of her friends and a surprised Marge tells Homer that she loves him. Guest stars: Jackson Browne, Steve Buscemi and Jane Kaczmarek."
  },
  {
    "seasonNumber": 14,
    "episodeNumberInSeason": 21,
    "title": "The Bart of War",
    "originalReleaseDate": "2003-05-18",
    "synopsis": "After destroying Flanders' shrine to The Beatles, Bart and Milhouse are punished by being put in community groups. Bart joins the Pre-Teen Braves along with Ralph Wiggum, Nelson Muntz and Database. Led by Marge, they start engaging in community activities. However, they soon become rivals with The Cavalry Kids, led by Milhouse. The two groups try to outdo each other and become involved in a contest to sell the most candy. The Cavalry Kids win the prize of singing the national anthem at a baseball game. However, the Pre-Teen Braves pretend to be The Cavalry Kids and sing their own version of the national anthem. As the crowd becomes enraged, the real Cavalry Kids arrive and a massive stadium-wide brawl erupts. Marge becomes upset, and the fighting ends when an image of her crying is shown on the JumboTron."
  },
  {
    "seasonNumber": 14,
    "episodeNumberInSeason": 22,
    "title": "Moe Baby Blues",
    "originalReleaseDate": "2003-05-18",
    "synopsis": "Moe Szyslak becomes lonely and attempts to commit suicide by jumping off a bridge. However, he inadvertently saves Maggie Simpson when she is sent flying from the Simpsons' car window and into his arms. He starts playing with Maggie and becomes attached to her, telling her the story of The Godfather. Homer and Marge become upset about how much time Moe is spending with Maggie and forbid him from seeing her again. One night, Maggie wakes up and hears Fat Tony and the Springfield Mafia outside the house and follows them. When Homer and Marge find her missing, they automatically assume that Moe kidnapped her. When Moe is told that Maggie is missing, his request to help find her is granted by Homer. Maggie follows the mobsters to Luigi's restaurant, where Fat Tony's gang gets into a gun battle with a rival family. Homer, Marge and Moe track Maggie down and Moe goes inside and save Maggie. After Moe saves Maggie's life, Homer allows the two to spend more time together. Guest star: Joe Mantegna."
  }
]
