[
  {
    "seasonNumber": 22,
    "episodeNumberInSeason": 1,
    "title": "Elementary School Musical",
    "originalReleaseDate": "2010-09-26",
    "synopsis": "Homer and Bart accompany Krusty to pick up the Nobel Peace Prize at The Hague. However, it is a ruse so that Krusty could be tried by the International Court of Justice for his deplorable public behavior. Homer and Bart find evidence that one of Krusty's acts indirectly led to release Nelson Mandela from prison, and he is exonerated. Meanwhile, Marge sends Lisa to a performing arts camp for a week. When Marge takes her home at the end of the week, Lisa has trouble readjusting to normal life and looks for a chance to express her newly awakened creative side. She runs away from home and seeks the camp counselors at their home, which is a slum. They encourage her to return to her family and think about trying to make an artistic name for herself when she is older. Guest Stars: Flight of the Conchords (Jemaine Clement and Bret McKenzie), Ira Glass, Stephen Hawking, Lea Michele, Cory Monteith and Amber Riley"
  },
  {
    "seasonNumber": 22,
    "episodeNumberInSeason": 2,
    "title": "Loan-a Lisa",
    "originalReleaseDate": "2010-10-03",
    "synopsis": "Lisa helps fund Nelson's bicycle company with money Grampa gives her as part of his inheritance, but after Nelson meets Facebook founder Mark Zuckerberg and is convinced he can be successful by dropping out of school, Lisa tries to show Nelson the importance of an education. Meanwhile, Marge and Homer get addicted to buying expensive items and returning them for bogus reasons. However, their behavior is eventually caught on camera, and they stop. Guest Stars: Mark Zuckerberg, Muhammad Yunus and Chris Hansen"
  },
  {
    "seasonNumber": 22,
    "episodeNumberInSeason": 3,
    "title": "MoneyBart",
    "originalReleaseDate": "2010-10-10",
    "synopsis": "Lisa coaches Bart's Little League baseball team to a record winning streak by putting her book smarts in statistics and probability into play. But when Bart questions Lisa's coaching tactics and confronts her for taking the fun out of baseball, Lisa benches him. During the championship game, the team is losing, and Lisa asks Bart for help. Disobeying Lisa, he steals several bases, which thrills Lisa. However, the team loses when Bart is caught stealing home. Guest Stars: Mike Scioscia and Bill James (with a special appearance by Banksy who animated the episode's couch gag)"
  },
  {
    "seasonNumber": 22,
    "episodeNumberInSeason": 4,
    "title": "Treehouse of Horror XXI",
    "originalReleaseDate": "2010-11-07",
    "synopsis": "In the 21st Treehouse of Horror episode, Bart and Milhouse get trapped inside a cursed board game in \"War and Pieces\", Homer and Marge suspect a castaway of being a murderer in \"Master and Cadaver\", and Lisa falls for a preteen of the night in \"Tweenlight\". Guest Stars: Hugh Laurie and Daniel Radcliffe"
  },
  {
    "seasonNumber": 22,
    "episodeNumberInSeason": 5,
    "title": "Lisa Simpson, This Isn't Your Life",
    "originalReleaseDate": "2010-11-14",
    "synopsis": "When Lisa finds out that Marge used to be as smart as Lisa before she slacked off, Lisa decides to buckle down (including sacrificing her love of arts and music) and not make the same mistake her mother did. She enrolls in a prestigious school but learns that Marge agreed to do the school's laundry so she could attend. Lisa drops out and says she would be proud to be like her mother. Meanwhile, Bart publicly humiliates Nelson and becomes the school's new bully. Nelson seeks revenge but only embarrasses himself. Bart decided to complement Nelson, and they settle their differences."
  },
  {
    "seasonNumber": 22,
    "episodeNumberInSeason": 6,
    "title": "The Fool Monty",
    "originalReleaseDate": "2010-11-21",
    "synopsis": "Mr. Burns is branded a social pariah after buying all the vaccinations created for a fictitious illness cooked up by the media. When he learns he has weeks to live, the town celebrates, so Burns attempts suicide. He fails, and Bart takes him in as a house guest. The townsfolk harass him until they tire of it. Lisa takes him home, where he plots his revenge. Marge tries to convince him to be nicer, but he says that his cruelty is the only thing keeping him alive because he has lived past his doctor's prediction."
  },
  {
    "seasonNumber": 22,
    "episodeNumberInSeason": 7,
    "title": "How Munched Is That Birdie in the Window?",
    "originalReleaseDate": "2010-11-28",
    "synopsis": "Bart nurses an injured homing pigeon back to health, but when Santa's Little Helper eats the bird. Bart refuses to forgive the dog, so they send him to a therapist. She tells him that the dog had no bad intentions. Bart is not convinced, so she tells the family to give the dog away. They take the dog to an ostrich farm where Bart tells him not to eat any more birds. However, he and Homer get into a fight with an ostrich and Santa's Little Helper does not help because he obeyed Bart. They decide to take the dog home. Guest Stars: Danica Patrick and Rachel Weisz"
  },
  {
    "seasonNumber": 22,
    "episodeNumberInSeason": 8,
    "title": "The Fight Before Christmas",
    "originalReleaseDate": "2010-12-05",
    "synopsis": "In this four-part Christmas episode (set up similar to season 17's \"Simpsons Christmas Stories\"), Bart gets even with Santa Claus, Lisa dreams of an Inglourious Basterds-style Christmas, Marge receives a night time visit from the most powerful force in the universe who teaches her the true meaning of Christmas, and The Simpsons appear as puppets with pop singer Katy Perry. Guest Stars: Martha Stewart and Katy Perry"
  },
  {
    "seasonNumber": 22,
    "episodeNumberInSeason": 9,
    "title": "Donnie Fatso",
    "originalReleaseDate": "2010-12-12",
    "synopsis": "Trying to avoid paying fines for newly passed laws, Homer attempts to bribe an official and is arrested and sent to prison. An FBI agent offers to reduce his sentence if he goes undercover in Fat Tony's gang. He quickly gains favor with Fat Tony. However, when he discovers Homer's true allegiance, he is devastated and dies. Homer is freed and sent home, and he is saddened by Tony’s death. He is captured by Fit Tony, Fat Tony's cousin, who plans to kill him. However, Homer tells him about his friendship with Fat Tony, and Fit Tony releases him. Fit Tony takes over the gang, but the stress causes him to gain weight, becoming Fat Tony. Guest Stars: Jon Hamm and Joe Mantegna."
  },
  {
    "seasonNumber": 22,
    "episodeNumberInSeason": 10,
    "title": "Moms I'd Like to Forget",
    "originalReleaseDate": "2011-01-09",
    "synopsis": "After Bart discovers a boy with a similar scar on his arm, Marge reveals that she was a part of a group called \"The Cool Moms,\" who used to set up playdates with their children and the two decide to reunite with their old friends. Because the kids behave dangerously, Bart decides to take a break from them. Bart learns that when they were younger, the kids set of some fireworks. Debris from the resultant fire scarred their arms. Bart tries to recreate the incident to break up the group, but Marge stops him. The moms blame Bart for being a bad influence, angering Marge, so she decides to leave them."
  },
  {
    "seasonNumber": 22,
    "episodeNumberInSeason": 11,
    "title": "Flaming Moe",
    "originalReleaseDate": "2011-01-16",
    "synopsis": "Moe and Smithers turn Moe's tavern into an ultra-trendy gay bar after Smithers is rejected from Mr. Burns's will and Moe's business is (once again) in a slump. The new patrons believe Moe is gay, making Smithers jealous, and they encourage Moe to run for city council as a gay man. Smithers tries to stop him by trying to kiss him. Moe refuses, and admits he is not gay, which causes the gay community to abandon his bar. Meanwhile, Principal Skinner tries to date the substitute music teacher and sets her daughter up with Bart. However, Bart does not like her, and they break up. The teacher asks Skinner to come with her when she leaves. He accepts but returns when they also break up. Guest Stars: Alyson Hannigan, Kristen Wiig and Scott Thompson."
  },
  {
    "seasonNumber": 22,
    "episodeNumberInSeason": 12,
    "title": "Homer the Father",
    "originalReleaseDate": "2011-01-23",
    "synopsis": "Homer tries to be a better father by using a 1980s sitcom as his guide. Bart wants a dirt bike, but Homer refuses to get him one because he would not appreciate it. Bart decides to sell nuclear plant secrets to China in exchange for a bike. He gains Homer's trust until he brings him to work, where Bart loads the secrets onto a flash drive. During the exchange, Homer sacrifices himself to protect Bart. In China, Homer help build a nuclear plant, which explodes due to Homer's incompetence. Homer returns home and bonds with Bart in front of the television. Guest Stars: Michael Paul Chan, James Lipton, Garry Marshall, and David Mamet."
  },
  {
    "seasonNumber": 22,
    "episodeNumberInSeason": 13,
    "title": "The Blue and the Gray",
    "originalReleaseDate": "2011-02-13",
    "synopsis": "Moe hires Homer to be his wingman so he can score a date, but Homer ends up being the babe magnet. Meanwhile, Marge is shocked to find that her hairdresser has been dyeing her hair blue all these years and decides to go gray for a new, mature look. The townsfolk start thinking that Marge is older than she is. Patty and Selma convince Marge that Homer does not like her new look, and she goes to confront him. At the club with Moe, Homer proves that he only loves her, and she dyes her hair back to blue."
  },
  {
    "seasonNumber": 22,
    "episodeNumberInSeason": 14,
    "title": "The Movie",
    "originalReleaseDate": "2011-02-20",
    "synopsis": "Bart is offered to turn \"Angry Dad\" into a movie. Homer is offered the role of the voice of Angry Dad. After poor screen tests, Lisa tells Bart to remove the poorly received parts, and the movie becomes a short film. The animated short begins to win awards, which Homer attempts to take all the credit. At the Academy Awards, Bart has Homer and Marge take a tour of Los Angeles while he and Lisa attend the awards ceremony. Homer arrives as Bart receives the award for \"Angry Dad.\" He thanks Lisa, the studio, and Homer for the short’s success. Seeing this, Homer apologizes to Bart. Guest Stars: Ricky Gervais, Halle Berry, Russell Brand, Nick Park and J. B. Smoove with Arnis Hasi."
  },
  {
    "seasonNumber": 22,
    "episodeNumberInSeason": 15,
    "title": "The Scorpion's Tale",
    "originalReleaseDate": "2011-03-06",
    "synopsis": "On a school trip, Lisa discovers a rare desert plant that turns aggressive animals docile. Taking samples of the plant home, Lisa isolates the chemical. Homer adds some to Grampa's coffee which makes him happier. A pharmaceutical company replicates the drug in pill form by take a sample of Grampa's sweat. Bart sells them to the elderly people of the town. However, a side effect of the pills makes their eyes fall out of their sockets. Grampa convinces them to stop so that they can force their anger on the younger generation. Guest Stars: Werner Herzog and Kevin Michael Richardson"
  },
  {
    "seasonNumber": 22,
    "episodeNumberInSeason": 16,
    "title": "A Midsummer's Nice Dream",
    "originalReleaseDate": "2011-03-13",
    "synopsis": "1970s stoner comedians Tommy Chong and Cheech Marin decide to break up after each of them get a new comedy partner -- Homer pairs up with Cheech to become \"Cheech and Chunk\" while Principal Skinner joins Chong to become \"Teach and Chong.\" However, learning that their real lives are not like their act, Homer forces Cheech and Chong to reconcile. Meanwhile, Marge stages an intervention for The Crazy Cat Lady after noticing that she's hoarding animals. However, Marge ends up hoarding the items she removes from the Crazy Cat Lady's house. Homer rescues Marge by having the Crazy Cat Lady come by and take back her items. Guest Stars: Tommy Chong and Cheech Marin"
  },
  {
    "seasonNumber": 22,
    "episodeNumberInSeason": 17,
    "title": "Love Is a Many Strangled Thing",
    "originalReleaseDate": "2011-03-27",
    "synopsis": "Homer is sent to parenting therapy after tickling Bart until he wets his pants during a football game, but when the therapist is shocked to hear that Homer regularly physically abuses Bart, he puts Homer through shock treatment by having Kareem Abdul-Jabbar strangle him to make Homer feel as weak and helpless as Bart. The therapy prevents Homer from punishing Bart, who becomes a bully as a result. Marge forces the therapist to fix both of them. He sets up a situation where Bart needs to rescue Homer. Bart is not interested, so the therapist tries to kill him until he rescues Homer. He and Bart bond over suing the therapist. Guest Stars: Paul Rudd, Kevin Michael Richardson, and Kareem Abdul-Jabbar"
  },
  {
    "seasonNumber": 22,
    "episodeNumberInSeason": 18,
    "title": "The Great Simpsina",
    "originalReleaseDate": "2011-04-10",
    "synopsis": "Lisa becomes friends with an old, widower magician, who gives her insight in performing one of Houdini's greatest tricks. After showing off the act at school, she tells the secret of the trick to a boy she likes. The boy is the son a rival magician, who plans to show the trick at a convention. Lisa tries to redeem herself by preventing the rival's trick, but he ends up in danger. The widower magician saves him, who vows to quit magic as a result. Guest Stars: Martin Landau, Jack McBrayer, Ricky Jay, Penn & Teller and David Copperfield."
  },
  {
    "seasonNumber": 22,
    "episodeNumberInSeason": 19,
    "title": "The Real Housewives of Fat Tony",
    "originalReleaseDate": "2011-05-01",
    "synopsis": "Selma insults Fat Tony at the DMV. She is not frightened after Fat Tony kidnaps and threatens her. Instead, Fat Tony falls for her personality, and they get married. Later, another woman appears claiming to be Fat Tony’s wife. He admits that Selma is merely his lover, and their wedding was reflected as such. Selma and the wife fight. Meanwhile, Bart and Lisa find truffles, which they can sell for money. However, Lisa hoards some for her own food. When Bart finds out, they give the rest to Plopper, who goes crazy trying to find more. Guest Star: Joe Mantegna."
  },
  {
    "seasonNumber": 22,
    "episodeNumberInSeason": 20,
    "title": "Homer Scissorhands",
    "originalReleaseDate": "2011-05-08",
    "synopsis": "After Lisa breaks Milhouse's heart yet again, he hooks up with a fifth-grader named Taffy. When she sees that Lisa watching them, she breaks up with Milhouse because he is still in love with her. He confronts Lisa and asks why she wants him to be miserable. Lisa kisses him to make him feel better but is unsure of what she wants. Meanwhile, Homer becomes a hairdresser after fixing Patty's hair, but finds that dealing with gossipy, female clients all day is tedious and depressing. Homer styles Marge's hair for a party but gives credit to Julio, so that the women would go to him for hairdressing instead. Guest Star: Kristen Schaal as Taffy."
  },
  {
    "seasonNumber": 22,
    "episodeNumberInSeason": 21,
    "title": "500 Keys",
    "originalReleaseDate": "2011-05-15",
    "synopsis": "While trying to get Maggie out of Homer's locked car, the family discovers that they have been hoarding keys for years, setting up three interconnected adventures: Homer finds a key that operates The Duff Blimp, Marge finds a key that operates an antique toy that makes farting noises, and Lisa finds a key that leads her to a secret classroom in Springfield Elementary."
  },
  {
    "seasonNumber": 22,
    "episodeNumberInSeason": 22,
    "title": "The Ned-Liest Catch",
    "originalReleaseDate": "2011-05-22",
    "synopsis": "Ned Flanders begins dating Edna Krabappel after saving her from a prank gone bad. This causes tension between them and Homer and Bart. They plot to break them up with Homer bringing Ned to Moe's where he hears how many people have been with Edna. Ned decides to forgive Edna for her many lovers. Edna is angered that Ned judges her. She says that he cannot let her past prevent them from being together. He decides to leave his decision to a higher power. Guest Stars: Ken Burns and Joey Kramer"
  }
]
