[
  {
    "seasonNumber": 32,
    "episodeNumberInSeason": 1,
    "title": "Undercover Burns",
    "originalReleaseDate": "2020-09-27",
    "synopsis": "Mr. Burns discovers that his employees do not like him very much, because of his pompous ways. Smithers decides to help a distraught Mr. Burns go undercover as a man named Fred Kranepool. Initially determined to punish disloyal employees, the plant employees grow to like \"Fred\", causing Mr. Burns to want to adopt that personality permanently. Smithers is forced to expose his boss, causing Mr. Burns to revert to his former tyrannical personality. Guest stars: David Harbour as Mr. Burns' undercover persona Fred Kranepool and Philip Rosenthal as himself"
  },
  {
    "seasonNumber": 32,
    "episodeNumberInSeason": 2,
    "title": "I, Carumbus",
    "originalReleaseDate": "2020-10-04",
    "synopsis": "While the Simpson family visit a museum exhibit on Ancient Rome, Marge chastises a bored Homer for his lack of ambition when he admits to shirking chances for promotion. The curator overhears the squabble and begins to relay the tale of Obeseus the Wide. Obeseus is sold to slavery until he impregnates his master's daughter and is freed and takes part in his master's business. His wife pushes him to join the Senate. His wife, wanting more power, tells Obeseus to kill the emperor so his son can be crowned. However, his son sentences Obeseus to death. He challenges his son to the death, and they both die, causing his wife to kill herself. The Simpson family then argues over the moral of the story. Guest stars: Joe Mantegna as Gordus Antonius (Fat Tony) and Michael Palin as the Curator"
  },
  {
    "seasonNumber": 32,
    "episodeNumberInSeason": 3,
    "title": "Now Museum, Now You Don't",
    "originalReleaseDate": "2020-10-11",
    "synopsis": "While sick, Lisa reads a book about Western art, and imagines her family as famous painters. * \"Lisanardo da Vinci\": Lisa imagines herself as Leonardo da Vinci, the painter and inventor. When she learns that her ideas are being used for war, she escapes to France. * \"1863 France\": After initially being picked on by the other students, a French impressionist (Bart) receives praise for his work and he earns the respect of the other students. His school is worried the emperor will not like his art, but he praises the work. * \"Cupid\": Cupid (Maggie) shoots Homer with an arrow and he dies, descending into a Hieronymus Bosch hell. * \"Frida Kahlo\": Shortly after Diego Rivera (Homer) and Frida (Marge) are married, Diego has them move to America, where John D. Rockefeller has Diego paint a mural at the Rockefeller Center, while Frida is left out, causing friction in their marriage. Frida shows Diego some of her work, and he uses her ideas for his mural. When Rockefeller does not like the work, they leave."
  },
  {
    "seasonNumber": 32,
    "episodeNumberInSeason": 4,
    "title": "Treehouse of Horror XXXI",
    "originalReleaseDate": "2020-11-01",
    "synopsis": "In the thirty-first Treehouse of Horror episode: * \"2020 Election\": During Election Day 2020, everyone is voting who will be the next president of the United States, except for Homer who does not vote. Two months later, on Inauguration Day 2021, the entire city of Springfield is in chaos, while Homer relaxes. * \"Toy Gory\": Bart tortures his toys. As revenge, Bart is killed by his surviving toys, and they turn his body into a toy. Then, they play with his corpse. * \"Into the Homerverse\": Homer mistakes a machine at the nuclear plant for a vending machine. When he inserts a coin into it, it explodes, and multiple different versions of himself from different dimensions come through a portal. Lisa says the explosion caused a hole in the space-time continuum, and Homer needs to recreate it to fix it. Mr. Burns tries to stop him with other versions of Burns and Smithers until he sees a version where Burns is Smithers' assistant. Homer then sends them all home. * \"Be Nine, Rewind\": Lisa gets stuck in a time loop on her ninth birthday in which she dies each time. With Nelson's help, they stop the loop by killing Gil. Guest star: Ben Mankiewicz as himself"
  },
  {
    "seasonNumber": 32,
    "episodeNumberInSeason": 5,
    "title": "The 7 Beer Itch",
    "originalReleaseDate": "2020-11-08",
    "synopsis": "A beautiful English woman named Lily comes to Springfield. She becomes enamored with Homer, who is lonely while the rest of the family is on vacation. Mr. Burns becomes attracted to Lily and has Homer arrange to have Lily meet him for a date. When it goes poorly, Homer drives Lily home, and she kisses him. Marge and the family return home early because they had a terrible time. Knowing Marge is the only woman for him, Homer rejects Lily, and she returns to England. Once there, she falls for a man who looks like Homer. Guest stars: Olivia Colman as Lily, Robin Atkin Downes and Brian George as Various Englishmen"
  },
  {
    "seasonNumber": 32,
    "episodeNumberInSeason": 6,
    "title": "Podcast News",
    "originalReleaseDate": "2020-11-15",
    "synopsis": "Marge and Lisa become addicted to true-crime podcasts. Meanwhile, Grampa get a new girlfriend named Vivienne. When they go on a cruise and Vivienne reportedly dies, Grampa is a suspect. Kent Brockman makes a podcast of about the incident. Vivienne left her money to Grampa in a life insurance policy. Feeling guilty, Grampa admits to murder and is jailed. However, Vivienne is tracked to a Mexican resort. The Simpsons force Brockman to reveal the truth on the finale of his podcast, and Grampa is freed. Later, Grampa encounters Vivienne, who says that he was supposed to collect the insurance money and meet her in Mexico. Guest stars: Morgan Fairchild as Vivienne St. Charmaine, Christine Nangle as Tabitha Shingle and Stellan Skarsgård as himself Note: This episode was dedicated in memory of Alex Trebek who previously guest starred as himself in the episodes \"Miracle on Evergreen Terrace\" and \"Penny-Wiseguys.\" Regular cast member Yeardley Smith also appears in a cameo as herself (the host of the podcast Small Town Dicks)."
  },
  {
    "seasonNumber": 32,
    "episodeNumberInSeason": 7,
    "title": "Three Dreams Denied",
    "originalReleaseDate": "2020-11-22",
    "synopsis": "Comic Book Guy attends the Comicalooza convention, planning to present the ultimate audience question with hopes he will be hired by Marvel Comics. However, when it is his turn, he forgets his question, and he returns home saddened. Meanwhile, Lisa develops a crush on a new kid named Blake who also plays the saxophone. However, he tricks her into losing her school chair, so she goes to play her saxophone at the mall where people like it. Bart is hired as a voice-over actor for a new cartoon show, only to become embarrassed by the role where he has been cast as a princess. However, when people see that the princess is a killer, they are impressed. Guest stars: Ben Platt as Blake and Paul Rudd as himself"
  },
  {
    "seasonNumber": 32,
    "episodeNumberInSeason": 8,
    "title": "The Road to Cincinnati",
    "originalReleaseDate": "2020-11-29",
    "synopsis": "When Superintendent Chalmers is selected to give the keynote speech at an administrator's convention in Cincinnati, Principal Skinner takes some advice from Bart and replaces favored Principal Finch as his superior's plus-one. At the airport, when Skinner checks Chalmers' bag with his anxiety medicine, he has a panic attack, and they are forced to drive to Cincinnati. At a motel along the way, Skinner overhears that Chalmers plans to replace Skinner at school with Finch. Angry, Skinner admits to poisoning Finch, so he could accompany Chalmers. They fight, and Chalmers continues to Cincinnati alone. As he gives the speech, he realizes he left his notes with Skinner. He talks about the ineptitude of his underlings, but he ends up praising Skinner, who arrives with the notes. They reconcile and return to Springfield. Guest stars: Jason Bateman as himself and Hannibal Buress as Principal Finch"
  },
  {
    "seasonNumber": 32,
    "episodeNumberInSeason": 9,
    "title": "Sorry Not Sorry",
    "originalReleaseDate": "2020-12-06",
    "synopsis": "When Lisa's \"Who Inspires You?\" project results in the same B− grade as every other student in her class, she becomes angered with Miss Hoover and calls her a hack. When Lisa refuses to apologize, she is sent to detention. When her stubbornness only makes matters worse, she is encouraged to try and understand things from her teacher's point of view. She follows Hoover home and sees her difficult and lonely life. Lisa buys Hoover a new massage chair and accepts Lisa's apology. Hoover decides to give Lisa a B+ but learns that she also gave Ralph the same grade. Guest stars: Christine Nangle as Ms. Timberwood, Ariana Piknjac and Ella Piknjac performing the end titles theme"
  },
  {
    "seasonNumber": 32,
    "episodeNumberInSeason": 10,
    "title": "A Springfield Summer Christmas for Christmas",
    "originalReleaseDate": "2020-12-13",
    "synopsis": "Aspiring Heartmark Channel film producer Mary Tannenbaum is sent to Springfield to help sort out problems with a Christmas movie being filmed there during the summer. Mary stays with the Simpsons where Heartmark fan Marge tries to befriend her, Homer tries to profit from the film, Lisa follows Mary with her own camera to film a behind-the-scenes documentary and Bart becomes bitter when he must give up his room for the film crew. Meanwhile, Mary forms an odd rapport with Principal Skinner after the two make a deal so that her film does not interfere with his Lettuce and Tomato Festival. She falls in love with Skinner even though she has a fiancé who is a surgeon. When she is forced to use the festival for the movie's finale, she and Skinner argue and end up trapped in a pile of fake snow. Skinner digs them out, but Bart shows Lisa's documentary showing Mary insulting the town. The citizens are angered, but Skinner convinces them to help finish the movie. Mary wants to stay with Skinner, but he rejects her because she already has a fiancé. Guest stars: Ellie Kemper as Mary Tannenbaum, Richard Kind as the director and Chris Parnell as Mary Tannenbaum's fiancé"
  },
  {
    "seasonNumber": 32,
    "episodeNumberInSeason": 11,
    "title": "The Dad-Feelings Limited",
    "originalReleaseDate": "2021-01-03",
    "synopsis": "Homer and Marge team up with Comic Book Guy and his wife Kumiko to win a trivia contest. After spending time with Maggie, Kumiko decides she wants to have a baby, only for her husband to disagree. She gets Comic Book Guy to watch a movie with Bart and Lisa, and he enjoys it until he is unable to comfort them when they get upset. He goes to his family home, where his relatives live with their collections. His father admits that he stayed distant because he would not know what to say if he needed to comfort his son. They play a game of catch, and Comic Book Guy returns home and tells Kumiko he is ready for a family. Guest stars: Dan Aykroyd as Postage Stamp Fellow and Bob Balaban as the narrator"
  },
  {
    "seasonNumber": 32,
    "episodeNumberInSeason": 12,
    "title": "Diary Queen",
    "originalReleaseDate": "2021-02-21",
    "synopsis": "Bart and Milhouse discover Edna Krabappel's old diary after buying a bunch of books at Ned Flanders's yard sale to attempt a stunt. Discovering a page where Krabappel had written about her success of fixing Bart's school life after classes, Bart is suddenly convinced that he is the most improved student. With the help of Maggie, Lisa finds the diary at the treehouse and discovers that Mrs. Krabappel was actually referring to her cat, but only reveals this to Bart after he decides to enter the school's spelling bee. Later in the treehouse, Ned tells Bart that Mrs. Krabappel surely still thought fondly of him, and a thankful Bart returns the diary to him. Guest stars: Marcia Wallace as Edna Krabappel (archive recordings) and Joe Mantegna as Fat Tony"
  },
  {
    "seasonNumber": 32,
    "episodeNumberInSeason": 13,
    "title": "Wad Goals",
    "originalReleaseDate": "2021-02-28",
    "synopsis": "After being told of a golf course in Springfield where golfers pay their caddies very handsomely, Bart signs up for the job. Marge wants Bart to quit after worrying about his personality and future. She posts online that the golf course does not pay taxes, and people threaten to shut it down. Bart and a golfer conspire to make golf a religion to avoid taxes. Marge and other religious leaders cannot stop them. However, when he hears the golfer insult him, Bart and his friends vandalize the golf course, and he quits. Guest stars: Stephen Root as Bildorf and James Sie as The Lama Note: This episode was dedicated in memory of Marc Wilmore, a writer and producer of The Simpsons who died on January 30, 2021."
  },
  {
    "seasonNumber": 32,
    "episodeNumberInSeason": 14,
    "title": "Yokel Hero",
    "originalReleaseDate": "2021-03-07",
    "synopsis": "When Homer spends a night sharing the drunk tank with Cletus, the yokel's singing about family makes Homer remorseful and he vows to become a better husband and father. Homer offers to manage Cletus to help him become a country singing sensation. However, when he becomes successful, Cletus replaces Homer with a new slick manager when he decides to go professional. Without Cletus, Homer returns to his old ways. Marge tells Homer to bring Cletus home, but is unsuccessful. However, when Brandine and his children visit, he quits and goes home. Guest star: Albert Brooks as Slick manager"
  },
  {
    "seasonNumber": 32,
    "episodeNumberInSeason": 15,
    "title": "Do Pizza Bots Dream of Electric Guitars",
    "originalReleaseDate": "2021-03-14",
    "synopsis": "A pizza palace visit awakens bad memories of Homer's youth working there, when the mechanical band he loved was taken from him. Marge, Bart, Lisa, and Moe all track down the lost animatronics to reunite them for Homer once again. Bart and Lisa track the last robot to film and television producer J. J. Abrams, who is also collecting the band for his next film project. He buys the rights to the robots and takes them. After making a movie involving the robots, he announces a screening in Springfield. Homer tries to sabotage it, but Grampa stops him by saying it was he who ruined his childhood and not the ones who took the robots. Guest stars: J. J. Abrams as himself and Greg Grunberg as Bad Robot Head of Security Note: This episode is dedicated in memory of David Richardson, a writer and producer of The Simpsons who died on January 18, 2021."
  },
  {
    "seasonNumber": 32,
    "episodeNumberInSeason": 16,
    "title": "Manger Things",
    "originalReleaseDate": "2021-03-21",
    "synopsis": "During Christmas, Bart finds an ornament featuring Todd Flanders on it, prompting Homer and Marge to tell the kids the story. Six years earlier, Homer promises not to drink at the power plant Christmas party but accidentally gets drunk, so Marge refuses to let him into the house. Ned lets Homer stay with the Flanders. Angered by his behavior, a pregnant Maude tells him to leave. Moe tells Homer about a room above the Simpsons' garage where Homer can secretly be close to his family and listen to them. Missing Homer, Bart and Lisa offer to give up their toys, but Marge says he must do a selfless deed. Homer tries to bake cookies but fails. When Maude goes into labor while Ned is out, Homer helps deliver the baby. Marge sees this and forgives Homer. Ned and Maude name the baby Todd Homer Flanders. * This is the show's 700th episode."
  },
  {
    "seasonNumber": 32,
    "episodeNumberInSeason": 17,
    "title": "Uncut Femmes",
    "originalReleaseDate": "2021-03-28",
    "synopsis": "Marge is forced to chaperone an overnight school trip on a ship with Sarah Wiggum when Homer and Chief Wiggum go to a Bob Seger concert. After putting the children to bed, Marge learns that Sarah has a boisterous personality and bond. However, they are kidnapped, and Marge learns that Sarah used to be part of a team of burglars until they were betrayed by Lindsay Naegle. They plan to steal a diamond from Naegle at a gala and force Marge and Sarah to help. When Seger shames Homer and Wiggum for abandoning their wives, they go to the ship and learn they were kidnapped. They see Marge and Sarah attending the gala on television. The burglars rob Naegle, but she chases after Marge and Sarah as Homer and Wiggum arrive to apologize. Sarah restrains Wiggum while Marge trips Naegle. The burglars frame Naegle for stealing jewelry at the gala, and she is arrested. Marge and Sarah then leave with the diamond. Guest stars: Joe Mantegna as Fat Tony, Megan Mullally as Sarah Wiggum, Nick Offerman as Captain Bowditch, Natasha Rothwell as Bette, Bob Seger as himself and Tiya Sircar as Erin"
  },
  {
    "seasonNumber": 32,
    "episodeNumberInSeason": 18,
    "title": "Burger Kings",
    "originalReleaseDate": "2021-04-11",
    "synopsis": "Mr. Burns almost kills himself eating Krusty Burgers and learns that the town would prefer he had died. To help his boss with both his image and newfound love of burgers, Smithers suggests Burns get into the plant-based burger business. Homer is hired as a spokesman while Marge accidentally buys stock in Burns' new company. Lisa learns that the burgers are made from endangered rainforest plants. Lisa tells Homer, and they expose Burns to the public. Knowing what Lisa and Homer were going to do, Marge sold her stock in advance to keep the profit. The people return to hating Burns, but he is relieved because he no longer needs to try to be good."
  },
  {
    "seasonNumber": 32,
    "episodeNumberInSeason": 19,
    "title": "Panic on the Streets of Springfield",
    "originalReleaseDate": "2021-04-18",
    "synopsis": "Homer buys a truck that comes with a music streaming service subscription. Lisa uses the service and becomes a fan of a 1980s band fronted by Quilloughby. After being humiliated in front of the whole school when she accidentally eats bacon, Lisa begins hallucinating Quilloughby as an imaginary friend. He encourages her to give witty retorts to everyone. When Marge learns the source of Lisa's new attitude, she cancels the music service. Lisa steals Homer's credit card to attend a music festival where the real Quilloughby is performing. She sees that the real Quilloughby is now a hateful carnivore, and the imaginary Quilloughby tells her not to become like him. Marge finds Lisa and says that Lisa's behavior reminds her of her own rebellion against her mother. She tells Lisa that she will always be there for her. Guest star: Benedict Cumberbatch as Quilloughby Note: This episode was dedicated in memory of Edwin E. Aguilar, an animator, character layout and assistant director of The Simpsons who died on April 11, 2021."
  },
  {
    "seasonNumber": 32,
    "episodeNumberInSeason": 20,
    "title": "Mother and Child Reunion",
    "originalReleaseDate": "2021-05-09",
    "synopsis": "At a magic store, the family is given tarot card readings that tell of a future disagreement between Lisa and Marge. A teenage Lisa decides not to attend college, which conflicts with Marge’s expectations for her. She decides to work as a teacher and soon creates her own academy with schools all over the country. She wins an election for school superintendent and eventually becomes President of the United States. In the meantime, Lisa becomes estranged from Marge, and Bart becomes the owner of a cannabis company. He reminds Lisa of the times when Marge was there to support her. When Marge visits the White House, they reconcile. Guest stars: Werner Herzog as The Amazing Herzog, Nate Silver as himself and George Stephanopoulos as himself Note: This episode was dedicated in memory of Olympia Dukakis who previously guest starred as Zelda in the episode \"The Old Man and the Key\"."
  },
  {
    "seasonNumber": 32,
    "episodeNumberInSeason": 21,
    "title": "The Man from G.R.A.M.P.A.",
    "originalReleaseDate": "2021-05-16",
    "synopsis": "Homer meets a British secret agent named Terrance who has spent fifty years hunting a suspected Russian spy known as \"The Grey Fox\". After Homer and his friends hear Terrance's story, Homer begins to suspect that Grampa is the Grey Fox. They observe Grampa receiving a package from Russian men, and Terrance tells Homer to bring Grampa to him. He refuses, so Terrance kidnaps Homer and Grampa and plans to kill them in the desert. The Simpson family learn what happened, and they go with Chief Wiggum to the desert. Terrance is arrested. Feeling sorry for Terrance, Grampa pretends to be the Grey Fox so that Terrance can feel accomplishment. Guest stars: Stephen Fry as Terrance, Head of MI5, Terrance's Father and Hazel, Robin Atkin Downes and Brian George as MI5 Agents, Maurice LaMarche as Orson Welles and Dima Malanitchev as Russian See 'n Say"
  },
  {
    "seasonNumber": 32,
    "episodeNumberInSeason": 22,
    "title": "The Last Barfighter",
    "originalReleaseDate": "2021-05-23",
    "synopsis": "When Bart wins a bottle of tequila, Homer takes it to Moe's. Homer and his friends get Moe drunk, and he reveals all their secrets, which angers them. Because Moe broke the one rule of a secret society of bartenders, they plan to inject Homer and his friends with \"Anti-Booze\", a serum that stops them from drinking alcohol. Moe tries to save them but fails. Three months later, Homer and his friends have become productive and successful while Moe works at an omelet bar. They forgive him, and he serves them water at Moe's. For being loyal to Moe, the society gives the antidote to the Anti-Booze to Homer's friends. Homer refuses but is forced to take it. Guest stars: Ian McShane as Artemis and Cesar Mazariegos as Grampa Baby"
  }
]
