[
  {
    "seasonNumber": 26,
    "episodeNumberInSeason": 1,
    "title": "Clown in the Dumps",
    "originalReleaseDate": "2014-09-28",
    "synopsis": "After being offended by a comedy cable channel roast of him, Krusty goes to his father for advice, only to have him die before he can say whether or not he found his son funny. This causes Krusty to retire. Bart tries to inspire Krusty by showing him old shows, but it proves that Krusty was repetitive. He has a vision of his father telling him to be kinder, but acting so brings him no joy. He goes to a synagogue where he hears his father's favorite rabbi tell Krusty's joke, which makes him think his father thought he was funny. Meanwhile, fear of losing her own father causes Lisa to try to protect Homer. Although she saves him from a fatal incident, Marge and Bart tell her not to force her worries onto him. Guest stars: Kelsey Grammer as Sideshow Bob, Don Hertzfeldt as \"Sampsans\" characters, Maurice LaMarche as Clive Meriwether, Jackie Mason as Rabbi Krustofsky, David Hyde Pierce, Jeff Ross and Sarah Silverman"
  },
  {
    "seasonNumber": 26,
    "episodeNumberInSeason": 2,
    "title": "The Wreck of the Relationship",
    "originalReleaseDate": "2014-10-05",
    "synopsis": "Homer is tired of Bart disrespecting him, so he attempts to parent Bart, by forcing him to eat his broccoli. This goes nowhere, so Marge signs them up for the Relation Ship to solve their problems. Bart excels at ship work and is promoted. When Homer and the ship's captain are intoxicated, Bart is forced to sail the ship through a storm. Although Homer protests, Bart eats a piece of broccoli to gain his trust, and they survive. Meanwhile, while Homer's away, Marge takes over his fantasy football team. She drafts a poorly constructed roster, but with Lisa and Patty and Selma's help, she is able to win. Guest star: Nick Offerman as Captain Bowditch"
  },
  {
    "seasonNumber": 26,
    "episodeNumberInSeason": 3,
    "title": "Super Franchise Me",
    "originalReleaseDate": "2014-10-12",
    "synopsis": "After her sandwiches become popular at Springfield Elementary, Marge opens a sandwich franchise. It becomes a huge success, until the same franchise opens another store right across the street. To escape from her contract, Moe tells her to defraud the parent company. Homer pretends to be a customer and sustains an injury in the store. To prevent a lawsuit for lack of medical training, Marge is released from her contract. Note: This episode was dedicated to Jan Hooks the former voice of Manjula Nahasapeemapetilon."
  },
  {
    "seasonNumber": 26,
    "episodeNumberInSeason": 4,
    "title": "Treehouse of Horror XXV",
    "originalReleaseDate": "2014-10-19",
    "synopsis": "In the twenty-fifth annual Simpsons Halloween special: *School is Hell: Bart and Lisa find a desk carved with an Aramaic incantation that sends them to Hell – and Bart fits in at the school there. *A Clockwork Yellow: Moe leads a Clockwork Orange-style gang, but one of his droogs (Homer) falls for a woman (Marge) and gives up life as a thug. *The Others: The Simpsons are haunted by their former selves from The Tracey Ullman Show – and Homer falls for the older Marge, angering the current Marge. Guest star: John Ratzenberger as CGI Homer Simpson"
  },
  {
    "seasonNumber": 26,
    "episodeNumberInSeason": 5,
    "title": "Opposites A-Frack",
    "originalReleaseDate": "2014-11-02",
    "synopsis": "When Patty and Selma temporarily move in, the Simpsons discover that their smoking ignites their tap water due to Mr. Burns' fracking operation. Lisa and Marge call their assemblywoman to stop him, but she also starts a relationship with him. Burns hires Homer to buy the mineral rights to every property in town, so he can resume his operation. Everyone other than Marge agrees, which angers the townsfolk and causes Burns to end his relationship with the assemblywoman. Burns restarts his fracking as revenge, but Marge's pleas to Homer cause him to use the fire from the tap water to burn down the fracking plant. Guest star: Jane Fonda as Maxine Lombard and Robert Siegel as himself"
  },
  {
    "seasonNumber": 26,
    "episodeNumberInSeason": 6,
    "title": "Simpsorama",
    "originalReleaseDate": "2014-11-09",
    "synopsis": "In a crossover with Futurama, when a time capsule containing a sandwich with Bart's germs in it, Milhouse's rabbit's foot, and radioactive ooze causes rabbit creatures to attack in the future, the Planet Express crew comes to present-day Springfield to stop the incident in the first place. Analysis of the creatures show that the creatures contain Bart's DNA. As the crew and the Simspons try to retrieve the capsule, the creatures attack the time portal in the future, sending everyone except Maggie and Bender to the future. There, they lure the creatures into a trap and send them into space. The Simpsons return home, and Homer puts a shut-down Bender in the basement to be retrieved in the future. Guest stars: John DiMaggio as Bender, David Herman as Scruffy, Phil LaMarr as Hermes Conrad, Maurice LaMarche as Hedonismbot, Morbo and Lrrr, Katey Sagal as Turanga Leela, Lauren Tom as Amy Wong, Frank Welker as Nibbler and Billy West as Philip J. Fry, Professor Farnsworth and Zoidberg Note: The events of this crossover episode occur between the 7th and 8th seasons of Futurama."
  },
  {
    "seasonNumber": 26,
    "episodeNumberInSeason": 7,
    "title": "Blazed and Confused",
    "originalReleaseDate": "2014-11-16",
    "synopsis": "Bart plans for revenge on his new teacher, Mr. Lassen, who is a terrible bully, after Bart is humiliated. He learns that Lassen will be igniting the effigy at \"Blazing Guy.\" Bart suggests going there for the family's camping trip, and they agree. Once there, he and Milhouse add fire retardant to the effigy. When Lassen fails to ignite the effigy, he attacks Bart and Milhouse, but they escape. Lassen is fired for his behavior and gets a new job as a prison guard where he plans revenge with Sideshow Bob. Guest stars: Willem Dafoe as Jack Lassen, Kelsey Grammer as Sideshow Bob and David Silverman as himself"
  },
  {
    "seasonNumber": 26,
    "episodeNumberInSeason": 8,
    "title": "Covercraft",
    "originalReleaseDate": "2014-11-23",
    "synopsis": "When Homer has a midlife crisis, he forms a band of Springfield dads. Despite the band's modest early success, Apu ends up being a breakout star and joins a more successful band. Homer becomes envious and breaks up his band. Marge tells him to go to a concert to support Apu, but he sneaks backstage to try and get revenge. He hears the band denying Apu vacation time, and Apu tells Homer that he is homesick. Homer decides to poison the band to make them sick, and Homer's reunited band performs at the concert instead. Guest stars: Will Forte as King Toot and Sammy Hagar as himself"
  },
  {
    "seasonNumber": 26,
    "episodeNumberInSeason": 9,
    "title": "I Won't Be Home for Christmas",
    "originalReleaseDate": "2014-12-07",
    "synopsis": "On Christmas Eve, Homer leaves work early to be with his family. He gets into a car accident and goes to Moe's to wait for repairs. Moe convinces him to stay late with him at the bar because he is lonely. When he finally returns home, Marge kicks Homer out of the house. Depressed, Homer takes a lonely walk through Springfield instead of being with his family. Moe finds Homer's wallet at the bar and goes to the Simpson house to return it. He confesses that it was his fault that Homer was late, so Marge goes to look for him. When they finally reunite, they forgive each other."
  },
  {
    "seasonNumber": 26,
    "episodeNumberInSeason": 10,
    "title": "The Man Who Came to Be Dinner",
    "originalReleaseDate": "2015-01-04",
    "synopsis": "The Simpson family attend a trip to an amusement park named Dizneeland, where they go on a ride called \"Rocket to Your Doom\" and accidentally end up on Rigel 7, the home planet of Kang and Kodos. Homer is selected to be eaten, but he is rescued by other Rigelians who do not believe in eating intelligent species. When the rest of the Simpsons are to be eaten, Homer returns and offers himself in exchange for them, but he is also prepared to be eaten. When a piece of Homer is eaten by the Rigelian Queen, she dies, and they discover that humans are poisonous to them. The Simpsons are sent home in a spaceship, but they decide not to go directly home after a call with Grampa."
  },
  {
    "seasonNumber": 26,
    "episodeNumberInSeason": 11,
    "title": "Bart's New Friend",
    "originalReleaseDate": "2015-01-11",
    "synopsis": "Homer goes to a hypnotist and ends up believing he is ten years old. However, when the hypnotist, who is a criminal, escapes to avoid being arrested, Homer becomes stuck in his new age, so he bonds with Bart. When the hypnotist is caught, Homer is torn between staying young and returning to adulthood. He tells Bart to stay young and returns to adulthood. Later, Homer tells Bart that he had a special friend when he was younger but does not remember who he was. Guest star: Stacy Keach as Don Bookner"
  },
  {
    "seasonNumber": 26,
    "episodeNumberInSeason": 12,
    "title": "The Musk Who Fell to Earth",
    "originalReleaseDate": "2015-01-25",
    "synopsis": "Elon Musk comes to Springfield looking for inspiration. He thinks Homer has many ideas for inventions, so they become friends. Musk convinces Mr. Burns to build a new type of power plant. Later, Burns learns that the plant is losing money although Musk just wants to save the planet. For revenge, Burns fires many of the plant's employees and plans to kill Musk. Marge tells Homer to end his friendship with Musk to save his job. As he ends his relationship with Musk, he save Homer from a poorly aimed bullet meant for Musk. He then departs Springfield. Guest star: Elon Musk as himself"
  },
  {
    "seasonNumber": 26,
    "episodeNumberInSeason": 13,
    "title": "Walking Big & Tall",
    "originalReleaseDate": "2015-02-08",
    "synopsis": "Lisa writes a new Springfield anthem after discovering the old one was plagiarized. At a theater performance for its debut, Homer becomes stuck in his seat due to his obesity. Marge tells him to join a weight control support group but ends up joining a support group that embraces obesity. The group protests unrealistic thin figures. Marge tells Homer to leave the group, but he refuses. When she says that the group's leader, Albert, is too lazy to walk, he stands up to prove Marge wrong, but immediately dies. At his funeral, Homer learns Albert was quite young, which prompts him to go on a diet. Guest star: Kevin Michael Richardson as Albert and Pharrell Williams as himself"
  },
  {
    "seasonNumber": 26,
    "episodeNumberInSeason": 14,
    "title": "My Fare Lady",
    "originalReleaseDate": "2015-02-15",
    "synopsis": "Marge becomes a chauffeur after she grows tired of chauffeuring her own kids around, but ends up disliking it due to the demands her customers make. She also earns the hate of taxi drivers. Meanwhile, Homer, Lenny, and Carl run Moe's bar while he goes to a theater show. When it gets destroyed, they give him a job at the power plant. He is successful and becomes their manager, but his management style annoys them. While Marge drives Moe to his bar, they complain to each other about their jobs, and they decide to quit. At the bar, the taxi drivers attack Marge. Moe defends her, and he reconciles with Homer, Lenny, and Carl. Guest stars: Christopher Lloyd as Jim Ignatowski and Rich Sommer as Young Man Note: This is the first episode where Bart (despite appearing in the episode) doesn't have a single line of dialogue. As a result, this leaves Homer the only Simpson family member to speak in every episode."
  },
  {
    "seasonNumber": 26,
    "episodeNumberInSeason": 15,
    "title": "The Princess Guide",
    "originalReleaseDate": "2015-03-01",
    "synopsis": "Homer takes Lisa to bring your daughter to work day, where she has fun watching him. A Nigerian princess named Kemi comes to Springfield, as her father intends to work out a uranium deal with Mr. Burns, and Homer is chosen to protect her due to his love for Lisa showing on the camera. Moe, having recently lost his money to a Nigerian prince, believes Kemi must be related to the scammer, but soon starts falling for her. When her father sees a photo of her kissing Moe on the internet, he ends negotiation with Burns. Kemi says the kiss was only an act of friendship, which saddens Moe. Homer tells her father to let his daughter live her life on her own terms. He agrees and signs the deal with Burns. Guest stars: Richard Branson as himself, Yaya DaCosta as Princess Kemi, Jon Lovitz as Enrico Irritazio and Kevin Michael Richardson as the Nigerian King"
  },
  {
    "seasonNumber": 26,
    "episodeNumberInSeason": 16,
    "title": "Sky Police",
    "originalReleaseDate": "2015-03-08",
    "synopsis": "Chief Wiggum gets a jet pack, which he uses to fight crime. However, after he unintentionally crashes it into the church, Marge leads the rest of the Springfield congregation toward gambling to win money to rebuild it but does not tell Homer. They devise a system of counting cards and win enough money for the church. However, a suspicious Homer followed Marge into the casino and is held hostage in exchange for the money they won. Marge goes to the casino and prays, which is bad for business. The casino manager agrees to let Homer go, and they are banned from returning. Guest star: Nathan Fielder as Doug Blattner"
  },
  {
    "seasonNumber": 26,
    "episodeNumberInSeason": 17,
    "title": "Waiting for Duffman",
    "originalReleaseDate": "2015-03-15",
    "synopsis": "When Duffman undergoes hip replacement surgery following an injury during a parade and retires, Duff Beer's owner Howard K. Duff VII sets up a reality show presented by Cat Deeley in order to find his replacement. The competition is fierce until Homer wins. Because the job requires him to stay sober during work hours, he learns that beer is not as necessary as he thought to have a good time. At an event, he gives away alcohol-free beer, but it angers the crowd. Homer is fired, which causes him to resume drinking. The previous Duffman is found and is convinced to return to his old job. Guest stars: Cat Deeley as herself, R. Lee Ermey as Col. Leslie Hapablap and Stacy Keach as Howard K. Duff VIII"
  },
  {
    "seasonNumber": 26,
    "episodeNumberInSeason": 18,
    "title": "Peeping Mom",
    "originalReleaseDate": "2015-04-19",
    "synopsis": "Returning home with Maggie from errands, Marge discovers that a part of Springfield is now totally destroyed. As Chief Wiggum announces that Bart could be the culprit, Bart says that he was not involved at all in the incident. This prompts Marge to follow him everywhere to force him to confess. Eventually, she gives up, but Bart reveals to Milhouse that he did it, and he plans to knock down the Springfield sign during a celebration. During the prank, he finds food that Marge gave him in his backpack, prompting him to keep the “F” and “D” up as a tribute to the fire department. He confesses his deeds to Marge. Meanwhile, Homer ignores Santa's Little Helper once again when he meets Flanders' new dog named Baz. Because she bonded with Homer, Ned tries to give him the dog, but Homer declines because he thinks Ned would be a better owner."
  },
  {
    "seasonNumber": 26,
    "episodeNumberInSeason": 19,
    "title": "The Kids Are All Fight",
    "originalReleaseDate": "2015-04-26",
    "synopsis": "Homer finds an old film strip, which prompts the story of Bart and Lisa's sibling rivalry to be told. When Lisa shows she can write Bart's name better than himself, he hits her with a toy. Homer sees this, and Homer and Bart attack each other. The siblings keep fighting, prompting Ned to have his Grandma watch them, so Homer and Marge can have a break. When Grandma Flanders falls asleep, they go out and wander around Springfield. They learn to be a good team while Homer and Marge look for them. They end up at the Springfield Tire Fire where Homer rescues them."
  },
  {
    "seasonNumber": 26,
    "episodeNumberInSeason": 20,
    "title": "Let's Go Fly a Coot",
    "originalReleaseDate": "2015-05-03",
    "synopsis": "After Homer sees an expensive birthday, he complains about not getting the good things at his parties as a kid and ruins birthday parties all over town and is then forced to throw a party for Ned's son Rod. At Rod's party at the Air Force museum, Grampa tells the family stories about his days in the U.S. Air Force and reunites with his old friends. When Grampa's friends see how Homer treats his dad, they start forcing him to treat him right. Meanwhile, Bart begins using e-cigarettes to impress Milhouse's cousin Annika, who he has a crush on. When Annika leaves for the airport to go home, Grampa tells Bart that he performed a grand gesture to impress a waitress named Mona, Homer's mother. Bart goes to the airport, but tells her he does not like her because she complained the entire time she was in Springfield. Guest stars: Glenn Close as Mona Simpson and Carice van Houten as Annika Van Houten"
  },
  {
    "seasonNumber": 26,
    "episodeNumberInSeason": 21,
    "title": "Bull-E",
    "originalReleaseDate": "2015-05-10",
    "synopsis": "When Bart is bullied after a school dance, Marge gets the city to adopt a tough anti-bullying law. Although the police arrest bullies at first, the police start arresting anyone wrongly accused because it was written vaguely. When Rod and Todd claim that Homer is bullying Ned, he is arrested and sent to treatment. He realizes that Flanders is better than him and begs him for forgiveness. He kneels on Ned's lawn for a long time until he finally forgives him. Guest stars: Albert Brooks as Dr. Raufbold, Joe Mantegna as Fat Tony and Johnny Mathis as himself"
  },
  {
    "seasonNumber": 26,
    "episodeNumberInSeason": 22,
    "title": "Mathlete's Feat",
    "originalReleaseDate": "2015-05-17",
    "synopsis": "When the school goes all-digital thanks to a donation from Springfield Elementary alumni and all of the electronics go out, Lisa suggests turning the school into a Waldorf school, where kids \"learn by doing\" with hands-on interactions with Lunchlady Dora and Groundskeeper Willie. Later, Willie is put in charge of the school Mathletes team after Lisa sees him put new grass in. Much to his dismay, Bart is put on the team. When the team competes against Waverly Hills Elementary, the score is tied, and Bart must solve the last problem. Using Homer's hair, Bart solves it, and Springfield Elementary wins. Guest star: Justin Roiland as Rick and Morty"
  }
]
