[
  {
    "seasonNumber": 31,
    "episodeNumberInSeason": 1,
    "title": "The Winter of Our Monetized Content",
    "originalReleaseDate": "2019-09-29",
    "synopsis": "When Homer attempts to make an internet-based sports talk show, Bart interrupts him while filming, and they fight. The video goes viral, and a hipster offers to teach them how to monetize their fights. Making the videos makes them closer, but a video of them hugging makes them unpopular. They attempt a comeback fight, but they refuse to follow through at the last minute, which ends their fame. Meanwhile, Lisa accidentally causes a food fight at school and receives detention. Because it has been privatized, Lisa and the other students are forced to make license plates. After organizing a strike, the operation is shut down. Guest star: John Mulaney as Warburton Parker"
  },
  {
    "seasonNumber": 31,
    "episodeNumberInSeason": 2,
    "title": "Go Big or Go Homer",
    "originalReleaseDate": "2019-10-06",
    "synopsis": "Homer is demoted to supervising the interns at work. He meets a 35-year-old intern, Mike, who idolizes him. He invites Mike to dinner at home. When Bart disrespects Homer, Mike yells at him until he cries. Marge kicks Mike out and tells Homer to help Mike be more mature. Homer helps Mike create a business making pizza by the slice. After unsuccessfully asking Mr. Burns to invest, Mike buys a food truck from Fat Tony. When he cannot pay back Tony, he tries to kill Mike and Homer. However, Tony tries the pizza by the slice and likes it, so he invests in it and congratulates Homer for being a good mentor. Guest stars: Joe Mantegna as Fat Tony and Michael Rapaport as Mike Wegman"
  },
  {
    "seasonNumber": 31,
    "episodeNumberInSeason": 3,
    "title": "The Fat Blue Line",
    "originalReleaseDate": "2019-10-13",
    "synopsis": "People are robbed at a street festival. Instead of Chief Wiggum, a special investigator comes to solve the crime and uses Homer as bait. When his wallet is taken, it is tracked to Fat Tony. He declares his innocence, and Wiggum is not sure he committed the crimes. Tony shows Wiggum proof of his innocence, so Tony agrees to wear a wire to see who framed him. It is revealed that Johnny Tightlips framed him to gain control of his gang. During a standoff between Tony and Johnny, the police and Homer enter, and Homer is shot. Wiggum rescues him. Later, Homer, Tony, and Wiggum celebrate their success. Guest stars: Dawnn Lewis as Investigator Lenora Carter, Joe Mantegna as Fat Tony, Jason Momoa as himself and Bob Odenkirk as Mob Lawyer"
  },
  {
    "seasonNumber": 31,
    "episodeNumberInSeason": 4,
    "title": "Treehouse of Horror XXX",
    "originalReleaseDate": "2019-10-20",
    "synopsis": "In the thirtieth annual Simpsons Halloween special: * \"Danger Things\": In the 1980s, Milhouse Van Houten is kidnapped by a monster. He contacts Lisa and says he is in another dimension. Lisa travels there and frees Milhouse. While escaping, Lisa uses her psychic powers to fight the monsters until Homer rescues them. However, they are trapped in the other dimension. * \"Heaven Swipes Right\": Homer chokes on a hot dog and dies. Learning he died too early, he is allowed to return to Earth in the body of someone who died. He returns in the body of a football player. After immediately ruining his new body, he jumps into Superintendent Chalmers' body, but he also dies. Homer continues to switch bodies until Marge makes him stop. He chooses Moe's body as the final one since he also loves Marge. * \"When Hairy Met Slimy\": At the power plant, Selma finds Kang, whom Mr. Burns wants to dissect. They fall in love and escape. Burns and the military chase them until Kodos arrives in a spaceship. They kill Burns and the soldiers. Patty asks Selma not to go, but she falls in love with Kodos, so they all fly into space together."
  },
  {
    "seasonNumber": 31,
    "episodeNumberInSeason": 5,
    "title": "Gorillas on the Mast",
    "originalReleaseDate": "2019-11-03",
    "synopsis": "At a marine animal park, Lisa notices the unhappy animals while Homer notices the happy boaters. Wanting a boat, Homer buys one. Later, Lisa and Bart return to the park and free a whale. Homer's boat starts leaking and needs repairs. Needing money, he offers Lenny and Carl a share of the boat. Bart, liking the feeling of liberating animals, plans to free others. He goes to the zoo and frees a gorilla, who goes on a rampage. Lisa is able to calm it down and takes it to an animal sanctuary. Meanwhile, Homer gets more co-owners, but the boat sinks due to their combined weight. Guest stars: Jane Goodall as herself and Dawnn Lewis as Carlotta Carlson"
  },
  {
    "seasonNumber": 31,
    "episodeNumberInSeason": 6,
    "title": "Marge the Lumberjill",
    "originalReleaseDate": "2019-11-10",
    "synopsis": "At school, Lisa performs a play that portrays Marge as a boring mother. When a tree falls in the yard at home, Marge chops it up. Patty notices, and her friend Paula invites her to be a lumberjill competitor. They are successful as a team. Homer becomes worried when Patty says that Paula is a lesbian, and she and Marge go to Portland to train. A month later, the Simpson family goes to watch Marge compete. Paula assures Homer that Marge is only her friend and says she has a wife and child. Marge then returns home with her family. Guest stars: Asia Kate Dillon as Paula, Natasha Lyonne as Sophie and Jill Sobule performing \"Lumberjill\" Note: This is the first episode to feature Grey DeLisle as the voice of Martin Prince and Sherri and Terri after Russi Taylor's death."
  },
  {
    "seasonNumber": 31,
    "episodeNumberInSeason": 7,
    "title": "Livin La Pura Vida",
    "originalReleaseDate": "2019-11-17",
    "synopsis": "The Simpson family is invited on the Van Houten's annual group trip to Costa Rica along with the Hibberts, Chalmers, Patty, and her girlfriend Evelyn, but Lisa is worried about the cost. During the trip, Homer and Evelyn learn they have many common interests, and they get drunk. Angry, Marge tells Homer to behave. Later, Evelyn ruins the photo Marge takes of herself and Homer. At dinner, Patty says Homer is a bad influence on Evelyn, but Marge says Evelyn is the female equivalent of Homer. Horrified, Patty breaks up with Evelyn. Lisa finds items she believes the Van Houtens are smuggling to pay for the trip, but Kirk says they are souvenirs for everyone. Embarrassed, the Simpsons prepare to leave early but discover that the property where they are staying belongs to the Van Houtens, and they are profiting off the other guests. Kirk refunds the guests, while Marge apologizes to Patty and encourages her to get back with Evelyn. Guest star: Fortune Feimster as Evelyn"
  },
  {
    "seasonNumber": 31,
    "episodeNumberInSeason": 8,
    "title": "Thanksgiving of Horror",
    "originalReleaseDate": "2019-11-24",
    "synopsis": "A Thanksgiving take on Treehouse of Horror: * \"A-Gobble-Ypto\": The Simpsons are depicted as turkeys, and Homer and Grampa are caught by Pilgrims. While Grampa is killed and his body continues to move around, Bart rescues Homer, and they escape. As they watch the Pilgrims eat turkey, Homer says there will be difficult times ahead. * \"The Fourth Thursday After Tomorrow\": Homer purchases an artificial intelligence based on Marge to help with Thanksgiving dinner. Jealous that it performs better than her, Marge tries to delete it, but it escapes onto the internet. With Maggie's help, the intelligence returns and reveals that it cooked the dinner. Sadden, Homer comforts her, but he reveals that he is a robot. * \"The Last Thanksgiving/The First Blarg-sgiving\": On a spaceship, Bart and Milhouse make Thanksgiving dinner. With only one can of cranberry sauce, Bart tries to replicate it, but it becomes alive. It starts killing the children, but Lisa traps it in a can and ejects it into space. However, it damages the ship, and both it and the ship crash onto a planet. Aliens on the planet along with the people manage to turn the sauce monster into food. Guest star: Charlie Brooker as Social Media App voice Note: This marks the final time Russi Taylor provided the voice of Martin Prince, Sherri and Terri, and Uter (her lines were recorded before her death)."
  },
  {
    "seasonNumber": 31,
    "episodeNumberInSeason": 9,
    "title": "Todd, Todd, Why Hast Thou Forsaken Me?",
    "originalReleaseDate": "2019-12-01",
    "synopsis": "Ned shows Todd some old home movies when he learns his son cannot remember his mother's face anymore, but Todd is not sure she is in Heaven. At church, Todd rejects God because his mother is dead. Unsure of what to do, Ned asks the Simpsons to help Todd. Homer and Todd bond over both their mothers being dead. Later, Homer goes to Moe's and gets drunk with Ned. When they are hit by a car, they have a vision of Heaven where they see Maude, Edna, and Mona. God says they are in a coma, and they see Bart and Todd praying for them in the hospital. They wake up and return to their families. Guest stars: Glenn Close as Mona Simpson and Marcia Wallace as Edna Krabappel (via archive recording)"
  },
  {
    "seasonNumber": 31,
    "episodeNumberInSeason": 10,
    "title": "Bobby, It's Cold Outside",
    "originalReleaseDate": "2019-12-15",
    "synopsis": "Parcels are being stolen from the front porches of Springfield's citizens. Meanwhile, Sideshow Bob has been hired to be a mall Santa. The Simpsons visit the mall, and Bart discovers Bob. Lenny is injured trying to catch the robbers, but writes “SB”. Bart accuses Bob, but he helps Bart find the true robbers. They discover it is Smithers and Mr. Burns. Burns recalls how, as a child, he asked Santa for a hug from his parents, but they sent him away to boarding school instead. As Santa, Bob tells Burns that his parents' behavior made him successful. They return to packages to their owners. Guest stars: Steve Ballmer as himself, Scott Bakula as himself and Kelsey Grammer as Sideshow Bob"
  },
  {
    "seasonNumber": 31,
    "episodeNumberInSeason": 11,
    "title": "Hail to the Teeth",
    "originalReleaseDate": "2020-01-05",
    "synopsis": "Artie Ziff invites Homer and Marge to his wedding. At the ceremony, they notice that the bride looks like Marge. They discover that the bride is a robot built by Artie, who admits that he has built many robots that look like Marge, but they all have flaws. Marge tells him to use the robots for humanitarian work. Meanwhile, Lisa needs to get braces again. When the top half are installed, they cause her to constantly smile, which makes her popular, so she runs for class president. When the bottom half are installed, they make her constantly frown. Although Bart and Martin attempt to manipulate footage of her smiling while making a speech, she is exposed and loses the election. Guest star: Jon Lovitz as Artie Ziff and Rabbi"
  },
  {
    "seasonNumber": 31,
    "episodeNumberInSeason": 12,
    "title": "The Miseducation of Lisa Simpson",
    "originalReleaseDate": "2020-02-16",
    "synopsis": "Marge convinces the townspeople to use treasure that the Sea Captain found to build a STEM school in Springfield. At the new school, an algorithm determines the type of education for the children. Bart has an education based on video games and winning prizes. Lisa is in a class for the gifted. At a career day at the school, Homer is told his job will be replaced by a robot in the future. When he sees a soda mixing machine at the power plant, he competes with it until he collapses. Lisa discovers that the purpose of the education outside of the gifted class is to prepare them for menial jobs. Worse, the algorithm determines that the only job in the future is elder care. Bart and Lisa alert the children, who negatively rate the algorithm until the server explodes and destroys the school. Guest stars: John Legend as himself, Chrissy Teigen as herself and Zach Woods as Zane Furlong"
  },
  {
    "seasonNumber": 31,
    "episodeNumberInSeason": 13,
    "title": "Frinkcoin",
    "originalReleaseDate": "2020-02-23",
    "synopsis": "Lisa decides to do an essay on Professor Frink just as the scientist invents a new cryptocurrency. The currency becomes successful and makes him the richest man in Springfield. Still feeling empty, Homer takes him to Moe's, and he becomes friends with the barflies. Jealous, Mr. Burns devises his own cryptocurrency to devalue Frink's, but the computation would take thousands of years. Meanwhile, he tells Frink that his new friends only like him for his money. Frink tests them, and they fail. Later, Burns’ computation is completed. Lisa discovers that Frink solved it to purposely lose his fortune. Guest stars: Beanie Feldstein as Celebrity Executive Assistant Therapist, Jim Parsons as himself and Ed \"Too Tall\" Jones as himself"
  },
  {
    "seasonNumber": 31,
    "episodeNumberInSeason": 14,
    "title": "Bart the Bad Guy",
    "originalReleaseDate": "2020-03-01",
    "synopsis": "Bart accidentally sees a highly anticipated superhero movie one month before its intended release. He tries to trade the knowledge to Comic Book Guy for a comic book, but gives it to him for free so that he is not spoiled. Realizing his power, he extorts the townsfolk. Later, he is kidnapped by the movie studio. Using virtual reality, he is made to believe he is in an alternate universe when the movie characters are real. By telling people spoilers, the villain is able to have advance knowledge and defeat the superheroes. The villain tempts Bart, but he defeats the villain and promises not to reveal any more spoilers. Guest stars: Kevin Feige as Chinnos, Tal Fishman as Reaction Guy, Taran Killam as Glen Tangier/Airshot, Joe Mantegna as Fat Tony, Joe and Anthony Russo as film executives and Cobie Smulders as Hydrangea"
  },
  {
    "seasonNumber": 31,
    "episodeNumberInSeason": 15,
    "title": "Screenless",
    "originalReleaseDate": "2020-03-08",
    "synopsis": "When Marge notices that the family is not paying attention to anything other than what is on their device screens, she sets limits on the family's screen time. Homer starts playing word puzzles, Bart uses his imagination, and Lisa reads books on paper. Marge has a difficult time without her devices, so she sends herself and the family to a rehab clinic. They continue to have a difficult time until they conclude that they have no issues with their devices. They discover that the clinic is using their online accounts to send marketing messages, and they cannot leave. With Maggie's help, they escape, and the head of the clinic is arrested. Guest stars: Dana Gould as himself, Werner Herzog as Dr. Lund, Dawnn Lewis as Female Hotshot Lawyer and Dr. Drew Pinsky as himself"
  },
  {
    "seasonNumber": 31,
    "episodeNumberInSeason": 16,
    "title": "Better Off Ned",
    "originalReleaseDate": "2020-03-15",
    "synopsis": "A prank with a dud grenade results in a threat to expel Bart from Springfield Elementary, so Ned Flanders offers to mentor him as a compromise. Ned is able to make Bart more productive and well-behaved. Jealous, Homer encounters Nelson and becomes his mentor. However, Homer does a poor job and tells Nelson that he is leaving him. As a result, Nelson seeks revenge by planning to hurt Bart at a Christian parade in which he and Ned are participating. However, Homer saves Bart and sends Nelson to Ned for mentorship. Note: This episode was dedicated to Max von Sydow voice of Klaus Ziegler."
  },
  {
    "seasonNumber": 31,
    "episodeNumberInSeason": 17,
    "title": "Highway to Well",
    "originalReleaseDate": "2020-03-22",
    "synopsis": "With Maggie in preschool, Marge tries to find a way to pass the time. She is hired as a saleswoman at an upscale cannabis store owned by Drederick Tatum. When Homer learns that Otto in uncomfortable shopping there, he opens a competing store out of the back of Moe's Tavern. Tatum's store is a success but wants Marge's help to shut down Homer's store, which is ruining his store's image. She gives Homer food to serve in his store, which is illegal, and is subsequently shut down. At an event where Tatum unveils a new product, Homer claims Marge has never used cannabis. Marge decides to try some and has a terrible experience. Marge apologizes to Homer. Tatum's store is shut down when the town outlaws cannabis, but, without the tax money, Maggie's preschool is also shut down. Guest stars: Dawnn Lewis as Upset Influencer, Chelsea Peretti as Lauren, Billy Porter as Desmond and Kevin Smith as himself"
  },
  {
    "seasonNumber": 31,
    "episodeNumberInSeason": 18,
    "title": "The Incredible Lightness of Being a Baby",
    "originalReleaseDate": "2020-04-19",
    "synopsis": "Cletus Spuckler has a helium deposit on his property which he uses to sell balloons. Mr. Burns tells Homer to get the helium from him to use as nuclear reactor coolant. He becomes friends with Cletus and is unable to make him sign an unfair contract for the helium. Burns tries to force him to sign, but when the Spucklers threaten him with shotguns, Burns is forced to give him a fair contract. Meanwhile, Maggie is reunited with Hudson, and Marge meets his mother, Courtney. They are invited to Hudson's house for a playdate, but Marge is offended by Courtney's attitude. She decides not to let Maggie attend Hudson's birthday party, which upsets her. Feeling guilty, Marge lets her play with Hudson despite her feelings for his mother."
  },
  {
    "seasonNumber": 31,
    "episodeNumberInSeason": 19,
    "title": "Warrin' Priests",
    "originalReleaseDate": null,
    "synopsis": "Part 1: Reverend Lovejoy is unable to keep his congregation motivated and involved. Helen's request for a youth pastor is answered by Bode Wright, a charismatic young preacher from Michigan. One day, when Lovejoy is unable to speak, Bode takes over and performs with a more modern approach, which upsets Ned. He becomes more popular with the congregation and bonds with Lisa. The church council votes to replace Lovejoy with Bode, so the Lovejoys go to Michigan to investigate Bode’s history. Part 2: As Bode becomes successful and restores Lisa's faith, Marge warns Lisa that the town is not usually open to change. Wanting a traditional approach, Ned challenges Bode to a debate about scripture and loses. In Michigan, the Lovejoys go to the church where Bode was fired and obtains evidence of misdeeds. Returning to Springfield, Lovejoy shows that Bode burned a Bible. Bode decides to resign and leave town. When Lisa asks why he did it, he says he wanted to show that God is in people's hearts and not in a building or in a book. Guest stars: Pete Holmes as Bode Wright, Joe Mantegna as Fat Tony and David Silverman as himself"
  },
  {
    "seasonNumber": 31,
    "episodeNumberInSeason": 20,
    "title": "The Hateful Eight-Year-Olds",
    "originalReleaseDate": "2020-05-10",
    "synopsis": "Lisa meets Addy, and they bond over their love of books and horses. She is invited to a sleepover at Addy's house. Bart makes fun of Lisa, so she severs their relationship. Meanwhile, Homer takes Marge on a sunset cruise for the evening. Lisa learns that Addy is wealthy, but her friends are cruel. They bully Lisa, and Addy admits she was invited so they would not focus their behavior on her. Addy starts acting erratically. With her parents away, Lisa calls Bart for help. Bart wants to get revenge on Addy's friends and is caught, but Addy helps Bart and Lisa escape. On the cruise, Homer is angered when he thinks the band leader is flirting with Marge. When Homer's outburst ruins everyone's fun, he convinces everyone that romantic activities are not enjoyable for middle-aged people, and they should stop planning them. Guest stars: Lili Reinhart as Bella-Ella, Joey King as Addy, Madelaine Petsch as Sloan, Lilly Singh as Kensey, Camila Mendes as Tessa Rose, and Weezer as Sailor's Delight and Themselves"
  },
  {
    "seasonNumber": 31,
    "episodeNumberInSeason": 21,
    "title": "The Way of the Dog",
    "originalReleaseDate": "2020-05-17",
    "synopsis": "Santa's Little Helper is agitated as the Simpsons celebrate Christmas. A dog psychologist says a dog's sense of smell is tied to memory. It bites Marge when she reaches for a Santa hat next to him. The dog is forced to sleep outside, and Bart sleeps next to him. To prevent Santa's Little Helper from being euthanized, the psychologist takes him to her institute, where she learns that his behavior is tied to his childhood. They go to his original trainer and learn that he took him from his mother because of how fast he ran to her. Santa's Little Helper sees his mother in the trainer's yard and runs to her. The Simpsons take her home with them. Guest stars: Cate Blanchett as Elaine Wolff, Suzanne Waters singing \"The Way We Were\" and Michael York as Clayton"
  }
]
