[
  {
    "seasonNumber": 25,
    "episodeNumberInSeason": 1,
    "title": "Homerland",
    "originalReleaseDate": "2013-09-29",
    "synopsis": "Homer's personality has changed after attending a nuclear plant convention. Worried, Lisa calls the FBI, who sends an unhelpful agent with bipolar disorder. Believing he will cause a disaster, Lisa tries to stop Homer from destroying the plant, but he only intends to drive the workers away from the plant with a reeking smell. He reveals that he was brainwashed by hippies into becoming environmentally friendly. Lisa joins his cause, but they fail because the plant's air conditioning system is faulty. Homer quickly reverts to his normal behavior, which disappoints Lisa. Guest star: Kevin Michael Richardson and Kristen Wiig"
  },
  {
    "seasonNumber": 25,
    "episodeNumberInSeason": 2,
    "title": "Treehouse of Horror XXIV",
    "originalReleaseDate": "2013-10-06",
    "synopsis": "The twenty-fourth annual Simpsons Halloween episode features an opening directed by Guillermo del Toro and the following segments: \"Oh, the Places You'll D'oh!\": In this twisted parody of Dr. Seuss' children's books, Homer abducts Bart, Lisa, and Maggie and rides around Springfield wreaking havoc as \"The Fat in the Hat\". \"Dead and Shoulders\": In this parody of The Thing with Two Heads, after Bart is decapitated during a kite accident, his head is attached to Lisa's body and the two must live together as one -- until Bart discovers that he can fully function whenever Lisa is asleep, and sets out to incapacitate her so he can have her body. \"Freaks, No Geeks\": In this parody to the 1932 horror film, Freaks, Homer and Marge are circus performers (a strong man and a trapeze artist respectively) with Burnsum and Bailey, and Homer has a plan to marry Marge off to a circus freak (Moe) so he can rob him of an emerald ring."
  },
  {
    "seasonNumber": 25,
    "episodeNumberInSeason": 3,
    "title": "Four Regrettings and a Funeral",
    "originalReleaseDate": "2013-11-03",
    "synopsis": "At the funeral of a beloved Springfielder, four residents remember events in their lives they would like to do over. Homer regrets selling his stock in Apple to buy a bowling ball. Mr. Burns bought the stock and became richer. Marge blames her taste in music for Bart's rebelliousness while he performs pranks at the funeral. Mr. Burns remembers the end of his relationship with a Parisienne who immediately dies when they are reunited. Kent Brockman regrets not taking a job as a cable news anchor. Later, Bart floats away in a basket attached to hundreds of balloons. Kent covers the story for the news. Homer rescues Bart by shooting his bowling ball into the basket, and its weight brings it to the ground. Guest star: Rachel Maddow and Joe Namath"
  },
  {
    "seasonNumber": 25,
    "episodeNumberInSeason": 4,
    "title": "YOLO",
    "originalReleaseDate": "2013-11-10",
    "synopsis": "Marge invites an old pen pal to stay with Homer and cross items off his childhood wish list. His last wish is to fly like a flying squirrel. They build a wingsuit. When Homer flies, he hits Springfield's tallest building and falls towards the ground. Meanwhile, Lisa starts an honor code for the school to combat cheating. The students agree to it, but Lisa catches Bart cheating. He refuses to confess to the principal unless he sees a sign from God. Immediately, a falling Homer lands on Bart, which he thinks is a sign. He turns himself in and is given detention. Guest star: Jon Lovitz as Llewellyn Sinclair"
  },
  {
    "seasonNumber": 25,
    "episodeNumberInSeason": 5,
    "title": "Labor Pains",
    "originalReleaseDate": "2013-11-17",
    "synopsis": "After a night of playing poker with Moe, Lenny, and Carl, Homer finds himself in an elevator with a young mother named Gretchen, who is in labor and needs someone to help her keep calm. He helps her give birth to a boy, and she names him after Homer. He begins spending his poker nights with Gretchen and the baby until Marge finds out. Later, he takes Maggie and Homer Jr. to the zoo where Homer Jr. tries to hurt Maggie. Marge bans him from seeing Gretchen and Homer Jr. Taking him home, he finds Gretchen with her husband, who has returned from military deployment. Saddened, Homer goes home where Maggie comforts him. Meanwhile, Lisa helps the local football cheerleading team unionize and negotiate for better wages and working conditions. When they are successful, Lisa is concerned by the team's new endorsements of strange products. Guest star: Elisabeth Moss as Gretchen"
  },
  {
    "seasonNumber": 25,
    "episodeNumberInSeason": 6,
    "title": "The Kid Is All Right",
    "originalReleaseDate": "2013-11-24",
    "synopsis": "Lisa makes friends with a new girl in school, who turns out to be a conservative Republican. They compete for class president with the local Republican party trying to support the new girl against her wishes. At the final debate, they agree to a truce and support whoever wins. The new girl wins in a close vote, but the exit poll says that more students agree with Lisa's views. Lisa is happy with the result even though it shows that the students do not like her. Guest star: Anderson Cooper as himself, Maurice LaMarche, and Eva Longoria as Isabel Guiterrez"
  },
  {
    "seasonNumber": 25,
    "episodeNumberInSeason": 7,
    "title": "Yellow Subterfuge",
    "originalReleaseDate": "2013-12-08",
    "synopsis": "When Principal Skinner promises that the most well-behaved at Springfield Elementary will get to ride in a submarine, Bart does everything possible to become a model student. When Bart is removed from consideration for accidentally dirtying the school, Homer helps Bart seek revenge. Skinner finds his mother, Agnes, stabbed to death and thinks he did it. Homer and Bart help him hide the body. They send him to Mexico, but he returns because he feels guilty and tells them he was glad to do it. Agnes, helping with their scheme, hears this and is angered, vowing to punish him. Meanwhile, Krusty, on Lisa's advice, sells the foreign rights to his show in order to rake in more money, but the international Krustys soon become more popular than the domestic one. When he offers to appear on the international shows for money, they chase him away. Guest star: Kevin Michael Richardson"
  },
  {
    "seasonNumber": 25,
    "episodeNumberInSeason": 8,
    "title": "White Christmas Blues",
    "originalReleaseDate": "2013-12-15",
    "synopsis": "Springfield becomes a tourist hotspot after an accident involving the nuclear plant and the Springfield tire fire causes snow to fall for the first time in a while. When Springfield's stores raise their prices, Marge cannot afford to pay for things, so she turns their house into a bed and breakfast for the out-of-towners. The guests complain about Marge's poor guest service, which annoys her. When Christmas comes, she is surprised when the guests sing Christmas carols to her. Meanwhile, Lisa buys gifts for the family intended to make her feel good. She gives a book to Bart, who burns it. Arguing with him, she realizes she was wrong. She sells the gift Bart gave her to buy a tablet computer for Bart."
  },
  {
    "seasonNumber": 25,
    "episodeNumberInSeason": 9,
    "title": "Steal This Episode",
    "originalReleaseDate": "2014-01-05",
    "synopsis": "To combat the poor viewing atmosphere in movie theaters, Homer and Bart begin to illegally download movies and exhibit them in a makeshift theater in the backyard. Feeling guilty, Marge sends money and an apology letter to the studios, who call the FBI. Homer is arrested, and Marge admits it was her fault. At his trial, Homer passionately advocates for movie piracy, and the studios drop the charges in exchange for the rights to Homer's story. Before the movie is released, the townsfolk surprise Homer with a pirated exhibition, which angers Homer because he receives a percentage of the movie's profits. As they watch the movie in the theater, Bart and Lisa debate who was right. Guest star: Judd Apatow, Will Arnett, Rob Halford, Leslie Mann, Kevin Michael Richardson, Seth Rogen, Paul Rudd and Channing Tatum"
  },
  {
    "seasonNumber": 25,
    "episodeNumberInSeason": 10,
    "title": "Married to the Blob",
    "originalReleaseDate": "2014-01-12",
    "synopsis": "At his store, Comic Book Guy is feeling lonely. When a Japanese manga artist, Kumiko, enters, he asks her out on a date. He asks Homer and Marge for dating advice. As their courtship advances, they move in together. When Homer meets Kumiko's father, he tells him about Comic Book Guy's worst qualities. This causes him to object to the relationship, saddening Kumiko. Marge forces Homer to fix it, so he takes Kumiko's father to a bar where they become intoxicated, and the father learns he is wrong. Comic Book Guy offers to get a job with his engineering degree, but Kumiko's father decides he approves of the relationship the way it is. Later, Comic Book Guy and Kumiko get married. Guest star: Harlan Ellison, Maurice LaMarche and Stan Lee"
  },
  {
    "seasonNumber": 25,
    "episodeNumberInSeason": 11,
    "title": "Specs and the City",
    "originalReleaseDate": "2014-01-26",
    "synopsis": "Mr. Burns gives his workers Google Glass-style computer glasses so he can spy on them. When Homer becomes addicted to using them, Homer gives the glasses to Marge. When he cannot live without them, he goes to Burns' office for another pair and discovers his surveillance system. He discovers that Marge has been going to therapy to discuss their life. He goes to confront her and overhears that Marge saying that always feels better after therapy, so he secretly leaves her alone. Meanwhile, Bart is forced to give every student a Valentine's Day card. Seeing Nelson bully everyone, Bart tears apart the card intended for him. Angered, Nelson forces him to give him the best Valentine ever. He gives Nelson a card, but tells him the horrible future in store for him. Nelson hugs him for his honesty. Guest star: Maurice LaMarche and Will Lyman"
  },
  {
    "seasonNumber": 25,
    "episodeNumberInSeason": 12,
    "title": "Diggs",
    "originalReleaseDate": "2014-03-09",
    "synopsis": "When Bart is about to be attacked by bullies, a student named Diggs saves him with his falcon. He shows Bart the falconry club, and Bart learns to use the falcon to perform pranks. One day, Diggs jumps from a tree because he thinks people can fly. Digg is sent to a mental hospital, which saddens Bart. Later, in the falconry club, Diggs comes in claiming he has a day pass to participate in a falconry competition. He tells Bart that he plans to free the falcons at the contest. Bart helps him, and Diggs returns to the hospital after saying he will be there for a long time. Guest star: Daniel Radcliffe"
  },
  {
    "seasonNumber": 25,
    "episodeNumberInSeason": 13,
    "title": "The Man Who Grew Too Much",
    "originalReleaseDate": "2014-03-09",
    "synopsis": "After researching genetically modified food, Lisa concluded they could be beneficial. A chemical engineering company invites the Lisa and her family to visit, and they discover that Sideshow Bob has become their chief scientist. Lisa and Bob bond over science and culture. Visiting a museum, Bob saves Lisa from being crushed by an exhibit. Bob reveals that he has modified his own DNA to increase his strength. He is at the museum to collect the DNA of the geniuses in the exhibits to increase his intellect. Bart comes and provokes Bob, and he chases them to Springfield Dam. When Lisa reasons with him, Bob feels regret. He tries to kill himself by jumping into the water, but his genetically enhanced gills save him. Meanwhile, Marge is forced to volunteer for a teen abstinence program. Performing poorly, she brings in Homer to say they have been abstaining. The thought of them having sex disgusts them enough to pledge to abstain. Guest star: Kelsey Grammer"
  },
  {
    "seasonNumber": 25,
    "episodeNumberInSeason": 14,
    "title": "The Winter of His Content",
    "originalReleaseDate": "2014-03-16",
    "synopsis": "When the Retirement Castle is closed for health violations, Marge invites Grampa and two other old people to live at the Simpsons' house. Homer learns to embrace their lifestyle, which annoys Marge. Meanwhile, Bart defends Nelson's decision to wear his mother's underwear, causing the other bullies to invite him to join them. They go to a bully summit. When the bully leader is attacked, they blame Bart, and the bullies run back to Springfield, but the other bullies are there waiting for them. Homer and the old people see them and defend Bart. This action changes Homer back to his old ways. Guest star: Kevin Michael Richardson"
  },
  {
    "seasonNumber": 25,
    "episodeNumberInSeason": 15,
    "title": "The War of Art",
    "originalReleaseDate": "2014-03-23",
    "synopsis": "The Simpsons' living room art is destroyed, and Marge buys a new painting at the Van Houtens' yard sale to replace it. She learns that the painting is valuable and wants to sell it. She wants to split the proceeds with the Van Houtens, but Homer wants to keep it all. Overhearing, Milhouse tells his parents. When someone else claims ownership at the painting's auction, they go to an island artist community where Kirk claims he bought it. Kirk's story is verified, but a forger says that he created the forgery sold to Kirk, so the painting is worthless. To settle their differences, Homer pays the forger for paintings for both the Simpsons and Van Houtens. Guest star: Max von Sydow"
  },
  {
    "seasonNumber": 25,
    "episodeNumberInSeason": 16,
    "title": "You Don't Have to Live Like a Referee",
    "originalReleaseDate": "2014-03-30",
    "synopsis": "Springfield Elementary School holds a speech contest on the students' heroes. After Martin uses her first idea, Marie Curie, Lisa changes her speech to one on Homer. Lisa wins over the crowd and both kids' speeches are posted online. Lisa's goes viral, so much so that Homer is called to referee games in the World Cup in Brazil. Gangs and players try to bribe Homer, but he refuses because of Lisa. When Bart tells him that he was not Lisa's first choice, a saddened Homer begins to accept the bribes. At the World Cup Final, Lisa says his integrity makes Homer her real hero now. He decides not to fix the match for Brazil, which angers the gangs. As they try to kill Homer, Marge and a gangster's mother are able to make peace. Guest star: Andrés Cantor"
  },
  {
    "seasonNumber": 25,
    "episodeNumberInSeason": 17,
    "title": "Luca$",
    "originalReleaseDate": "2014-04-06",
    "synopsis": "Lisa saves a boy named Lucas from choking. He is a competitive eater. Lisa likes him and invites him to dinner. Patty and Selma compare him to Homer, and Marge is worried that he will ruin her future. She asks Homer to take Lisa to dinner and act gentlemanly so she loses interest in Lucas. Homer is insulted that Marge thinks Lisa marrying someone like Homer is bad. On the date, Marge interrupts to ask Homer for forgiveness. Later, Lucas gives up competitive eating to be a singer. Meanwhile, Bart helps Snake hide from the police. To thank him, Snake gifts Bart with stolen items. However, Milhouse finds his stolen tablet computer with Bart and helps the police arrest Snake. Bart tries to explain Snake's reasons for stealing to the police, but he has already escaped. Guest star: Zach Galifianakis"
  },
  {
    "seasonNumber": 25,
    "episodeNumberInSeason": 18,
    "title": "Days of Future Future",
    "originalReleaseDate": "2014-04-13",
    "synopsis": "A sequel to \"Future-Drama\" and a continuation of \"Holidays of Future Passed,\" set 30 years from now. In this futuristic installment, Bart goes to a clinic to rid himself of his feelings for his ex-wife Jenda (who is now dating a xenomorph-esque alien named Jerry), Lisa must choose whether or not to cure her zombie husband Milhouse after he gets bitten by a homeless zombie. While Marge, after putting up with years of Homer dying and being cloned back to life by Professor Frink, loads Homer onto a flatscreen monitor and throws him out of the house. Guest star: Amy Poehler"
  },
  {
    "seasonNumber": 25,
    "episodeNumberInSeason": 19,
    "title": "What to Expect When Bart's Expecting",
    "originalReleaseDate": "2014-04-27",
    "synopsis": "Bart makes a voodoo doll of his hippie art teacher when he gets sick of art class and cast a spell to make her sick. The next day, she announces she is pregnant. News spreads throughout town that Bart made someone pregnant, and couples come to make Bart perform the spell on them. Fat Tony kidnaps Bart and Homer and forces Bart to make a horse pregnant so he can have champion racehorses. They argue about how they ended up in this situation. Homer finds a male horse with which Fat Tony's horse is willing to mate. When it gets pregnant, they are freed. Guest star: Tavi Gevinson and Joe Mantegna"
  },
  {
    "seasonNumber": 25,
    "episodeNumberInSeason": 20,
    "title": "Brick Like Me",
    "originalReleaseDate": "2014-05-04",
    "synopsis": "In a Lego world, Homer wakes up and goes to the comic book store to pick up a Lego set for Lisa. Touching the Lego box, he has visions of a flesh world. Flesh Homer wants to enter a contest to build a Lego Springfield with Lisa, but Lisa wants to see a movie with her friends instead. While at the contest, flesh Homer wishes he was in a Lego world when a giant Lego set falls on him. Lego Homer realizes he is in a fantasy world, and Comic Book Guy says he can leave if he opens the box. Homer does not want to leave it until he realizes that he would not see his real family again. After battling Comic Book Guy, who wants to stay in the fantasy, Homer opens the box and returns to reality. Homer and Marge decide go the movies with Lisa and her friends."
  },
  {
    "seasonNumber": 25,
    "episodeNumberInSeason": 21,
    "title": "Pay Pal",
    "originalReleaseDate": "2014-05-11",
    "synopsis": "Marge is worried when Lisa says that she is comfortable with having no friends. One day at school, Lisa meets a girl with the same interests as her. They become friends, but Bart is suspicious. He follows her and catches her accepting money from Marge. He tells Lisa, who angrily confronts Marge and refuses to forgive her. Eventually, Marge is reduced to tears, and Lisa decides to apologize. Later, the girl apologizes to Lisa and says she likes her, but Lisa immediately leaves when she says she likes eating meat. Guest star: Carl Kasell, John Oliver and Peter Sagal"
  },
  {
    "seasonNumber": 25,
    "episodeNumberInSeason": 22,
    "title": "The Yellow Badge of Cowardge",
    "originalReleaseDate": "2014-05-18",
    "synopsis": "Milhouse has been training for the annual \"last day of school\" race. Martin hears this and makes a bet with the bullies that Milhouse will win. During the race, Nelson punches Milhouse in the head and disables him. Bart sees this, but he continues to the finish line and wins. Because of his injury, Milhouse forgets what happened. At the victory ceremony, Milhouse regains his memory and tells everyone what Bart did, which angers the town. Meanwhile, Homer finds someone to put on a Fourth of July fireworks show. When the day comes, they get into an argument, and the fireworks shoot into the crowd. Bart finds a way to protect them and gives the credit to Milhouse. Guest star: Glenn Close and Edwin Moses"
  }
]
