[
  {
    "seasonNumber": 16,
    "episodeNumberInSeason": 1,
    "title": "Treehouse of Horror XV",
    "originalReleaseDate": "2004-11-07",
    "synopsis": "The Ned Zone – Ned Flanders suffers a head injury that gives him the power to foresee doom a la Christopher Walken from The Dead Zone. Four Beheadings and a Funeral – Lisa and Bart investigate the murders of Victorian-era England's most prolific prostitutes. In the Belly of the Boss – The Simpsons go on a fantastic voyage through Mr. Burns's body to rescue Maggie after she gets shrunk down into a pill and ingested."
  },
  {
    "seasonNumber": 16,
    "episodeNumberInSeason": 2,
    "title": "All's Fair in Oven War",
    "originalReleaseDate": "2004-11-14",
    "synopsis": "After food from her remodeled kitchen earns rave reviews, Marge enters a cooking competition but her entry is sabotaged by the other contestants. Marge resorts to sabotage as payback, but Lisa catches her. In the finals, she declines to sabotage her opponent after finding a note from Lisa but loses the competition. Meanwhile, Homer finds his old issues of Playdude in the ceiling, which Bart finds after Marge cuts out all the centerfolds and other nude photos and uses them as a guide on how to live the bachelor life. When Homer sees that he read them, he teaches Bart about sex, which horrifies him. Guest stars: James Caan and Thomas Pynchon"
  },
  {
    "seasonNumber": 16,
    "episodeNumberInSeason": 3,
    "title": "Sleeping with the Enemy",
    "originalReleaseDate": "2004-11-21",
    "synopsis": "Feeling unappreciated by her own children, Marge takes in Nelson as her surrogate child when his mother abandons him, but he does not get along with Bart. He sees that Nelson misses his father. Meanwhile, Lisa's bottom grows too fat and gets teased by Sherri and Terri, so she purposely starves herself to be skinny. When Nelson sees what Lisa is doing, he unleashes a skunk on Sherri and Terri. Bart finds Nelson's father, and Nelson returns home with his father when his mother also returns."
  },
  {
    "seasonNumber": 16,
    "episodeNumberInSeason": 4,
    "title": "She Used to Be My Girl",
    "originalReleaseDate": "2004-12-05",
    "synopsis": "Marge bumps into Chloe, an old high-school acquaintance, who is now a successful news reporter. While Marge becomes jealous of her friend's success and wonders what may have been had she not stayed with Homer, Lisa becomes inspired by this new, strong woman. When Chloe invites Lisa to a conference, a jealous Marge attacks Chloe and forbids Lisa from going. Lisa sneaks away in Chloe's trunk, but Chloe goes to cover a volcano eruption with Lisa filming her, and they get trapped. Marge and Homer go and rescue them. Guest star: Kim Cattrall"
  },
  {
    "seasonNumber": 16,
    "episodeNumberInSeason": 5,
    "title": "Fat Man and Little Boy",
    "originalReleaseDate": "2004-12-12",
    "synopsis": "Bart becomes depressed about growing older after losing his last baby tooth, and, following advice from Lisa, deals with his problems by writing ironic slogans on T-shirts. He makes a deal with a salesman to sell the shirts. Meanwhile, Homer tries to help Lisa make a science project after Bart cuts Homer out of helping him sell T-shirts. He steals the plutonium from the power plant to build a nuclear reactor for Lisa. When the salesman sells the rights to the T-shirts and cuts Bart out of the rights to the profits, Homer threatens him with the reactor to get Bart's rightfully earned money. Guest star: Eric Idle"
  },
  {
    "seasonNumber": 16,
    "episodeNumberInSeason": 6,
    "title": "Midnight Rx",
    "originalReleaseDate": "2005-01-16",
    "synopsis": "Mr. Burns cancels the nuclear plant's prescription drug plan, prompting Homer and Grampa to smuggle prescription drugs in from Canada to medicate the town. When Flanders and Apu join them, they get exposed at the border, and are forbidden from returning to Canada. Mr. Burns soon regrets his actions when his faithful assistant Smithers suffers from a goiter. He joins Homer and Grampa on one last heist in his airplane. On the way home, they lose control of the place, and only Burns parachutes away. The plane crash-lands in Springfield, and Grampa is arrested for smuggling drugs but is freed because he was helping the town. Burns saves Smithers and brings back the drug plan."
  },
  {
    "seasonNumber": 16,
    "episodeNumberInSeason": 7,
    "title": "Mommie Beerest",
    "originalReleaseDate": "2005-01-30",
    "synopsis": "When Moe's Tavern is shut down by the health department, Homer takes out a new mortgage without consulting Marge to finance the bar's return, but Marge finds out and decides to protect her investment by becoming Moe's business partner and renovating the tavern into a pub. She starts to spend most of her time at the pub, which worries Homer. When Moe and Marge plan to attend a convention, and Lenny and Carl suggest they are having an emotional affair, Homer chases their airplane on the runway. Seeing this, Moe confesses his love for Marge, but Marge says she loves Homer."
  },
  {
    "seasonNumber": 16,
    "episodeNumberInSeason": 8,
    "title": "Homer and Ned's Hail Mary Pass",
    "originalReleaseDate": "2005-02-06",
    "synopsis": "After Homer inadvertently performs a wild crowd-pleasing dance at a local carnival, he is hired by several sports figures to teach them how to showboat. Seeing his popularity, he is hired to produce the Super Bowl halftime show. Meanwhile, Flanders creates ultra-violent, ultra-gory Bible movies à la Passion of the Christ. It is not well received to his dismay. When Homer is unable to think of an idea for his show, he recruits Ned to recreate a Biblical story, which is not well received because it is seen as forcing Christianity on the country. Guest stars: Tom Brady, Warren Sapp, LeBron James, Yao Ming and Michelle Kwan"
  },
  {
    "seasonNumber": 16,
    "episodeNumberInSeason": 9,
    "title": "Pranksta Rap",
    "originalReleaseDate": "2005-02-13",
    "synopsis": "Bart fakes his own kidnapping to get out of being punished for going to a rap concert. Chief Wiggum vows to solve the case, but no one takes him seriously. Meanwhile, Bart stays at Milhouse's father's apartment, but when Wiggum deduces where he is, Kirk is arrested, and Wiggum is promoted. Feeling guilty, Bart confesses to Wiggum, but he says Kirk is happy in prison. When Lisa and Principal Skinner deduce the truth, Bart and Wiggum stop them from exposing the truth because no one was hurt. Guest star: 50 Cent"
  },
  {
    "seasonNumber": 16,
    "episodeNumberInSeason": 10,
    "title": "There's Something About Marrying",
    "originalReleaseDate": "2005-02-20",
    "synopsis": "Homer becomes a minister after Springfield legalizes gay marriage to boost their damaged reputation for tourists, and Patty comes out of the closet, much to the shock of her sister, Marge, who was naive to her sister's sexuality. Patty is in love with a golfer named Veronica and asks Homer to marry them. Marge learns that Veronica is actually a man and chooses not to tell Patty. At the ceremony, Marge stops the wedding because she is touched by hearing Patty's wedding vow and exposes Veronica. Marge comes to accept Patty for who she is."
  },
  {
    "seasonNumber": 16,
    "episodeNumberInSeason": 11,
    "title": "On a Clear Day I Can't See My Sister",
    "originalReleaseDate": "2005-03-06",
    "synopsis": "After years of tolerating his antics, Lisa files a restraining order against Bart. When Bart appeals the order but accidentally insults the judge, he is forced to live in the backyard. As Bart becomes feral in the backyard, Marge tries to reason with Lisa, who says she will relent if she can name three nice things Bart has done for her, but Marge can only name two. When Bart builds a statue of Lisa in the backyard, she counts it as the third thing even though he planned to burn it in effigy. Meanwhile, Homer becomes a greeter for a Walmart-esque department store called \"Sprawl-Mart\". He is forced to work extra hours without pay because the manager implanted a compliance chip in his head. However, he rips it out and begins stealing the merchandise. Guest star: Gary Busey"
  },
  {
    "seasonNumber": 16,
    "episodeNumberInSeason": 12,
    "title": "Goo Goo Gai Pan",
    "originalReleaseDate": "2005-03-13",
    "synopsis": "After Selma begins experiencing menopause, she looks to adopt a child, and Lisa suggested adopting one from China. Because it only allows married couples to adopt, she lists Homer as her husband. In China, Marge poses as Selma and Homer's live-in nanny for Bart and Lisa. Selma is given a baby named Ling. As they tour China while they are investigated, Homer and Marge caught kissing, and Ling is taken away. The Simpsons steal Ling. When they are confronted, Selma makes an impassioned plea, Selma is allowed to keep Ling as a single mother. Guest stars: Lucy Liu and Robert Wagner Note: This episode was removed from the Disney+ streaming platform in Hong Kong due to references to the 1989 Tiananmen Square massacre."
  },
  {
    "seasonNumber": 16,
    "episodeNumberInSeason": 13,
    "title": "Mobile Homer",
    "originalReleaseDate": "2005-03-20",
    "synopsis": "Worried about Homer's health, Marge tells him to buy life insurance, and he is declared uninsurable. Marge begins to save money and place the saving in a jar, but Homer argues it is his money to spend since he earned it. Homer buys a motorhome with the money lives in it in the backyard. Marge is angered as Homer invites more motorhomes to come use their electricity until Marge makes them leave. Bart and Lisa, who worry their parents may get divorced, drive the motorhome back to the dealer. Homer and Marge chase after them, but Bart and Lisa lose control of the vehicle and land on a Turkish freighter. They retrieve the children by trading for Marge's cans of mushroom soup."
  },
  {
    "seasonNumber": 16,
    "episodeNumberInSeason": 14,
    "title": "The Seven-Beer Snitch",
    "originalReleaseDate": "2005-04-03",
    "synopsis": "After Shelbyville accuses Springfield of being hicks, Marge convinces the townspeople to fund a Frank Gehry-designed concert hall, which is then converted to a for-profit prison when the concert hall goes bankrupt on opening night. Homer is sent to prison for a minor crime and is rewarded for reporting on other prisoners. When they learn about Homer, the prisoners attack Homer while the guards are locked out. When Homer is rescued, he informs the governor about the poor living conditions of the prison and is released. Meanwhile, Bart and Lisa investigate Snowball II's recent weight gain. They follow it and learn that a second family has been feeding it. Guest stars: Frank Gehry, Charles Napier, and Joe Mantegna"
  },
  {
    "seasonNumber": 16,
    "episodeNumberInSeason": 15,
    "title": "Future-Drama",
    "originalReleaseDate": "2005-04-17",
    "synopsis": "Through Professor Frink's future machine, Bart and Lisa see their lives eight years in the future. Lisa has a scholarship to Yale and is dating Milhouse while Bart is dating a girl named Jenda, who breaks up with him because he has no plans for the future. To win Jenda back, he gets a job delivering groceries when he saves Mr. Burns from being robbed. As a reward, he gives Lisa's scholarship to him. Although Jenda returns to him, Bart feels guilty, so he gives the scholarship back to Lisa and breaks up with Jenda. Meanwhile, Home and Marge have separated after he buys an underwater home, and Marge is dating Krusty, but she ends things with him and reunites with Homer. Guest stars: Amy Poehler and John DiMaggio"
  },
  {
    "seasonNumber": 16,
    "episodeNumberInSeason": 16,
    "title": "Don't Fear the Roofer",
    "originalReleaseDate": "2005-05-01",
    "synopsis": "The Simpson family is angry at Homer for not fixing the leaking roof, so he goes out and encounters a roofer named Ray who agrees to help. He and Homer fix the roof while everyone is gone, but they make it worse. Ray promises to fix it but does not come back. The family thinks Ray is only Homer's imaginary friend and commits him to a mental hospital. Six weeks later, Homer is convinced that Ray is imaginary and is released just as Ray returns and everyone can see him. It is explained why no one saw Ray earlier, and he disappeared because he is a contractor. Meanwhile, Santa's Little Helper is left at the retirement home because the residents like him, but the family takes him back when it starts acting old. Guest stars: Ray Romano and Stephen Hawking"
  },
  {
    "seasonNumber": 16,
    "episodeNumberInSeason": 17,
    "title": "The Heartbroke Kid",
    "originalReleaseDate": "2005-05-01",
    "synopsis": "Springfield Elementary signs a deal with a snack company to install vending machines in the schools with Bart taking advantage of the situation to the point that he becomes obese and suffers a heart attack. He is taken to a fat camp to lose weight, and the family pays for it by turning their home into a youth hostel. When Bart refuses to lose weight, he is taken home and shown that his family is being humiliated by the hostel residents. Bart fights his addiction to junk food, including destroying the school vending machines. He uses the money from the machines to pay for the camp, and the family kicks out the residents. Guest star: Albert Brooks"
  },
  {
    "seasonNumber": 16,
    "episodeNumberInSeason": 18,
    "title": "A Star Is Torn",
    "originalReleaseDate": "2005-05-08",
    "synopsis": "When Lisa's singing soothes the family when they get food poisoning eating unprocessed foods, they convince her to enter a singing competition. At the audition, another girl sings a better version of her song, so Homer writes a new song for her. Lisa is accepted into the competition with Homer as her manager. Homer uses violence to get preferential treatment for Lisa until she fires him for it. Homer joins with her rival in the final round. Lisa sings a song dedicated to Homer while he sabotages her rival to ensure Lisa wins. Guest star: Fantasia Barrino"
  },
  {
    "seasonNumber": 16,
    "episodeNumberInSeason": 19,
    "title": "Thank God, It's Doomsday",
    "originalReleaseDate": "2005-05-08",
    "synopsis": "Homer sees a movie about the end of the world and fears the same thing will happen in real life after seeing a chain of random occurrences such as celebrities (\"stars\") falling from the sky, raining blood, and a man in a realistic devil costume. He does a complicated math equation that predicts the end will come on May 18th, but when the end does not come, Homer discovers a flaw in the equation and ends up in Heaven where he meets God and learns that God is planning The Rapture. Seeing his family tormented by the devil, he vandalizes Heaven until God agrees to undo the Rapture and returns him to Earth."
  },
  {
    "seasonNumber": 16,
    "episodeNumberInSeason": 20,
    "title": "Home Away from Homer",
    "originalReleaseDate": "2005-05-15",
    "synopsis": "Flanders rents a room to two college girls who, without his knowledge, use the spare room to broadcast live softcore pornographic web videos of themselves. Upset that no one in town told him this and that Homer was the one who told everyone, Ned moves to the seemingly perfect town of Humbleton, Pennsylvania, while a brash coach moves into Flanders' house and begins harassing Homer the same way Homer harassed Ned. Homer goes to retrieve Ned, who is shunned in his new town because of his mustache, and they overpower the coach so Ned can be Homer's neighbor again. Guest star: Jason Bateman"
  },
  {
    "seasonNumber": 16,
    "episodeNumberInSeason": 21,
    "title": "The Father, the Son, and the Holy Guest Star",
    "originalReleaseDate": "2005-05-15",
    "synopsis": "Bart gets expelled from school and transfers to a Catholic school, where a hip priest named Father Sean tries to convert Bart and Homer to Catholicism, which worries Marge when she believes that Catholics do not go to the same heaven as Protestants and discovers that Catholic women do not use birth control. With help from Reverend Lovejoy and Ned Flanders, they take Bart to a Protestant youth festival to tempt him with rock music and paintball, but Father Sean and Homer arrive to stop them. Bart says that differences between different forms of Christianity are minuscule compared to their similarities, so they all agree to fight homosexuality and stem cell research. Guest star: Liam Neeson"
  }
]
