[
  {
    "seasonNumber": 13,
    "episodeNumberInSeason": 1,
    "title": "Treehouse of Horror XII",
    "originalReleaseDate": "2001-11-06",
    "synopsis": "In the twelfth Treehouse of Horror episode: Hex and the City – While on a day trip through Ethnictown, Homer's bumbling catches the ire of a gypsy, who curses Homer's family and friends into receiving nothing but bad luck. House of Whacks – In this mixed parody of Demon Seed and 2001: A Space Odyssey, Marge buys an automated house and customizes it with the Pierce Brosnan personality, who falls for Marge and attempts to murder Homer. Wiz Kids – In this Harry Potter parody, Bart and Lisa go to a school for wizards, and Lord Montemort (Mr. Burns) uses Bart to capture Lisa's magic."
  },
  {
    "seasonNumber": 13,
    "episodeNumberInSeason": 2,
    "title": "The Parent Rap",
    "originalReleaseDate": "2001-11-11",
    "synopsis": "Bart gets in trouble for joyriding in a police car, but feels confident he will be let off by Judge Snyder. However, Snyder goes on vacation before ruling his verdict and is replaced with a coldhearted judge named Constance Harm. She accuses Homer of being a negligent father and sentences him to be tethered to Bart. The two are against it at first but later start to bond. Marge however is unable to take anymore of it and slices the tether off of them both. Homer and Marge then go after Judge Harm only to end up sinking her houseboat. Eventually Bart decides to take punishment and is about to be sentenced to 5 years in juvenile hall, but Judge Snyder returns and dismisses Harm."
  },
  {
    "seasonNumber": 13,
    "episodeNumberInSeason": 3,
    "title": "Homer the Moe",
    "originalReleaseDate": "2001-11-18",
    "synopsis": "Moe becomes depressed and decides to return to bartending school so he can re-evaluate himself. He meets an old teacher, who suggests that Moe try improving his bar, which might make him happier. Moe takes the advice, and turns his bar into a trendy nightclub, which does not sit well with his regular customers Homer, Lenny, Carl and Barney."
  },
  {
    "seasonNumber": 13,
    "episodeNumberInSeason": 4,
    "title": "A Hunka Hunka Burns in Love",
    "originalReleaseDate": "2001-12-02",
    "synopsis": "Homer becomes a fortune cookie writer for a Chinatown restaurant. Mr. Burns reads one of Homer's fortunes, which says that the reader will find love before Flag Day is over. Burns goes searching for love and meets Gloria, a meter maid, and asks her out. Gloria reluctantly agrees, and Burns recruits Homer to help him look young and hip to his new girlfriend."
  },
  {
    "seasonNumber": 13,
    "episodeNumberInSeason": 5,
    "title": "The Blunder Years",
    "originalReleaseDate": "2001-12-09",
    "synopsis": "After tricking Marge into thinking an advertising spokesman is coming to visit her, Homer takes Marge and the rest of the family to a restaurant. A hypnotist uses his powers on Homer, and makes him remember a horrific childhood incident where Homer found a dead body in a ravine. The Simpson family decides to investigate this and find out where the body came from."
  },
  {
    "seasonNumber": 13,
    "episodeNumberInSeason": 6,
    "title": "She of Little Faith",
    "originalReleaseDate": "2001-12-16",
    "synopsis": "After Homer and Bart's model rocket damages the church, Mr. Burns makes a deal to commercialize the church in return for paying for the damages. Lisa becomes disgusted at what the church has become, so she decides to find a new religion suitable for her. She eventually converts to Buddhism, causing Marge to fear for Lisa's soul. Although the family tries to tempt her, she learns that she can respect other religions while also being a Buddhist."
  },
  {
    "seasonNumber": 13,
    "episodeNumberInSeason": 7,
    "title": "Brawl in the Family",
    "originalReleaseDate": "2002-01-06",
    "synopsis": "A social worker is assigned to make the Simpson family functional after they get arrested for fighting while playing Monopoly. He helps them learn how to work together and function as a family. The moment is ruined when Ginger and Amber, the barmaids who married Homer and Flanders while they were drunk in \"Viva Ned Flanders\", arrive at the Simpsons' home, which outrages Marge."
  },
  {
    "seasonNumber": 13,
    "episodeNumberInSeason": 8,
    "title": "Sweets and Sour Marge",
    "originalReleaseDate": "2002-01-20",
    "synopsis": "Springfield is officially declared the World's Fattest Town after an attempt to break a world record lands everyone on top of a truck scale. Out of embarrassment and disgust, Marge goes on a crusade against the local sugar corporation. However, when sugar is banned, Homer, Bart, Mr. Burns and Apu start bootlegging sugar. When Marge sees what is happening, she asks Homer to drop the sugar from the ship into the harbor. Although he relents, the residents jump into the harbor to drink the sugar water, leading to the end of the sugar ban. Note: This episode was dedicated to Ron Taylor the voice of Bleeding Gums Murphy."
  },
  {
    "seasonNumber": 13,
    "episodeNumberInSeason": 9,
    "title": "Jaws Wired Shut",
    "originalReleaseDate": "2002-01-27",
    "synopsis": "A jaw injury from colliding with a new town statue turns Homer into a better listener while recuperating with his jaws wired shut, but once the wires come off, Homer does not go back to being loud and obnoxious and Marge becomes starved for thrills, so she joins the demolition derby. When things become dangerous, Homer goes to save her, and she make him promise to be more adventurous so she does not have to be the adventurous one."
  },
  {
    "seasonNumber": 13,
    "episodeNumberInSeason": 10,
    "title": "Half-Decent Proposal",
    "originalReleaseDate": "2002-02-10",
    "synopsis": "Homer develops a snoring problem, so Marge decides to spend a night with her sisters Patty and Selma. After a night of drinking, Marge sees a news report about her ex-prom date Artie Ziff, who is now very wealthy, and decides to send him an e-mail. Artie is still obsessed with Marge, so he offers the Simpsons $1 million in exchange for Marge spending a weekend with him."
  },
  {
    "seasonNumber": 13,
    "episodeNumberInSeason": 11,
    "title": "The Bart Wants What It Wants",
    "originalReleaseDate": "2002-02-17",
    "synopsis": "Bart befriends Rainer Wolfcastle's daughter Greta. She has a crush on Bart, but he does not seem to realize it and eventually stops seeing her. Seeking revenge, Greta begins dating Bart's best friend Milhouse, which causes Bart to start missing her. She leaves for Toronto with her father, and Bart convinces his family to follow them there. Bart and Milhouse fight, and when Greta forces them to choose, they both decline her."
  },
  {
    "seasonNumber": 13,
    "episodeNumberInSeason": 12,
    "title": "The Lastest Gun in the West",
    "originalReleaseDate": "2002-02-24",
    "synopsis": "While running away from a vicious dog, Bart meets Buck McCoy, a former Western film star. Bart begins hanging out with him and starts to idolize him. Bart wants to help McCoy stage a comeback, so he convinces all of the kids in town to become interested in the Wild West. McCoy then appears on the Krusty the Clown Show, but the comeback flops when Buck begins drinking again and injures Krusty."
  },
  {
    "seasonNumber": 13,
    "episodeNumberInSeason": 13,
    "title": "The Old Man and the Key",
    "originalReleaseDate": "2002-03-10",
    "synopsis": "Grampa falls in love with Zelda, a woman who has an interest in men who can drive. He decides to get his driver's license back, but ignores Homer and Marge's concerns that she is only using him for his car. When he crashes Homer's car and Homer takes his keys, Zelda goes on a trip with Grampa's rival, Zack. Grampa and Bart steal Marge's car to go to Zelda, but Grampa declares that she was only using him, and he reconciles with Homer."
  },
  {
    "seasonNumber": 13,
    "episodeNumberInSeason": 14,
    "title": "Tales from the Public Domain",
    "originalReleaseDate": "2002-03-17",
    "synopsis": "When Homer gets a notice from the library that he has a book of classic tales that is years overdue, he finds it on the shelf and reads three stories: The Odyssey (where Homer and his bar buddies try to get home after fighting the Trojans), Joan of Arc (where Lisa leads the French against the English with the help of God), and Hamlet (where Bart tries to kill Moe after Moe kills Homer in order to marry Marge)."
  },
  {
    "seasonNumber": 13,
    "episodeNumberInSeason": 15,
    "title": "Blame It on Lisa",
    "originalReleaseDate": "2002-03-31",
    "synopsis": "When Homer gets the family's telephone service cut off for refusing to pay for calls made to Rio de Janeiro, Brazil, Lisa confesses that she was the one who called Rio after sponsoring an orphan who goes missing. She convinces the family to travel to Brazil to look for him. However, once there, they have no luck finding him, and Homer is kidnapped. They find the orphan, who now has a high-paying job and gives money to pay for Homer's ransom. They use the money to rescue Homer."
  },
  {
    "seasonNumber": 13,
    "episodeNumberInSeason": 16,
    "title": "Weekend at Burnsie's",
    "originalReleaseDate": "2002-04-07",
    "synopsis": "Homer is prescribed medicinal marijuana after getting pecked in the eyes by a murder of crows. While his family and friends worry about the drug altering his personality, Homer becomes Mr. Burns's vice president after cracking up at Burns' antiquated jokes. However, medical marijuana is outlawed, and Homer stops using it. When Homer gives Smithers his last joint to laugh at Burns' jokes, he accidentally lets Burns drown in the bathtub. Because he needs to make a speech to save the power plant, Homer and Smithers move his body like a puppet, which impresses the investors and also restarts Burns' heart."
  },
  {
    "seasonNumber": 13,
    "episodeNumberInSeason": 17,
    "title": "Gump Roast",
    "originalReleaseDate": "2002-04-21",
    "synopsis": "In this clip show episode, Homer is honored at a Friars' Club Roast. A number of characters show up to roast him, but the celebrating is interrupted by Kang and Kodos, who say that humanity will be judged based on Homer's experiences. They probe Maggie's brain and are moved by what they see, so they spare humanity in exchange for awards show tickets."
  },
  {
    "seasonNumber": 13,
    "episodeNumberInSeason": 18,
    "title": "I Am Furious (Yellow)",
    "originalReleaseDate": "2002-04-28",
    "synopsis": "Inspired by a cartoonist who speaks at the school as part of a career day assembly, Bart creates a comic book series based on Homer and his anger problems, which turns into a popular Internet cartoon series called Angry Dad. Homer finds out about this and is at first outraged, but after talking to his family, he decides to try to become a less angry person."
  },
  {
    "seasonNumber": 13,
    "episodeNumberInSeason": 19,
    "title": "The Sweetest Apu",
    "originalReleaseDate": "2002-05-05",
    "synopsis": "Homer and Marge discover that Apu is having an affair with the Squishee delivery lady at the Kwik-E-Mart. They decide to keep Apu's wife Manjula from finding out about it. However, she eventually learns of Apu's affair by watching store security tapes. She throws Apu out of the house and decides to file for divorce, but soon realizes that she misses him."
  },
  {
    "seasonNumber": 13,
    "episodeNumberInSeason": 20,
    "title": "Little Girl in the Big Ten",
    "originalReleaseDate": "2002-05-12",
    "synopsis": "Lisa tries to fit in with two college students by lying about her age. She finds that the college atmosphere is perfect for her, but her lie is soon discovered and she is shunned by her fellow elementary school students. Meanwhile, Bart is diagnosed with a weakened immune system after getting bitten by a Chinese mosquito and must live in a plastic, germ-free bubble."
  },
  {
    "seasonNumber": 13,
    "episodeNumberInSeason": 21,
    "title": "The Frying Game",
    "originalReleaseDate": "2002-05-19",
    "synopsis": "While faced with community service for abusing an endangered insect, Homer begins assisting an elderly woman named Mrs. Bellamy. When Mrs. Bellamy is murdered one night by a robber, Homer and Marge are the ones suspected for committing the crime. When the police find Bellamy's necklace in their home, they are arrested. To save Marge, Homer says he committed the murder and is sentenced to be executed. At his execution, it is revealed he is on Fox's new reality show that frames people for crimes, and Bellamy is revealed to be Carmen Electra."
  },
  {
    "seasonNumber": 13,
    "episodeNumberInSeason": 22,
    "title": "Poppa's Got a Brand New Badge",
    "originalReleaseDate": "2002-05-22",
    "synopsis": "Homer starts a security company with Lenny and Carl after the police are ineffective during a blackout, and eventually Mayor Quimby decides to have them replace the police. Homer finds that he excels at the job, but then he runs afoul of mob boss Fat Tony, who threatens Homer with death unless he leaves town. With no one willing to protect Homer, the mob comes to his house to kill him when someone starts shooting at the mobsters, and they leave. Homer gives his police powers back to Chief Wiggum, and it is revealed that Maggie protected Homer."
  }
]
