[
  {
    "seasonNumber": 33,
    "episodeNumberInSeason": 1,
    "title": "The Star of the Backstage",
    "originalReleaseDate": "2021-09-26",
    "synopsis": "Marge is given her old production manual about her high school play, \"Y2K: The Millennium Bug\" and is filled with warm memories of being the stage manager. But when she is encouraged to reunite her old classmates to restage the play, old rival Sasha Reed arrives to Springfield, and Marge realizes that, due to being unseen by the audience in the backstage, Sasha was the star of the show. Marge learns that Sasha is a saleswoman and not an actress as she claims. When Marge exposes her, she leaves in tears. Marge apologizes to Sasha when she realizes that Sasha's singing voice was the best part about the play. She returns to the play, and it is a success. Guest stars: Kristen Bell as Marge's singing voice, Sara Chase as Sasha Reed and Elisabeth Kiernan Averick as Artsy Teenage Girl"
  },
  {
    "seasonNumber": 33,
    "episodeNumberInSeason": 2,
    "title": "Bart's in Jail!",
    "originalReleaseDate": "2021-10-03",
    "synopsis": "Grampa is tricked by a phone scammer into believing that he needs to bail Bart out of jail, costing him $10,000. When Homer learns that that money was intended to be his inheritance, he blames Grampa for falling for a stupid trick. When Grampa keeps getting phone scams, Lisa has Grampa talk to them, so she can track its origin. The scammers are found to be people working for minimum wage and are arrested. Marge is disillusioned by an apparently corrupt world. Determined not to be cynical, she gives money to a woman who needs it for gas along with her address to pay her back. When she receives the money in the mail, Marge's faith is restored, but it was Grampa who sent her the money. Guest stars: Alan Cumming as Loki, Scott Hanson as \"Punt Zone\" Announcer, Alex Hirsch as Bill Cipher and Joel H. Cohen as Old Joel"
  },
  {
    "seasonNumber": 33,
    "episodeNumberInSeason": 3,
    "title": "Treehouse of Horror XXXII",
    "originalReleaseDate": "2021-10-10",
    "synopsis": "In the thirty-second annual Simpsons Halloween special: * \"Barti\": Marge warns Barti and Milhouse about a hunter. Milhouse gets killed as Barti and Marge run away. After escaping, Barti searches for his mother, who is fine, as Homer and Lenny killed the hunter. * \"Bong Joon Ho's This Side of Parasite\": Bart becomes a tutor for a rich girl. The other family members also get jobs at the estate, supplanting the Van Houtens. Soon, the city erupts into a class-driven riot, with only the Simpsons surviving. * \"Nightmare on Elm Tree\": Homer chops down the tree in the backyard. The tree trunk is struck by lightning and becomes alive. Learning that people chop down trees for Christmas, it brings other plants to life, and they kill the townsfolk. * \"Poetic Interlude\": Vincent Price reads a story to Maggie about how Bart spent a year doing mischief, with the story being animated in the art style of Edward Gorey. * \"Dead Ringer\": The schoolchildren watch a video that kills anyone who watches it. When they die, Lisa and Bart investigate. They learn that the video is haunted by a girl who did not receive any valentines and died falling down a well. Lisa summons the girl and gives her a valentine. They become friends until Lisa annoys her, and she jumps down the well. Guest stars: Susan Egan as the \"You'll Never Sleep Again\" Singer, Maurice LaMarche as Vincent Price and Tree Rollins as himself"
  },
  {
    "seasonNumber": 33,
    "episodeNumberInSeason": 4,
    "title": "The Wayz We Were",
    "originalReleaseDate": "2021-10-17",
    "synopsis": "Evergreen Terrace is stuck in a major traffic jam because a map app recommends the route. In traffic, Moe finds his former love Maya in the car behind him. They quickly reunite and spend time together. However, Moe is worried that Maya will leave him. Homer assures Moe that Maya loves him and would never leave him. Moe proposes to Maya, and she accepts. Meanwhile, the Simpsons call a neighborhood meeting to deal with the traffic and learn that everyone hates them. Homer volunteers to fix the traffic problem. With Professor Frink's help, they digitally erase the street from the map. The Simpsons become popular until Homer becomes annoyed by it. Guest stars: Trey Anastasio as himself and Pamela Reed as Ruth Powers"
  },
  {
    "seasonNumber": 33,
    "episodeNumberInSeason": 5,
    "title": "Lisa's Belly",
    "originalReleaseDate": "2021-10-24",
    "synopsis": "Lisa and Bart contract an infection from an abandoned waterpark attraction, requiring treatment from steroids that cause temporary weight gain. Before they go back to school, Marge tells Lisa that she is getting \"chunky\" in affection, which causes her to be very insecure about her weight. Marge tries to fix the issue but makes it worse. Marge and Lisa visit a hypnotherapist, and they go into Lisa's mind. They see the word \"chunky\" taking up all the space. They go to Marge's mind where they see the word \"plain\". Empathizing with each other, they reconcile and make the words shrink. Meanwhile, Bart gets in shape with Jimbo, Nelson, Dolph, and Kearney. However, when he sees them with their girlfriends, he runs back to the other children. Guest star: Renee Ridgeley as Dr. Wendy Sage"
  },
  {
    "seasonNumber": 33,
    "episodeNumberInSeason": 6,
    "title": "A Serious Flanders",
    "originalReleaseDate": null,
    "synopsis": "Ned Flanders finds a bag of money and donates it to the local orphanage in the name of his grandfather Ned. A debt collector named Kostas sees it on the news and finds that it is the amount he was supposed to collect. Ned goes on a date with Barb, the director of the orphanage but is disgusted to learn she is in an open marriage with Sideshow Mel. Kostas' henchmen kidnap Homer, thinking he is Ned. Kostas tells Ned to get him the money, or he will kill Homer. Marge looks for Homer and ends up at the donut shop with Kostas and Fat Tony. When Fat Tony threatens Kostas because his henchmen attacked Comic Book Guy earlier, Kostas kills Fat Tony. As he leaves, Marge sees that he dropped Homer's worker identification card. In a flashback, a corrupt Sheriff Ned Flanders is protecting the Szyslak brothers as they pay their debt to Kostas and the mafia. They get into a shootout. Flanders hides the money before he is killed by Kostas. In the present, Homer tricks the henchmen into arguing. They cause a fire, and they are killed while Marge rescues Homer. Ned steals the money by seducing Barb to get the key to the safe. As he leaves, he notices Homer and Marge as he drives past them and crashes his car. Homer saves Ned from the burning car, but an ashamed Marge sees that he tried to get the money first. Three years later, Homer visits a hiding Ned to give him supplies. Marge secret follows him and is happy to see a selfless Homer, but Kostas follows her. Kostas tell Ned about his grandfather, and an angry Ned attacks him. They fight on a frozen lake, and Kostas falls in and drowns. Ned returns to Springfield with his reputation intact. Guest stars: Brian Cox as Kostas Becker, Joe Mantegna as Fat Tony, Cristin Milioti as Barbara \"Barb\" Belfry, Timothy Olyphant as Sheriff Ned \"Paw Paw\" Flanders, Chris O'Dowd as Seamus and Jessica Paré as Collette"
  },
  {
    "seasonNumber": 33,
    "episodeNumberInSeason": 7,
    "title": "Portrait of a Lackey on Fire",
    "originalReleaseDate": "2021-11-21",
    "synopsis": "Smithers is disheartened by Mr. Burns' lack of reciprocal feelings. Fashion designer Michael de Graaf comes to collect a puppy born from one of Burns' hounds. Homer encourages Smithers to start a relationship with him, and they quickly fall in love. Michael builds a new manufacturing plant in town, but the Simpsons notice its poor working conditions. When Homer tells Smithers, he asks Burns for advice. He says that the fast fashion industry is worse than nuclear power but tells him to marry Michael for his money. He decides to stay with Michael until he sees Michael mistreat his puppy. He ends things with Michael, who leaves Springfield. With Michael leaving the puppy behind, Smithers adopts it since it will give him unconditional love. Guest stars: Christine Baranski as herself, Victor Garber as Michael de Graaf and Christian Siriano as himself"
  },
  {
    "seasonNumber": 33,
    "episodeNumberInSeason": 8,
    "title": "Mothers and Other Strangers",
    "originalReleaseDate": "2021-11-28",
    "synopsis": "When Mother's Day comes, Homer starts to miss his mother again. To deal with his grief, he uses online therapy to reflect on his earlier years. A teenage Homer, who thought his mother was dead, receives a postcard from Mona. Homer and Grampa go to Utah to meet her but are followed by the FBI. They are chased into a canyon where Grampa gets stuck. Homer must choose between saving Grampa or escaping with Mona. He chooses Grampa while Mona escapes. After therapy, Homer reveals that Mona secretly visited him when Bart was born. Guest stars: Rachel Bloom as Annette and Glenn Close as Mona Simpson"
  },
  {
    "seasonNumber": 33,
    "episodeNumberInSeason": 9,
    "title": "A Made Maggie",
    "originalReleaseDate": "2021-12-19",
    "synopsis": "The Simpsons find Maggie with Ned when Grampa is unable to care for her. Marge mentions that Maggie is not yet baptized, so she sends Homer to find an appropriate godfather for her. After Fat Tony saves Homer and Maggie's lives, Homer and Marge reluctantly agree to let the mafia don be their baby's sponsor. Maggie is baptized with Selma as the godmother. Tony's henchmen babysit Maggie, and she begins to act like a mafia boss. However, Johnny Tightlips plots against Fat Tony for being soft. When he tries to kill Fat Tony, he defeats Johnny Tightlips but resigns from being Maggie's godfather for being a bad influence. Guest star: Joe Mantegna as Fat Tony"
  },
  {
    "seasonNumber": 33,
    "episodeNumberInSeason": 10,
    "title": "The Longest Marge",
    "originalReleaseDate": "2022-01-02",
    "synopsis": "The Springfield Atoms draft football player Grayson Mathers. Mr. Burns' liquor company is doing poorly, so he hires Mathers as its spokesman. When he gets drunk on the liquor and plays poorly, he is ostracized. Later, he becomes unconscious from the liquor and sees Marge taking care of him when he wakes up. Burns has Marge care for him and keep him sober. Mathers performs better on the football field, but Burns is angry that Marge will not allow Mathers to have fun with him. Seeing Marge and Burns argue, Mathers forces them to sit next to each other at a sports awards ceremony. When Mathers wins an award, they reconcile, but Mathers thanks his fiancé, whom he met days earlier and is now his business manager, supplanting Marge and Burns. Guest stars: Beck Bennett as Grayson Mathers, John Mulaney as Warburton Parker and Adam Schefter as himself Note: This episode is dedicated to the memory of guest star John Madden, who died four days before it aired."
  },
  {
    "seasonNumber": 33,
    "episodeNumberInSeason": 11,
    "title": "Pixelated and Afraid",
    "originalReleaseDate": "2022-02-27",
    "synopsis": "Lisa and Bart hold an intervention after feeling that their parents are stuck in a cringe worthy relationship rut devoid of romance. Homer and Marge reluctantly agree to go to a couples resort in the wilderness with no technology or modern entertainment. On the way, they drive off the road and crash into a frozen river. Without a functioning car or phone, they build a fire but accidentally burn their wet clothes. They find an abandoned cabin where they make new clothes, but a wolverine watches them. They catch and cook a fish to eat, but it attracts the wolverine. Homer lures it away, but he gets trapped. Marge distracts it. As it chases Marge, Homer catches and kills it. This brings them closer together. The next day, they follow tracks from the park ranger bike to a ranger station."
  },
  {
    "seasonNumber": 33,
    "episodeNumberInSeason": 12,
    "title": "Boyz N the Highlands",
    "originalReleaseDate": "2022-03-06",
    "synopsis": "A juvenile court sends Bart, Nelson, and Dolph on a wilderness trek together as punishment. Martin volunteers to accompany them. Along the way, they rescue a baby goat, but a group of Satanists demand the goat. After escaping, Nelson and Dolph abandon Bart, Martin, and the goat and find shelter. Martin, angry that Bart only treats him well when they are alone, reveals that he is also being punished for stealing medication to focus on academics. The Satanists find Nelson and Dolph and prepare to sacrifice them. Bart and Martin rescue them, and the Satanists are revealed to be film students. At their destination, the bullies accept Bart and Martin as part of the group. Meanwhile, Lisa takes advantage of Bart's absence to make Homer and Marge lavish attention on her as if she were an only child. She has a good time until she gets sick for eating too much ice cream. She is satisfied when she wakes up in bed with Homer and Marge."
  },
  {
    "seasonNumber": 33,
    "episodeNumberInSeason": 13,
    "title": "You Won't Believe What This Episode Is About – Act Three Will Shock You!",
    "originalReleaseDate": "2022-03-13",
    "synopsis": "A series of unfortunate events make it look like Homer intentionally locked Santa's Little Helper in the car on a hot day, which angers the town. Lisa writes an apology note for Homer to read at church, but he accidentally knocks Reverend Lovejoy out of the church window. Videos of the incidents go viral online. The Simpsons meet a man named Theo, who owns an institute that can restore Homer's image. They stage acts of charity, but it fails. Theo has computer code that can erase media from the internet. They break into the headquarters of a clickbait site. Homer realizes the code will also erase the videos of bad acts of political leaders, which is the purpose of the institute. Instead, he reads Lisa's apology note to the world, and the town forgives him. Guest stars: Kumail Nanjiani as Theo and Jay Pharoah as Drederick Tatum"
  },
  {
    "seasonNumber": 33,
    "episodeNumberInSeason": 14,
    "title": "Bart the Cool Kid",
    "originalReleaseDate": "2022-03-20",
    "synopsis": "Homer promises to buy Bart a pair of limited-edition sneakers but buys counterfeits instead. When the sneakers fall apart, Bart tries to return them, and he is humiliated publicly and declares that Homer is the least cool person ever. When young shoe creator Orion Hughes feels sorry for Bart and donates his branded skate wear and merchandise, Bart learns that the famous kid influencer cannot skate himself. Bart teaches him, and Orion allows Bart to design a pair of sneakers. Meanwhile, a dejected Homer uses Orion's gifted clothing to influence other middle-aged men to dress in clothes to prove they can be cool. Bart and Orion worry that Homer will ruin the brand. To prevent Homer and his friends from ruining the release party of Bart's shoes, Bart has Marge remind Homer of who he is, and Homer and his friends start acting their age again. Guest stars: Kelly Macleod sings \"Duplicate Cop 2\" theme song, Michael Rapaport as Mike Wegman and The Weeknd as Orion Hughes and Darius Hughes"
  },
  {
    "seasonNumber": 33,
    "episodeNumberInSeason": 15,
    "title": "Pretty Whittle Liar",
    "originalReleaseDate": "2022-03-27",
    "synopsis": "When Brandine Spuckler reveals at Marge's book club that she loves reading books, Cletus finds out and feels like he does not even know her anymore, which causes her to leave and move in with the Simpsons. Marge learns that Brandine and the townsfolk think that she could have married someone better than Homer. When she tells Homer, he tries to convince Cletus to immediately take back Brandine. Meanwhile, Lisa joins a group of smart kids at school who hide their intellect to avoid being bullied. Brandine tells Lisa not to hide her intelligence. At school, when Lisa uses her intellect to challenge Principal Skinner, he declares the school day cancelled. Brandine moves home and learns that Cletus checked out a library book to have something in common with her. At home, Homer fixes things around the house to impress Marge because he will never find anyone better."
  },
  {
    "seasonNumber": 33,
    "episodeNumberInSeason": 16,
    "title": "The Sound of Bleeding Gums",
    "originalReleaseDate": "2022-04-10",
    "synopsis": "Lisa becomes enraged when a song by Bleeding Gums Murphy is remixed to promote the Springfield lottery, leading her to track down the late jazz musician's son. Lisa learns that Monk Murphy was born deaf, but his father could not afford a cochlear implant. When she learns that Monk is not receiving royalties from his father's music, she goes to the publisher to fight for it, but Monk is not interested. Lisa says she was trying to save Monk the way her father saved her, but Monk says he does not need saving. Monk wins the lottery and gets the implant, and Lisa plays his father's music to him. Guest stars: John Autry II as Monk Murphy, Kathy Buckley as Thespian Girl and Eli Steele as \"The Sky's the Limit\" Director Additional vocals: Kaylee Arellano, Hazel Lopez, and Ian Mayorga singing \"Happy Talk\""
  },
  {
    "seasonNumber": 33,
    "episodeNumberInSeason": 17,
    "title": "My Octopus and a Teacher",
    "originalReleaseDate": "2022-04-24",
    "synopsis": "Bart starts acting strangely when new teacher Ms. Peyton takes over his classroom, confusing not only her but everybody around him. Peyton has each class work on a scale model project. Meanwhile, Lisa breaks the prime directive of nature documentary film-making when she stops a shark from eating a small octopus. She secretly keeps her new octopus in her room, but it keeps escaping. When Homer thinks Bart is infatuated with the teacher, he reveals that while Lisa was filming her documentary, he snuck into a beach resort. When he starting drowning in the pool, Peyton noticed and rescued him, but she does not currently recognize him. Later, he sees Peyton with her husband, causing him to destroy a water fountain and admit to an infatuation. As the school presents the models, Homer tells Bart to let her go, and Lisa realizes that she must let the octopus go. However, the octopus latches on to Bart's face, causing him to destroy the models. Bart admits to Peyton that he was the drowning boy and that he likes her. Peyton resolves to continue being Bart's teacher. Lisa releases the octopus but tosses away another shark. Guest star: Kerry Washington as Ms. Peyton"
  },
  {
    "seasonNumber": 33,
    "episodeNumberInSeason": 18,
    "title": "Girls Just Shauna Have Fun",
    "originalReleaseDate": "2022-05-01",
    "synopsis": "Lisa is selected as a replacement saxophonist for the high school marching band where she discovers to her surprise that Shauna Chalmers shares a similar passion for music. When Homer comes to pick up Lisa at Shauna’s house after practicing, Superintendent Chalmers invites him to try his Trappist beer. When he likes it, he teaches Homer how to brew the next batch. Meanwhile, Lisa encourages Shauna to try out for lead drummer. When she wins, she and Lisa are invited to a party. Shauna steals Chalmers' beer for the party. When Chalmers discovers what happened, he and Homer go to the party for fear of serving alcohol to minors. Meanwhile, Shauna abandons Lisa at the party, so she calls the police. Homer and Chalmers discover that Homer forgot to add yeast, making the beer non-alcoholic. Later, when Shauna comes to babysit Lisa, they forgive each other and play music. Guest star: Chris Redd as Trevor McBride"
  },
  {
    "seasonNumber": 33,
    "episodeNumberInSeason": 19,
    "title": "Marge the Meanie",
    "originalReleaseDate": "2022-05-08",
    "synopsis": "When Marge is badmouthed in public by her former principal Ms. York, she reveals that she was prankster in her middle school years. Bart and Marge both bond over this newly unveiled connection between them, so Marge starts committing pranks on people. Feeling guilty, Marge pledges to stop, but Bart wants her to do one more. They decide to prank York, but it causes her to apparently die. The police come to arrest Marge and Bart, but as Bart tries to reason with Chief Wiggum, it is revealed that Marge and York teamed up to teach Bart a lesson. Meanwhile, Home and Lisa bond over a shared love for food, but Homer struggles to maintain a mutual passion for Lisa's vegan tastes. Homer admits this to her when a vegan stew gives him an allergic reaction, but Lisa gets the same reaction. At the hospital, Homer apologizes for passing down his allergies, but Lisa says he also passed his kind heart to her. Note: This episode is dedicated to the memory of animator Ian Wilcox, who died 8 days before it aired."
  },
  {
    "seasonNumber": 33,
    "episodeNumberInSeason": 20,
    "title": "Meat Is Murder",
    "originalReleaseDate": "2022-05-15",
    "synopsis": "When billionaire Augustus \"Gus\" Redfield buys Krusty's parent company as revenge after Krusty stole his burger business years ago, he asks former business partner Grampa Simpson to join his board of directors. Grampa and Lisa go to New York where the rest of the Redfield family want to oust Gus, and his ambitious daughter Sheila tries to manipulate Lisa into getting Grampa on their side in a vote of no-confidence. As the tie-breaking vote, Grampa votes for Gus, who reveals his plan to use Grampa to expose his children's plot. Seeing this, Grampa acts crazy, which nullifies his vote. As the rest of them argue, Grampa and Lisa leave and go home. Meanwhile, Krusty struggles to perform without his identity. Later, while at a kibbutz in Israel, a lawyer reveals Gus' plot to Krusty, and his company is returned to him. Guest stars: Nicholas Braun as \"Cousin\" Greg Hirsch, Charli D'Amelio as herself, Susan Egan as Singing tree, Seth Green as Mav Redfield, John Lithgow as Augustus \"Gus\" Redfield, Edi Patterson as Jessica, Krysten Ritter as Sheila Redfield and Paul F. Tompkins as Colby Redfield"
  },
  {
    "seasonNumber": 33,
    "episodeNumberInSeason": 21,
    "title": "Poorhouse Rock",
    "originalReleaseDate": "2022-05-22",
    "synopsis": "Bart makes an embarrassing presentation about his father for Sunday school, so Marge encourages Homer to take Bart to work with him to show their son what a good provider Homer is. Seeing his privileges and pay, Bart begins to idolize Homer and wants to grow up to be just like him. However, a janitor at the plant explains that the once thriving middle class his father is part of is not likely to occur for him due to the current economic and political environment. Bart says he can trade cryptocurrency or be a social media influencer, but the janitor says that is also unlikely. Unsure of what to do, the janitor tells him to burn the system down. Bart takes it literally and burns his clothes and treehouse. Firefighters rescue him, and Bart wants to be a firefighter after he learns about their pay and benefits. Guest stars: Hugh Jackman as a janitor, Megan Mullally as Sarah Wiggum and Robert Reich as himself"
  }
]
