[
  {
    "seasonNumber": 29,
    "episodeNumberInSeason": 1,
    "title": "The Serfsons",
    "originalReleaseDate": "2017-10-01",
    "synopsis": "In a fantasy world, the Serfsons find Marge's mother Jacqueline slowly freezing into ice. The doctor says she has been bitten by an ice monster and needs to wear an amulet to stop it. Homer is unable to find enough money for the amulet, so Lisa uses her abilities to turn lead into gold. Jacqueline gets her amulet and wears it while King Quimby takes Lisa away for witchcraft. The peasants revolt and defeat the king's wizards but are stopped by his dragon. Jacqueline takes off her amulet and sacrifices herself to kill the dragon. They realize that the dragon is their source of magic, but Lisa suggests creating a society based on science. Instead, the peasants revive the dragon who burns down the village. Guest stars: Billy Boyd as himself and Nikolaj Coster-Waldau as Markery"
  },
  {
    "seasonNumber": 29,
    "episodeNumberInSeason": 2,
    "title": "Springfield Splendor",
    "originalReleaseDate": "2017-10-08",
    "synopsis": "When Lisa keeps having nightmares, Homer and Marge send her to a therapy student because they cannot afford a therapist. She tells Lisa to draw her feelings while at home. Being bad at drawing, Marge makes the drawings while Lisa talks. Going to the therapy student, the drawings fall out of Lisa's bag. Kumiko finds them and publishes them because she thinks it is a comic book. When Lisa sees people buying it, she is delighted. At a fan convention, Lisa takes all the credit, which hurts Marge. Later, a theater director wants to make a play based on the comic book, but focuses on the art style and not Lisa's character. At the debut, Lisa is saddened that the play ignores her character, so Marge draws Lisa's face on a spotlight to cheer up Lisa but ruins the play. Guest stars: Alison Bechdel as herself, Rachel Bloom as Annette, Roz Chast as herself, Dan Harmon as himself, Marjane Satrapi as herself and Martin Short as Guthrie Frenel Note: This episode was dedicated to Tom Petty"
  },
  {
    "seasonNumber": 29,
    "episodeNumberInSeason": 3,
    "title": "Whistler's Father",
    "originalReleaseDate": "2017-10-15",
    "synopsis": "Homer discovers Maggie can whistle. Wanting to become famous, he brings her to a talent show. When he sees the behavior of other show business children and their parents, he tries to stop her but fails. However, on stage, Maggie is unable to whistle because a tooth is starting to grow. When the audience turns against her, Homer defends Maggie. Meanwhile, Fat Tony asks Marge to redecorate a post office he acquired after seeing her decorate a room at Springfield Elementary. After her work is done, she discovers the building is a brothel. However, she convinces him to shut it down by showing that his mother kept a letter from the pope in a mail box in the building. Guest stars: Nick Fascitelli as Professor Whistler, Valerie Harper as Backstage Mom and Joe Mantegna as Fat Tony"
  },
  {
    "seasonNumber": 29,
    "episodeNumberInSeason": 4,
    "title": "Treehouse of Horror XXVIII",
    "originalReleaseDate": "2017-10-22",
    "synopsis": "In the twenty-eighth annual Simpsons Halloween special: * \"The Exor-Sis\": Maggie is possessed by Pazuzu, a vengeful demon. Before he is killed, Ned Flanders says she needs an exorcism. A priest removes it from Maggie, and after jumping into Bart, the demon says he is more evil that it is. * \"Coralisa\": Lisa discovers an alternate reality where the Simpsons are nicer but have buttons for eyes. She chooses to stay there by exchanging her eyes for buttons. When they notice Lisa is missing, the rest of the Simpsons follow her to the alternative reality, but Homer accidentally kills some alternate Simpsons. He decides to bring everyone back to live in the prime reality. * \"MMM... Homer\": While grilling a hot dog, Homer accidentally cuts off his finger and cooks it. He decides to eat it and starts cooking more of his body because he likes the taste. Mario Batali offers to cook the rest of his body to serve in his restaurants, and the townsfolk begin eating other people. Guest stars: Mario Batali as himself, Ben Daniels as a priest, Neil Gaiman as Snowball and William Friedkin as Dr. Kenneth Humphries"
  },
  {
    "seasonNumber": 29,
    "episodeNumberInSeason": 5,
    "title": "Grampy Can Ya Hear Me",
    "originalReleaseDate": "2017-11-05",
    "synopsis": "The retirement community give Grampa hearing aids for his birthday. At the Simpson home, Grampa hears how the family dislikes him, so he leaves. He ends up at a bar, and the bartender calls Homer to take him home. Arriving back home, Grampa hears how the family was missing him, and they hug. Meanwhile, Principal Skinner discovers that his mother hid an admission letter from Ohio State from him, sabotaging his burgeoning marching band career. He moves into the storage room at school. When he confronts his mother, she feels remorseful. Skinner forgives her, and he moves back in under his conditions."
  },
  {
    "seasonNumber": 29,
    "episodeNumberInSeason": 6,
    "title": "The Old Blue Mayor She Ain't What She Used to Be",
    "originalReleaseDate": "2017-11-12",
    "synopsis": "After Mayor Quimby insults Marge, she decides to run for mayor against him. After promising to extinguish the tire fire, she wins. A souvenir stand owner tries to prevent Marge from putting out the fire. After the owner gains people's sympathy, Marge loses support from the voters. To win back the town, Marge gives a speech from her kitchen during which she berates Homer, which people like. Later, Marge becomes uncomfortable with people laughing at Homer, so she makes a speech declaring her love for him, which people do not like. In the future, it is revealed that Marge was removed from office and the job was given back to Quimby."
  },
  {
    "seasonNumber": 29,
    "episodeNumberInSeason": 7,
    "title": "Singin' in the Lane",
    "originalReleaseDate": "2017-11-19",
    "synopsis": "Homer reunites his old bowling team, the Pin Pals, with Moe as their coach. They perform well but form a rivalry with a team of rich bankers. They are due to face off in the finals, and Moe bets his bar that the Pin Pals will win. During the match, the bankers incapacitate Barney. Thinking he will lose, Moe begins to imagine that his life will be better without the bar. Despite Moe trying to make them lose, Homer wins the match. At the bar, the team celebrates with Moe because he is their friend, and they go on a zero-gravity plane ride for winning the bet."
  },
  {
    "seasonNumber": 29,
    "episodeNumberInSeason": 8,
    "title": "Mr. Lisa's Opus",
    "originalReleaseDate": "2017-12-03",
    "synopsis": "An older Lisa is writing her college application essay to Harvard. She recalls how everyone forgot her seventh birthday. On her fourteenth birthday, Lisa discovers that Marge is ready to leave Homer. She tells Homer to stop drinking. With Ned's help, he is successful, which saves his marriage. In the future, Lisa is accepted into Harvard. While moving into her dorm and feeling inferior compared to her classmates, her family encourages her, and she helps her roommate who is feeling the same way. Guest stars: Kat Dennings as Valerie, Valerie Harper as Ms. Myles, Norman Lear as himself, Kipp Lennon as Leon Kompowsky and Jon Lovitz as Artie Ziff"
  },
  {
    "seasonNumber": 29,
    "episodeNumberInSeason": 9,
    "title": "Gone Boy",
    "originalReleaseDate": "2017-12-10",
    "synopsis": "While on a drive with Homer, Bart needs to urinate, so he goes in the forest. He falls down a manhole and discovers a military bunker. With Bart missing, the townsfolk look for him, including the prison inmates such as Sideshow Bob. Milhouse finds him and goes back into town to find help. Meanwhile, Bart is declared dead. When Milhouse arrives at the Simpson house, Lisa hugs Milhouse for comfort, so he does not tell her about Bart. Unable to accept Bart's death, Sideshow Bob finds Milhouse and forces him to tell him where Bart is. Milhouse and Bob go down the manhole, and Bart and Milhouse are attached to the missile in the bunker. Bob attempts to launch the missile but, feeling guilty, frees the children before it blasts off. Bob returns to prison feeling relieved. Guest stars: Kelsey Grammer as Sideshow Bob, Valerie Harper as a Nurse and Shaquille O'Neal as himself"
  },
  {
    "seasonNumber": 29,
    "episodeNumberInSeason": 10,
    "title": "Haw-Haw Land",
    "originalReleaseDate": "2018-01-07",
    "synopsis": "The Simpsons go to a STEM conference, where Lisa becomes smitten with an older musician named Brendan. Upon seeing them together, Nelson gets jealous because of his past relationship with Lisa and tries to win her over instead. Meanwhile, Bart discovers his affinity for chemistry. However, when Superintendent Chalmers is injured after drinking acid, Homer and Marge suspect Bart. At a school talent show, Brendan and Nelson perform while Bart does a chemistry demonstration. Brendan is disqualified for living outside of the school district, and Lisa is sad to see him leave. Nelson performs poorly and wants to improve before winning over Lisa. Bart performs well after Marge believes he is innocent. Groundskeeper Willie admits to poisoning Chalmers. However, Bart's demonstration ends with prank that fills the school with foam. Guest star: Ed Sheeran as Brendan"
  },
  {
    "seasonNumber": 29,
    "episodeNumberInSeason": 11,
    "title": "Frink Gets Testy",
    "originalReleaseDate": "2018-01-14",
    "synopsis": "Mr. Burns builds a doomsday ark after he believes that the end of the world is near. Professor Frink devises a way of testing everyone in Springfield after Burns wants a test to determine who should go on the ark with him. Homer, Marge, and Lisa perform well while Bart performs the worst. However, Frink switched Homer and Bart's scores due to Homer's poor penmanship. Marge teaches Homer how to write better, and he writes romantic notes to Marge. Lisa, concerned that Ralph scored higher than her, shows Frink evidence of Ralph's luck, so he gives her more points so his test's flaws are not exposed. The winners board the ark where Burns declares they will be his slaves. They decide to leave, so Burns flies his ark by himself, but he is strangled by a robot. Guest stars: Valerie Harper as Proctor Clarkeson and Maurice LaMarche as Orson Welles"
  },
  {
    "seasonNumber": 29,
    "episodeNumberInSeason": 12,
    "title": "Homer Is Where the Art Isn't",
    "originalReleaseDate": "2018-03-18",
    "synopsis": "Megan Matheson beats Mr. Burns and Homer at winning a painting at auction. The painting is stolen, and Manacek is called to investigate. He interviews Matheson and Burns. Marge explains why Homer wanted the painting. Homer became obsessed with the painting after chaperoning a field trip to the art museum. Lisa and Homer bonded over the painting, but the paintings were sold at auction to fund the town's projects. Manacek concludes that Homer is innocent. He reveals that Matheson stole the painting for the insurance money, but Burns built a replica auction house and had already stolen the painting before her. However, he also reveals that Lisa had stolen the painting before them and replaced it with a replica. She did not want the painting hidden in a rich person's mansion. Returning it to the town, the painting is hung in the town's football arena, paid for with proceeds from the auction, where Lisa and Homer go to view it. Guest stars: Bill Hader as Manacek and Cecily Strong as Megan Note: This episode was dedicated to Stephen Hawking"
  },
  {
    "seasonNumber": 29,
    "episodeNumberInSeason": 13,
    "title": "3 Scenes Plus a Tag from a Marriage",
    "originalReleaseDate": "2018-03-25",
    "synopsis": "Homer and Marge visit their old apartment and recount the story of their early married life. Marge worked as a journal photographer while Homer worked at a startup company. After Bart was born, Homer lost his job because he did not have enough time to work at the company. While Marge interviewed an artist, Bart destroyed his art, so Marge was fired when the journal lost its art advertisers. With Bart causing trouble, Reverend Lovejoy showed a video that advised them to have a second child, which may force Bart to behave. Thus, Lisa was born. Guest stars: John Baldessari as himself, Kevin Pollak as Ross, Bagel Man and Professor and J. K. Simmons as J.J. Gruff"
  },
  {
    "seasonNumber": 29,
    "episodeNumberInSeason": 14,
    "title": "Fears of a Clown",
    "originalReleaseDate": "2018-04-01",
    "synopsis": "Principal Skinner exposes Bart as a prankster. Embarrassed, Bart glues Krusty masks to the teachers' faces, which makes people scared of clowns and ruins Krusty's show. Urged by Marge, Bart is sent to be rehabilitated. To make Bart feel guilty, the doctor tricks Bart into almost injuring Marge with a prank. Bart plans to make a speech to apologize to everyone, but he plans to drop water balloons on them. Seeing Marge there, he feels guilty but fails to stop the prank. However, Marge accepts that this is Bart's nature. Meanwhile, Lisa tells Krusty to become a serious stage actor. While performing his play, Krusty accidentally makes the audience laugh, and he realizes that he is not a serious actor. Guest stars: Andy Daly as Judge Dowd, Damian Kulash as himself, Jon Lovitz as Llewellyn Sinclair, Jackie Mason as Rabbi Krustofsky and Tim Nordwind as himself"
  },
  {
    "seasonNumber": 29,
    "episodeNumberInSeason": 15,
    "title": "No Good Read Goes Unpunished",
    "originalReleaseDate": "2018-04-08",
    "synopsis": "Marge takes the family to a bookstore. Bart buys The Art of War to manipulate Homer. Using the book, he convinces Homer to take him and Milhouse to a video game convention. While there, he gets Milhouse to reveal Bart's scheme. Reading the book, Homer begins to act like Ned Flanders until he and Bart come to a truce. Meanwhile, Marge buys her favorite book from her childhood. She reads it to Lisa, and she realizes the book is culturally insensitive. She edits a new version for Lisa, who finds that the new book has no meaning. Going to Springfield University, they learn that scholars believe that the original book is satire, but no one is truly convinced. Guest stars: Daniel Radcliffe as himself and Jimmy O. Yang as Sun Tzu"
  },
  {
    "seasonNumber": 29,
    "episodeNumberInSeason": 16,
    "title": "King Leer",
    "originalReleaseDate": "2018-04-15",
    "synopsis": "Homer and Marge find out that Moe is having a big argument with his father. They invite Moe and his family to their house for dinner. Moe says that his family sold mattresses. His family tried to force Moe to sabotage a rival store, but he refused. Home and Marge get the Szyslaks to reconcile, and his father gives each of his children a store. However, Moe's family plans to sabotage Moe, so they attack each other's stores. Marge tries to end their conflict, but she realizes that they do not belong together. Guest stars: Ray Liotta as Morty Szyslak, Moe's father; Debi Mazar as Minnie Szyslak, Moe's sister; and Jonathan Schmock as Salesman"
  },
  {
    "seasonNumber": 29,
    "episodeNumberInSeason": 17,
    "title": "Lisa Gets the Blues",
    "originalReleaseDate": "2018-04-22",
    "synopsis": "Lisa develops a disorder that prevents her from playing the saxophone well, which saddens her. When a flight the Simpsons are on is diverted to New Orleans, Marge tells Homer to use the situation to help cheer up Lisa. She has a vision of Louis Armstrong, who tells her to listen to Homer and enjoy the city. She meets Bleeding Gums Murphy's nephew who says that Lisa was the best musician he knew. He encourages her to play his saxophone, and she is able to perform well again. Guest star: Trombone Shorty as Trombonist Note: This episode was dedicated to R. Lee Ermey voice of Colonel Leslie Hapablap"
  },
  {
    "seasonNumber": 29,
    "episodeNumberInSeason": 18,
    "title": "Forgive and Regret",
    "originalReleaseDate": "2018-04-29",
    "synopsis": "While on his deathbed, Grampa makes a confession to Homer, who promises not to reveal it. However, Grampa makes a recovery, which angers Homers. When the family fails to force them to make up, Homer reveals that he and Mona used to bake pies, and she gave him a box with the recipes. When she left, Grampa threw the box over a cliff. With the family angered, Grampa tries to retrieve the box. The family goes to stop Grampa from his dangerous task, but they manage to find only the empty box. On the way home, they eat pie that tastes like Mona's at a restaurant. The server says she found the recipes falling from the sky one day and gives the recipes back to Homer. Guest star: Glenn Close as Mona Simpson"
  },
  {
    "seasonNumber": 29,
    "episodeNumberInSeason": 19,
    "title": "Left Behind",
    "originalReleaseDate": "2018-05-06",
    "synopsis": "When the Leftorium shuts down, Homer helps Ned get a job in human resources at the power plant. Irritated by Ned's methods, Homer prays for Ned to be fired. When it happens, Ned gets a series of jobs that leave him depressed. Marge tells him to be like Jesus and become a teacher. He becomes a substitute teacher at Springfield Elementary but resigns after Bart is forced to prank him. Homer and Bart apologize to Ned, and they convince him to return to teaching by reminding him of Edna. With Bart's help, Ned devises a way to get his class to obey him. Guest star: Marcia Wallace as Edna Krabappel (via archive recording)"
  },
  {
    "seasonNumber": 29,
    "episodeNumberInSeason": 20,
    "title": "Throw Grampa from the Dane",
    "originalReleaseDate": "2018-05-13",
    "synopsis": "When Grampa needs an operation, Lisa suggests they take him to Denmark so that he can benefit from its socialized medicine system. Enjoying the culture, Marge, Bart, and Lisa consider moving there while Homer is reluctant. Grampa reveals that he merely wanted to remove a tattoo of Mona, so he and a saddened Homer drink at a bar. While there, Marge catches Homer dancing with another woman. While Homer and Grampa prepare to leave for home, Marge decides to stay. Grampa advises Homer not to be stubborn like he was with Mona, so he goes and says he will stay with Marge. However, she dislikes the size of their apartment, so the entire family returns home. Guest star: Sidse Babett Knudsen as Danish bar woman"
  },
  {
    "seasonNumber": 29,
    "episodeNumberInSeason": 21,
    "title": "Flanders' Ladder",
    "originalReleaseDate": "2018-05-20",
    "synopsis": "Bart is struck by lightning and is left in a coma. Lisa decides to talk to him and give him nightmares for scaring her earlier. He has visions of Maude Flanders and other ghosts. He learns he must help give the ghosts closure. Maude wants revenge on Homer, so he gets the bullies to shoot t-shirts at Homer, killing him. Feeling guilty, Bart stops Homer from ascending to heaven, but Homer strangles Bart for ruining his opportunity. Bart's condition worsens, so Lisa begins to plead for Bart to stay with her. When she says she loves Bart, his condition improves, and he wakes up. Admitting what she did, Bart is not angry and wants to learn how to do what she did to other people. Guest stars: Jackie Mason as Rabbi Krustofsky Note: This episode was dedicated to Tom Wolfe."
  }
]
