[
  {
    "seasonNumber": 20,
    "episodeNumberInSeason": 1,
    "title": "Sex, Pies and Idiot Scrapes",
    "originalReleaseDate": "2008-09-28",
    "synopsis": "After being bailed out of jail for starting a brawl at an alcohol-free St. Patrick's Day parade, Homer becomes a bounty hunter and tags Flanders along for the ride. Flanders quits after Homer dangerously pursues a bounty. When Homer skips his hearing, Flanders chases after Homer, but they reconcile after they get trapped together. Meanwhile, an Irish man gives Marge a job at his bakery, which Marge soon discovers specializes in sexually suggestive cakes. When Homer is sentenced for a short stay in prison, Marge sends him a cake to help him get through it. Guest Stars: Julia Louis-Dreyfus, Robert Forster and Joe Mantegna."
  },
  {
    "seasonNumber": 20,
    "episodeNumberInSeason": 2,
    "title": "Lost Verizon",
    "originalReleaseDate": "2008-10-05",
    "synopsis": "Bart feels left out after realizing he is the only kid in this day and age without a cell phone, so he tries to work in a country club as a golf ball finder to earn money for it and finds Denis Leary's phone instead. He uses it for mischief until Marge secretly activates the phone's tracking and filtering capabilities to monitor Bart. Lisa informs Bart, who ties the phone's tracker to a bird. Worried, the family follows the bird to Machu Picchu, where Marge has a dream that teaches her to let Bart care for himself, while Bart remains at home. Returning home, Marge and Bart reconcile. Guest Stars: Denis Leary and Brian Grazer. Note: This episode was dedicated to Paul Newman."
  },
  {
    "seasonNumber": 20,
    "episodeNumberInSeason": 3,
    "title": "Double, Double, Boy in Trouble",
    "originalReleaseDate": "2008-10-19",
    "synopsis": "When Lenny wins the lottery and invites the Simpsons to a party at the Woosterfield Hotel, Bart meets Simon Woosterfield, a boy who looks exactly like him and is a member of Springfield's richest family. As a prank, the two decide to switch places, but the joke is on Bart when he discovers that Simon is being targeted for murder by his own siblings. When Lisa discovers who Simon is, and he tells the Simpsons about his family, they go and rescue Bart. The two boys return to their own families. Guest Star: Joe Montana."
  },
  {
    "seasonNumber": 20,
    "episodeNumberInSeason": 4,
    "title": "Treehouse of Horror XIX",
    "originalReleaseDate": "2008-11-02",
    "synopsis": "Intro: Homer tries to vote for Barack Obama but the machine is rigged to place votes for John McCain—and kill anyone who reveals it. Untitled Robot Parody: In this light parody of Transformers, Lisa gets a Malibu Stacy car that turns into a robot bent on fighting the mortal enemy of his race (more transforming robots). It's the Grand Pumpkin, Milhouse: In this parody of It's the Great Pumpkin, Charlie Brown, Milhouse summons a demon pumpkin, who goes berserk when he discovers that humans carve his brethren into jack-o-lanterns as Halloween tradition."
  },
  {
    "seasonNumber": 20,
    "episodeNumberInSeason": 5,
    "title": "Dangerous Curves",
    "originalReleaseDate": "2008-11-09",
    "synopsis": "As the Simpsons drive to a cabin in the woods, Homer and Marge remember their love life. Twenty years earlier, Homer and Marge meet Ned and Maude on their honeymoon, and they are forced to sleep in separate rooms to avoid premarital sex. Ned encourages Homer to marry Marge, and he carves their names into a tree. Five years earlier, Homer and Marge nearly have affairs with Sylvia and Alberto but keep it a secret from each other. At the cabin, the Simpsons meet Alberto and Sylvia, who are now married, and learn of their secrets. When Homer sees the names he carved into the tree, he cuts it out and reconciles with Marge. Guest Star: Maurice LaMarche."
  },
  {
    "seasonNumber": 20,
    "episodeNumberInSeason": 6,
    "title": "Homer and Lisa Exchange Cross Words",
    "originalReleaseDate": "2008-11-16",
    "synopsis": "Lisa becomes obsessed with crossword puzzles and enters a tournament. Meanwhile, Homer earns money from helping couples break up. At the tournament, Homer bets his money on Lisa and wins. Learning Lisa is unsure about the final round, he bets against her and wins again when she loses. Angry that Homer bet against her, she disowns him. To apologize, Homer commissions a New York Times crossword with his apology written in the clues and solution, and the two reconcile. Guest Stars: Will Shortz, Merl Reagle and Scott Thompson."
  },
  {
    "seasonNumber": 20,
    "episodeNumberInSeason": 7,
    "title": "MyPods and Boomsticks",
    "originalReleaseDate": "2008-11-30",
    "synopsis": "Bart makes friends with a Muslim boy named Bashir and his family, but Homer fears the family may be terrorists because of their religion. When he discovers that Bashir's father has explosives and plans to the Springfield Mall, he tries to stop him even though he really works in building demolition, causing Homer to accidentally blow up a bridge. The Simpsons hold an apology party for Bashir's family. Meanwhile, Lisa is given a MyPod and becomes addicted to downloading songs on it. When Lisa is unable to afford all the songs she downloaded, she is forced to hand out flyers for the MyPod as payment. Guest Star: Shohreh Aghdashloo."
  },
  {
    "seasonNumber": 20,
    "episodeNumberInSeason": 8,
    "title": "The Burns and the Bees",
    "originalReleaseDate": "2008-12-07",
    "synopsis": "After winning the Austin Celtics basketball team in a game of poker, Mr. Burns intends to build a new arena for the team in Springfield. Meanwhile, Lisa cares for a bee colony to save honeybees from extinction and finds a greenhouse where they can live. When Burns destroys the greenhouse for his arena, Homer and Moe mate the bees with Africanized bees so they can survive anywhere. They are released but go and inhabit the arena, and it is declared a bee sanctuary. Guest Stars: Mark Cuban, Jeff Bezos and Marv Albert."
  },
  {
    "seasonNumber": 20,
    "episodeNumberInSeason": 9,
    "title": "Lisa the Drama Queen",
    "originalReleaseDate": "2009-01-25",
    "synopsis": "Lisa meets a new girl named Juliet and helps her write stories about a fantasy world called Equalia, but spending too much time with Juliet and the story begins to warp Lisa's sense of reality. They run away to an abandoned restaurant to finish writing their story. After escaping the bullies who use the restaurant as their hang out, Lisa wants to live in the real world while Juliet wants to be in the fantasy world. Later, a publisher rejects Lisa's story. Guest Stars: Emily Blunt and Fall Out Boy. Note: This is the last episode to be broadcast in standard definition, the last episode to include the old opening (which had been used since season two), and the first episode to begin immediately after the credits without a commercial break."
  },
  {
    "seasonNumber": 20,
    "episodeNumberInSeason": 10,
    "title": "Take My Life, Please",
    "originalReleaseDate": "2009-02-15",
    "synopsis": "After an old high school rival named Vance is honored on the Springfield Wall of Fame, Homer becomes depressed when he discovers that Principal Dondelinger rigged the student council election so Vance would win. While at an Italian restaurant, a mysterious chef shows Homer how his life would have turned out had he actually won. He sees that he would have been rich and married to Marge but with no kids, and Homer becomes depressed. Later, Marge takes Homer to the Wall of Fame and shows that she forced Dondelinger to add Homer's name to the wall. After a boy takes a picture with him, Homer becomes happier. Note: This is the first episode to broadcast in 720p high definition and to use the new opening (which is similar to the old one, only it includes new characters and slight changes to some of the sequences)."
  },
  {
    "seasonNumber": 20,
    "episodeNumberInSeason": 11,
    "title": "How the Test Was Won",
    "originalReleaseDate": "2009-03-01",
    "synopsis": "Bart gets a perfect score on Springfield Elementary's latest standardized practice test, leaving Lisa worried that Bart may be smarter than her. Bart is rewarded with a field trip with other students that turns out to be an elaborate trick into getting the low-testing students and Principal Skinner out of the way. When Ralph gets into trouble and Skinner uses physics to rescue him, the students become interested in learning. Lisa, distracted by Bart's achievement, cannot concentrate during the real test, but Skinner returns and cancels the test. Meanwhile, Homer forgets to mail off his insurance payment and must keep himself and the house accident-free until his coverage can be reinstated at 3:00pm."
  },
  {
    "seasonNumber": 20,
    "episodeNumberInSeason": 12,
    "title": "No Loan Again, Naturally",
    "originalReleaseDate": "2009-03-08",
    "synopsis": "The Simpsons get into a mortgage crisis of their own when Homer cannot afford to pay off the money he borrows from his home equity loan so he can finance his extravagant Mardi Gras parties. The house is sold at auction to Ned Flanders after he feels sorry for them, and he lets them stay as renters. Flanders tires of their constant requests for repairs, so Homer calls him a slumlord. Flanders evicts the Simpsons, and they go to a homeless shelter. While interviewing new tenants, Flanders is reminded of the Simpsons' admiration of him and allows them to return. Guest Star: Maurice LaMarche."
  },
  {
    "seasonNumber": 20,
    "episodeNumberInSeason": 13,
    "title": "Gone Maggie Gone",
    "originalReleaseDate": "2009-03-15",
    "synopsis": "Marge goes blind after viewing an eclipse without an eclipse shoe box viewer. While caring for Maggie, Homer accidentally leaves Maggie on the doorstep of a convent, and the nuns refuse to return her. Homer tries to cover up Maggie's disappearance from Marge while Lisa goes undercover as a nun to find her. They refuse to tell Lisa where Maggie is but learn they are looking for a jewel. After solving a series of clues, she learns that Maggie is the jewel. At that moment, Marge enters the convent and takes back Maggie. Guest Star: Ed Begley, Jr."
  },
  {
    "seasonNumber": 20,
    "episodeNumberInSeason": 14,
    "title": "In the Name of the Grandfather",
    "originalReleaseDate": "2009-03-22",
    "synopsis": "After forgetting to visit Grampa while relaxing in a hot tub, Homer makes it up to him by taking him to a pub in Ireland, only to learn that pubs are not popular in Ireland anymore. While Marge and the kids visit Irish landmarks, while Homer and Grampa get drunk and accidentally buy the pub. To increase business, they allow smoking in the pub, which is illegal, until the police shut them down, and they are deported from Ireland. Guest Stars: Colm Meaney, Glen Hansard and Markéta Irglová."
  },
  {
    "seasonNumber": 20,
    "episodeNumberInSeason": 15,
    "title": "Wedding for Disaster",
    "originalReleaseDate": "2009-03-29",
    "synopsis": "When Reverend Lovejoy reveals to Homer and Marge that they are not legally married, Homer and Marge decide to have another wedding to legitimize their union once and for all. But when Marge begins acting like a bridezilla and Homer mysteriously disappears, it is up to Bart and Lisa to save the day. They discover Homer was kidnapped by Patty and Selma to stop him from marrying Marge. Saddened, Homer reads his wedding vows, which make the twins emotional, so they release him. When Bart and Lisa confront them, they are forced to pay for the wedding so that the kids do not tell their parents. Guest Star: Kelsey Grammer as Sideshow Bob. Note: A rerun of the episode was dedicated to Michael Jackson."
  },
  {
    "seasonNumber": 20,
    "episodeNumberInSeason": 16,
    "title": "Eeny Teeny Maya Moe",
    "originalReleaseDate": "2009-04-05",
    "synopsis": "Moe once again searches for love and falls for a woman named Maya over the Internet. However, when Moe meets Maya face-to-face, he discovers it is more like face-to-knee, as Maya is only three feet tall. When his friends like her, Moe tries to propose but makes fun of her height so she rejects him. Meanwhile, Homer finds a playground outside of Moe's where he can watch Maggie while he is at the bar. She is put in a playground, which has hostile babies. When Marge is worried for Maggie and puts a spy camera in her bow, she sees that Homer protects Maggie from the bullies."
  },
  {
    "seasonNumber": 20,
    "episodeNumberInSeason": 17,
    "title": "The Good, the Sad and the Drugly",
    "originalReleaseDate": "2009-04-19",
    "synopsis": "Bart sets up Milhouse to take the fall for a prank the two of them pulled, and the duo's friendship becomes strained when Bart falls for a charitable girl named Jenny. While Bart tries to be good for Jenny, Milhouse exposes him, and Jenny leaves him. Meanwhile, Lisa becomes insane and depressed after reading Internet articles predicting that Springfield will be a barren wasteland in fifty years, and is given anti-depressants that turn her into a mindless zombie. When she almost injures herself, Marge takes her off the medication. Lisa tells Bart not to worry about certain issues, so he apologizes to Milhouse. Guest Star: Anne Hathaway."
  },
  {
    "seasonNumber": 20,
    "episodeNumberInSeason": 18,
    "title": "Father Knows Worst",
    "originalReleaseDate": "2009-04-26",
    "synopsis": "Homer becomes a stricter parent after meeting a helicopter mom who criticizes Bart for being an academic failure and Lisa for being a social outcast. He helps Bart with a school project while encouraging Lisa to have a party with popular girls. While working on Bart's project, he has a dream where historical figures tell him to let Bart learn from his mistakes. Bart learns the same lesson while Lisa says she does not want to be popular because it is hard work. Meanwhile, Marge discovers a sauna in the basement of their house and shuts herself off from the rest of the world. When Homer thinks he has failed as a father, Marge brings him to the sauna to relax."
  },
  {
    "seasonNumber": 20,
    "episodeNumberInSeason": 19,
    "title": "Waverly Hills, 9-0-2-1-D'oh",
    "originalReleaseDate": "2009-05-03",
    "synopsis": "While desperately searching for a bathroom during her morning jog, Marge discovers how low-rent Springfield Elementary School really is and moves Bart and Lisa to Waverly Hills Elementary by having Homer rent an apartment there so the city inspector of Waverly Hills does not get suspicious. Meanwhile, Bart helps Lisa become popular at the new school by telling others that Lisa is friends with a teenage pop star named Alaska Nebraska. When Lisa goes to Alaska to ask for tickets to her concert, she is rejected and loses her friends. The kids ask to return to Springfield Elementary, and the parents allow it. Guest Stars: Elliot Page (credited as \"Ellen Page\") and Maurice LaMarche."
  },
  {
    "seasonNumber": 20,
    "episodeNumberInSeason": 20,
    "title": "Four Great Women and a Manicure",
    "originalReleaseDate": "2009-05-10",
    "synopsis": "While at a nail salon, Marge and Lisa argue over whether or not a woman can be smart, beautiful, and powerful all at once, which leads to yet another Simpsons anthology show, featuring four stories of women trying to survive in a man's world: Aunt Selma defending England as Queen Elizabeth I, Lisa in a non-copyright-infringing retelling of Snow White, Marge pushing Homer to be a great Shakespearean actor in a modern-day version of Macbeth, and Maggie fighting against conformity in a parody of Ayn Rand's The Fountainhead. Guest Star: Jodie Foster."
  },
  {
    "seasonNumber": 20,
    "episodeNumberInSeason": 21,
    "title": "Coming to Homerica",
    "originalReleaseDate": "2009-05-17",
    "synopsis": "Krusty Burger introduces a vegetarian burger than causes food poisoning. The cause is traced to tainted barley grown in Ogdenville. After the barley industry collapses, the citizens of Ogdenville swarm into Springfield in search of work, but when the Ogdenvillians' Norwegian culture begins rubbing off on others, Mayor Quimby hires citizens to act as a border patrol. They hire the Ogdenvillians to build a border wall to keep them out but miss them when the wall is complete. The Ogdenvillians return since they built a door in the wall."
  }
]
